{"class_name": "Model", "keras_version": "2.2.2", "backend": "tensorflow", "params": {"separable_conv_1_normal_right2_8": 115920, "activation_45": 0, "adjust_conv_2_0": 14112, "activation_6": 0, "separable_conv_2_reduction_right1_stem_1": 3822, "separable_conv_1_bn_normal_right1_12": 1344, "activation_131": 0, "separable_conv_2_normal_right2_3": 29736, "separable_conv_1_normal_left2_14": 468384, "normal_concat_17": 0, "adjust_conv_2_stem_2": 4032, "separable_conv_2_normal_left2_11": 121296, "separable_conv_2_bn_normal_left5_0": 672, "adjust_bn_reduce_12": 2688, "adjust_bn_1": 672, "separable_conv_2_normal_right1_4": 29736, "separable_conv_2_bn_reduction_right2_stem_2": 336, "normal_left3_10": 0, "adjust_conv_projection_17": 2709504, "normal_conv_1_8": 677376, "separable_conv_2_bn_normal_right1_15": 2688, "reduction_right5_reduce_6": 0, "separable_conv_2_normal_right1_2": 29736, "activation_97": 0, "normal_add_4_2": 0, "activation_215": 0, "normal_left4_13": 0, "activation_179": 0, "separable_conv_2_normal_right2_15": 457632, "separable_conv_1_normal_left1_18": 468384, "separable_conv_2_normal_right1_10": 115920, "separable_conv_1_bn_normal_right2_4": 672, "activation_138": 0, "separable_conv_1_bn_normal_left1_18": 2688, "activation_21": 0, "adjust_bn_18": 2688, "normal_add_1_2": 0, "separable_conv_1_bn_reduction_right1_stem_1": 168, "separable_conv_2_reduction_right2_stem_1": 3822, "separable_conv_2_reduction_right2_stem_2": 11172, "separable_conv_1_bn_normal_right2_11": 1344, "activation_210": 0, "activation_192": 0, "zero_padding2d_4": 0, "activation_41": 0, "normal_add_4_11": 0, "separable_conv_2_reduction_left1_stem_1": 2814, "normal_right4_15": 0, "separable_conv_2_normal_left1_10": 121296, "normal_add_3_14": 0, "separable_conv_2_bn_reduction_right3_reduce_6": 1344, "normal_left4_4": 0, "separable_conv_2_normal_right2_1": 29736, "normal_add_3_8": 0, "activation_224": 0, "adjust_conv_projection_1": 56448, "separable_conv_1_normal_right2_0": 29736, "normal_concat_10": 0, "normal_right4_10": 0, "separable_conv_2_bn_normal_right1_2": 672, "separable_conv_2_normal_left2_13": 468384, "activation_226": 0, "activation_59": 0, "separable_conv_1_bn_reduction_right1_reduce_12": 2688, "normal_add_3_1": 0, "separable_conv_2_bn_normal_right2_9": 1344, "activation_228": 0, "separable_conv_1_bn_reduction_right3_stem_1": 168, "normal_conv_1_13": 1806336, "separable_conv_1_normal_left1_1": 32424, "separable_conv_2_bn_normal_right1_0": 672, "separable_conv_1_bn_normal_left5_17": 2688, "separable_conv_2_normal_right2_12": 115920, "separable_conv_2_normal_left1_5": 32424, "activation_158": 0, "activation_68": 0, "separable_conv_2_normal_left5_1": 29736, "adjust_bn_14": 2688, "separable_conv_2_bn_reduction_right2_stem_1": 168, "activation_186": 0, "separable_conv_1_reduction_right3_reduce_6": 121296, "separable_conv_1_normal_left5_1": 29736, "activation_36": 0, "separable_conv_1_normal_right1_12": 115920, "separable_conv_1_bn_reduction_left1_reduce_6": 1344, "reduction_add_1_stem_2": 0, "adjust_avg_pool_1_13": 0, "separable_conv_1_normal_right2_15": 457632, "separable_conv_2_normal_left5_13": 457632, "separable_conv_2_bn_normal_left1_12": 1344, "separable_conv_1_normal_right1_14": 457632, "normal_bn_1_18": 2688, "separable_conv_1_bn_normal_right1_16": 2688, "predictions": 4033000, "separable_conv_2_normal_right1_5": 29736, "activation_164": 0, "activation_227": 0, "normal_left3_0": 0, "adjust_avg_pool_2_0": 0, "separable_conv_2_normal_left5_7": 115920, "activation_37": 0, "separable_conv_2_normal_left2_1": 32424, "separable_conv_2_normal_left1_0": 32424, "separable_conv_1_bn_reduction_right2_reduce_6": 1344, "activation_15": 0, "normal_conv_1_1": 169344, "separable_conv_1_bn_normal_right2_15": 2688, "separable_conv_2_normal_left5_16": 457632, "activation_71": 0, "zero_padding2d_1": 0, "zero_padding2d_2": 0, "separable_conv_1_normal_right1_9": 115920, "separable_conv_2_normal_right2_18": 457632, "separable_conv_1_normal_right2_2": 29736, "activation_67": 0, "separable_conv_1_normal_left2_0": 32424, "separable_conv_2_bn_normal_left5_8": 1344, "separable_conv_1_reduction_left1_stem_1": 2814, "separable_conv_1_normal_left5_10": 115920, "normal_add_4_13": 0, "activation_49": 0, "separable_conv_1_bn_reduction_right2_stem_1": 168, "adjust_conv_projection_14": 1806336, "separable_conv_2_bn_normal_left1_2": 672, "activation_236": 0, "separable_conv_1_bn_normal_right2_10": 1344, "normal_add_2_0": 0, "reduction_left3_reduce_12": 0, "activation_126": 0, "adjust_conv_projection_15": 2709504, "separable_conv_2_bn_reduction_left4_reduce_12": 2688, "normal_concat_9": 0, "activation_95": 0, "normal_conv_1_2": 169344, "activation_190": 0, "activation_54": 0, "separable_conv_1_bn_normal_left1_8": 1344, "activation_189": 0, "separable_conv_1_normal_left1_9": 121296, "activation_185": 0, "zero_padding2d_3": 0, "separable_conv_1_bn_normal_right2_18": 2688, "activation_5": 0, "normal_add_4_0": 0, "separable_conv_2_bn_normal_right1_11": 1344, "normal_conv_1_4": 169344, "separable_conv_1_normal_right1_13": 457632, "normal_add_4_10": 0, "separable_conv_1_normal_right1_15": 457632, "normal_left4_9": 0, "separable_conv_2_normal_left1_3": 32424, "separable_conv_1_bn_normal_right1_5": 672, "separable_conv_1_normal_left1_5": 32424, "separable_conv_1_normal_left2_13": 468384, "adjust_conv_projection_4": 169344, "activation_155": 0, "separable_conv_1_bn_normal_right1_18": 2688, "separable_conv_1_normal_left2_11": 121296, "separable_conv_2_bn_normal_right2_18": 2688, "separable_conv_1_normal_left2_12": 121296, "adjust_conv_projection_reduce_12": 1354752, "separable_conv_2_bn_normal_right2_14": 2688, "reduction_add4_reduce_12": 0, "separable_conv_1_normal_left2_8": 121296, "separable_conv_2_normal_left5_4": 29736, "normal_left4_5": 0, "separable_conv_1_bn_reduction_right3_stem_2": 336, "normal_conv_1_18": 2709504, "separable_conv_1_bn_reduction_right3_reduce_6": 1344, "activation_72": 0, "activation_160": 0, "separable_conv_1_bn_normal_right1_4": 672, "separable_conv_1_normal_left1_7": 121296, "separable_conv_1_reduction_right3_stem_2": 9156, "normal_add_2_1": 0, "separable_conv_1_bn_normal_left5_1": 672, "adjust_conv_projection_10": 677376, "activation_46": 0, "activation_239": 0, "normal_add_3_10": 0, "normal_add_2_3": 0, "adjust_conv_projection_2": 169344, "separable_conv_2_bn_normal_left5_7": 1344, "activation_237": 0, "adjust_conv_projection_5": 169344, "separable_conv_2_normal_left1_15": 468384, "separable_conv_1_normal_right2_4": 29736, "separable_conv_2_bn_normal_right2_15": 2688, "activation_219": 0, "activation_211": 0, "adjust_bn_4": 672, "activation_83": 0, "normal_bn_1_15": 2688, "activation_38": 0, "separable_conv_2_bn_normal_left1_9": 1344, "separable_conv_1_reduction_right1_reduce_12": 484512, "normal_bn_1_9": 1344, "adjust_conv_2_7": 169344, "activation_174": 0, "separable_conv_2_reduction_left1_reduce_12": 468384, "activation_157": 0, "adjust_bn_stem_2": 336, "normal_add_3_17": 0, "activation_120": 0, "separable_conv_2_normal_left1_7": 121296, "adjust_conv_projection_18": 2709504, "separable_conv_2_reduction_left4_reduce_6": 115920, "activation_128": 0, "normal_conv_1_0": 56448, "separable_conv_1_normal_left2_1": 32424, "activation_90": 0, "normal_left4_10": 0, "separable_conv_1_bn_normal_right1_13": 2688, "separable_conv_2_bn_normal_right2_7": 1344, "activation_103": 0, "separable_conv_2_normal_right2_10": 115920, "separable_conv_1_normal_left1_16": 468384, "separable_conv_2_bn_normal_left5_12": 1344, "separable_conv_2_bn_normal_right1_16": 2688, "separable_conv_1_reduction_right2_reduce_6": 129360, "activation_24": 0, "separable_conv_1_normal_left2_16": 468384, "separable_conv_1_bn_normal_right2_2": 672, "normal_add_2_10": 0, "separable_conv_2_bn_normal_right2_2": 672, "normal_conv_1_5": 169344, "separable_conv_1_normal_right2_1": 29736, "separable_conv_2_bn_normal_left5_9": 1344, "separable_conv_2_bn_normal_left5_5": 672, "separable_conv_1_bn_normal_left1_15": 2688, "normal_add_5_4": 0, "separable_conv_1_normal_right1_17": 457632, "normal_add_5_2": 0, "separable_conv_1_normal_left1_17": 468384, "normal_left3_15": 0, "normal_add_5_13": 0, "activation_23": 0, "normal_add_4_9": 0, "activation_20": 0, "separable_conv_2_normal_left5_18": 457632, "normal_add_1_13": 0, "separable_conv_1_reduction_left1_reduce_12": 468384, "activation_55": 0, "separable_conv_1_bn_normal_left5_13": 2688, "reduction_right5_stem_2": 0, "normal_add_3_0": 0, "normal_left3_3": 0, "separable_conv_1_bn_normal_right2_14": 2688, "separable_conv_2_bn_normal_left1_1": 672, "add_4": 0, "separable_conv_1_normal_right1_0": 29736, "separable_conv_2_bn_reduction_left1_stem_1": 168, "activation_47": 0, "separable_conv_2_normal_right1_0": 29736, "separable_conv_2_bn_normal_left5_1": 672, "separable_conv_1_normal_left5_11": 115920, "reduction_left4_stem_1": 0, "normal_add_5_1": 0, "separable_conv_1_normal_left5_2": 29736, "activation_232": 0, "separable_conv_2_reduction_left4_stem_2": 7812, "activation_209": 0, "separable_conv_1_normal_right1_3": 29736, "cropping2d_1": 0, "separable_conv_2_bn_normal_right1_17": 2688, "normal_left3_18": 0, "normal_add_4_17": 0, "separable_conv_1_normal_left2_3": 32424, "normal_left4_11": 0, "activation_223": 0, "activation_151": 0, "separable_conv_1_bn_normal_left2_16": 2688, "normal_add_3_15": 0, "normal_add_2_2": 0, "separable_conv_1_normal_left2_4": 32424, "separable_conv_2_bn_normal_left1_7": 1344, "separable_conv_2_bn_normal_left2_8": 1344, "activation_121": 0, "separable_conv_2_bn_normal_right2_16": 2688, "normal_concat_3": 0, "normal_add_1_7": 0, "activation_32": 0, "normal_left4_15": 0, "normal_left3_8": 0, "activation_170": 0, "adjust_conv_2_13": 677376, "activation_207": 0, "separable_conv_1_bn_normal_right1_2": 672, "separable_conv_1_reduction_left4_reduce_6": 115920, "separable_conv_2_bn_normal_left5_17": 2688, "normal_add_5_7": 0, "activation_252": 0, "separable_conv_1_bn_normal_left5_4": 672, "normal_conv_1_11": 677376, "reduction_left4_reduce_12": 0, "concatenate_3": 0, "activation_225": 0, "normal_concat_2": 0, "normal_add_4_12": 0, "activation_100": 0, "adjust_conv_projection_11": 677376, "activation_93": 0, "activation_248": 0, "adjust_conv_projection_8": 451584, "activation_101": 0, "activation_122": 0, "activation_137": 0, "separable_conv_1_normal_left5_12": 115920, "reduction_left3_stem_1": 0, "separable_conv_2_bn_normal_left2_15": 2688, "separable_conv_1_bn_reduction_left4_stem_1": 168, "reduction_right5_stem_1": 0, "separable_conv_1_reduction_right3_stem_1": 6432, "activation_89": 0, "separable_conv_1_bn_normal_right1_17": 2688, "activation_230": 0, "normal_add_4_8": 0, "activation_156": 0, "separable_conv_2_bn_normal_left1_18": 2688, "separable_conv_2_bn_normal_right2_17": 2688, "normal_add_4_15": 0, "activation_44": 0, "normal_concat_4": 0, "activation_13": 0, "activation_172": 0, "separable_conv_2_normal_right2_5": 29736, "normal_add_4_18": 0, "separable_conv_2_bn_reduction_left4_stem_2": 336, "separable_conv_2_normal_right1_16": 457632, "separable_conv_1_bn_normal_left2_8": 1344, "separable_conv_1_bn_reduction_right3_reduce_12": 2688, "activation_30": 0, "activation_8": 0, "activation_144": 0, "activation_7": 0, "normal_conv_1_7": 451584, "separable_conv_2_normal_left2_5": 32424, "separable_conv_1_reduction_right3_reduce_12": 468384, "activation_182": 0, "separable_conv_1_bn_normal_left1_0": 672, "activation_12": 0, "separable_conv_2_bn_normal_left5_13": 2688, "activation_43": 0, "separable_conv_2_normal_left5_10": 115920, "adjust_bn_16": 2688, "separable_conv_1_bn_normal_left1_14": 2688, "normal_add_2_11": 0, "normal_right4_11": 0, "normal_add_3_18": 0, "separable_conv_1_normal_left1_2": 32424, "separable_conv_1_normal_right1_7": 115920, "separable_conv_2_reduction_right3_reduce_6": 121296, "activation_181": 0, "activation_256": 0, "separable_conv_1_normal_right1_11": 115920, "separable_conv_2_bn_normal_left2_18": 2688, "separable_conv_1_bn_normal_left5_14": 2688, "separable_conv_1_normal_left1_13": 468384, "activation_260": 0, "activation_70": 0, "separable_conv_2_normal_left2_16": 468384, "separable_conv_1_bn_reduction_right1_reduce_6": 1344, "separable_conv_1_normal_right2_3": 29736, "separable_conv_1_bn_normal_right2_13": 2688, "activation_50": 0, "adjust_avg_pool_2_13": 0, "separable_conv_2_reduction_left4_stem_1": 2142, "separable_conv_1_bn_normal_right2_8": 1344, "activation_258": 0, "activation_14": 0, "normal_add_4_3": 0, "activation_216": 0, "separable_conv_2_normal_right1_15": 457632, "activation_205": 0, "separable_conv_1_bn_reduction_right2_stem_2": 336, "activation_176": 0, "separable_conv_2_normal_left1_17": 468384, "normal_conv_1_9": 677376, "separable_conv_1_bn_normal_left5_15": 2688, "activation_39": 0, "activation_48": 0, "separable_conv_2_normal_left1_8": 121296, "activation_204": 0, "separable_conv_1_bn_reduction_left4_reduce_6": 1344, "normal_add_1_9": 0, "activation_129": 0, "separable_conv_2_normal_left2_10": 121296, "activation_74": 0, "separable_conv_1_bn_normal_right2_0": 672, "separable_conv_2_bn_reduction_right2_reduce_12": 2688, "concatenate_1": 0, "separable_conv_2_normal_left1_1": 32424, "separable_conv_2_normal_left5_8": 115920, "normal_add_4_7": 0, "activation_66": 0, "activation_99": 0, "separable_conv_1_normal_left1_10": 121296, "separable_conv_1_bn_normal_left2_3": 672, "activation_147": 0, "adjust_relu_1_stem_2": 0, "activation_108": 0, "adjust_bn_9": 1344, "separable_conv_1_normal_right2_16": 457632, "normal_add_1_1": 0, "reduction_bn_1_stem_1": 168, "separable_conv_1_bn_normal_right2_17": 2688, "normal_right4_16": 0, "separable_conv_1_normal_right2_13": 457632, "normal_add_3_3": 0, "separable_conv_1_normal_right1_1": 29736, "separable_conv_2_normal_right2_13": 457632, "separable_conv_1_normal_right1_5": 29736, "activation_167": 0, "separable_conv_2_normal_right2_2": 29736, "separable_conv_2_normal_left1_13": 468384, "separable_conv_2_bn_reduction_right3_reduce_12": 2688, "activation_240": 0, "separable_conv_1_normal_left1_4": 32424, "stem_conv1": 2592, "normal_concat_13": 0, "activation_10": 0, "separable_conv_2_normal_right2_4": 29736, "separable_conv_1_bn_normal_left2_9": 1344, "activation_208": 0, "concatenate_2": 0, "activation_171": 0, "normal_concat_18": 0, "input_1": 0, "separable_conv_2_bn_normal_right1_8": 1344, "separable_conv_2_bn_normal_left1_13": 2688, "normal_left4_16": 0, "reduction_right5_reduce_12": 0, "activation_149": 0, "normal_add_5_17": 0, "separable_conv_1_normal_right1_10": 115920, "normal_right4_0": 0, "normal_conv_1_15": 2709504, "reduction_concat_reduce_12": 0, "separable_conv_1_bn_normal_left1_1": 672, "separable_conv_1_normal_right1_4": 29736, "normal_add_5_8": 0, "separable_conv_1_bn_reduction_left1_stem_2": 336, "separable_conv_1_normal_left1_11": 121296, "activation_61": 0, "normal_right4_1": 0, "separable_conv_2_normal_right2_17": 457632, "separable_conv_1_bn_normal_right1_1": 672, "separable_conv_2_bn_reduction_right3_stem_1": 168, "separable_conv_2_bn_normal_left5_14": 2688, "activation_42": 0, "activation_115": 0, "normal_bn_1_2": 672, "separable_conv_1_bn_normal_left1_16": 2688, "separable_conv_2_normal_left5_15": 457632, "separable_conv_1_bn_reduction_left1_reduce_12": 2688, "normal_right4_13": 0, "separable_conv_2_bn_normal_left5_11": 1344, "normal_right4_8": 0, "separable_conv_2_reduction_right2_reduce_12": 484512, "separable_conv_1_normal_right2_11": 115920, "normal_conv_1_10": 677376, "normal_left3_16": 0, "normal_add_5_15": 0, "normal_add_5_5": 0, "normal_add_1_4": 0, "normal_bn_1_8": 1344, "activation_184": 0, "normal_bn_1_11": 1344, "activation_180": 0, "separable_conv_2_normal_left5_3": 29736, "activation_175": 0, "separable_conv_1_bn_normal_right1_0": 672, "activation_218": 0, "normal_bn_1_10": 1344, "normal_add_2_9": 0, "activation_4": 0, "activation_96": 0, "normal_right4_4": 0, "separable_conv_1_bn_normal_right1_14": 2688, "separable_conv_2_bn_normal_left2_4": 672, "normal_add_5_10": 0, "separable_conv_1_bn_normal_left1_4": 672, "separable_conv_1_normal_right2_7": 115920, "separable_conv_2_bn_reduction_right3_stem_2": 336, "activation_123": 0, "activation_214": 0, "adjust_bn_12": 1344, "activation_153": 0, "reduction_left4_stem_2": 0, "activation_161": 0, "separable_conv_2_bn_normal_left5_2": 672, "separable_conv_2_bn_normal_left5_10": 1344, "activation_62": 0, "separable_conv_1_bn_normal_left2_12": 1344, "separable_conv_2_normal_left1_11": 121296, "normal_add_1_0": 0, "separable_conv_1_bn_normal_left2_17": 2688, "normal_left3_12": 0, "activation_125": 0, "reduction_concat_reduce_6": 0, "activation_84": 0, "separable_conv_2_bn_normal_left2_11": 1344, "activation_231": 0, "separable_conv_1_bn_normal_left1_3": 672, "normal_add_1_3": 0, "separable_conv_1_bn_normal_left1_9": 1344, "activation_152": 0, "activation_52": 0, "separable_conv_1_bn_normal_left5_7": 1344, "normal_left3_4": 0, "separable_conv_1_bn_normal_right2_7": 1344, "normal_add_4_16": 0, "separable_conv_2_normal_right1_12": 115920, "activation_200": 0, "normal_add_3_16": 0, "normal_right4_5": 0, "separable_conv_2_bn_normal_right1_5": 672, "activation_194": 0, "normal_add_4_1": 0, "normal_add_5_3": 0, "separable_conv_1_normal_left5_14": 457632, "adjust_relu_1_7": 0, "separable_conv_2_normal_left5_17": 457632, "separable_conv_1_bn_normal_left2_2": 672, "normal_add_1_8": 0, "separable_conv_2_normal_left2_15": 468384, "separable_conv_2_reduction_right1_reduce_12": 484512, "adjust_conv_1_stem_2": 4032, "activation_3": 0, "activation_197": 0, "normal_add_2_14": 0, "separable_conv_2_bn_normal_right2_1": 672, "separable_conv_1_bn_normal_left2_4": 672, "separable_conv_1_bn_normal_left2_1": 672, "separable_conv_2_normal_left5_5": 29736, "separable_conv_2_bn_normal_left1_4": 672, "activation_87": 0, "adjust_bn_0": 672, "separable_conv_1_normal_left2_7": 121296, "activation_142": 0, "separable_conv_1_normal_left1_3": 32424, "separable_conv_2_bn_reduction_left4_stem_1": 168, "activation_229": 0, "separable_conv_1_bn_normal_right2_9": 1344, "activation_124": 0, "activation_177": 0, "activation_58": 0, "activation_243": 0, "separable_conv_1_reduction_right1_stem_2": 11172, "separable_conv_2_reduction_right3_stem_2": 9156, "activation_195": 0, "separable_conv_2_normal_left1_16": 468384, "separable_conv_1_bn_normal_left2_10": 1344, "separable_conv_2_reduction_right1_reduce_6": 129360, "separable_conv_1_normal_left1_8": 121296, "adjust_avg_pool_2_7": 0, "normal_add_1_16": 0, "separable_conv_2_normal_left1_9": 121296, "separable_conv_1_bn_reduction_left4_reduce_12": 2688, "activation_213": 0, "separable_conv_2_normal_right1_1": 29736, "normal_add_5_9": 0, "adjust_bn_7": 1344, "separable_conv_1_reduction_right2_stem_2": 11172, "separable_conv_2_bn_normal_right2_11": 1344, "normal_add_2_18": 0, "normal_right4_3": 0, "separable_conv_2_bn_normal_right2_0": 672, "separable_conv_2_bn_normal_left2_9": 1344, "activation_159": 0, "activation_134": 0, "separable_conv_1_normal_left2_17": 468384, "adjust_conv_projection_3": 169344, "normal_left4_2": 0, "activation_29": 0, "activation_64": 0, "activation_136": 0, "separable_conv_2_normal_left5_11": 115920, "reduction_add3_reduce_12": 0, "activation_78": 0, "activation_33": 0, "normal_conv_1_12": 677376, "separable_conv_1_normal_left5_15": 457632, "separable_conv_1_normal_left5_7": 115920, "activation_77": 0, "separable_conv_1_normal_right2_12": 115920, "activation_76": 0, "activation_220": 0, "normal_right4_12": 0, "reduction_add4_stem_1": 0, "separable_conv_1_normal_left2_9": 121296, "activation_86": 0, "normal_bn_1_0": 672, "separable_conv_2_reduction_right1_stem_2": 11172, "reduction_bn_1_reduce_12": 2688, "separable_conv_1_normal_right2_17": 457632, "separable_conv_2_bn_normal_right1_9": 1344, "normal_left4_8": 0, "global_average_pooling2d_1": 0, "activation_247": 0, "separable_conv_2_normal_right2_8": 115920, "normal_left3_13": 0, "normal_concat_16": 0, "reduction_add_2_stem_1": 0, "separable_conv_2_reduction_right3_stem_1": 2814, "separable_conv_2_bn_normal_left1_10": 1344, "activation_27": 0, "separable_conv_2_normal_right2_11": 115920, "normal_add_3_5": 0, "separable_conv_1_normal_left5_5": 29736, "separable_conv_1_normal_left5_16": 457632, "separable_conv_1_bn_reduction_right1_stem_2": 336, "activation_241": 0, "separable_conv_2_bn_normal_right1_1": 672, "separable_conv_2_bn_reduction_right1_stem_1": 168, "separable_conv_1_bn_reduction_left1_stem_1": 168, "normal_add_1_18": 0, "activation_116": 0, "separable_conv_1_bn_normal_right2_3": 672, "separable_conv_1_normal_left5_4": 29736, "separable_conv_1_bn_normal_left5_2": 672, "normal_add_1_15": 0, "separable_conv_1_normal_right2_18": 457632, "activation_51": 0, "activation_91": 0, "separable_conv_2_bn_reduction_left1_reduce_12": 2688, "separable_conv_2_bn_normal_right2_5": 672, "separable_conv_2_bn_normal_left5_4": 672, "normal_add_2_13": 0, "separable_conv_1_bn_normal_right1_3": 672, "activation_244": 0, "separable_conv_2_bn_normal_left1_5": 672, "activation_145": 0, "separable_conv_2_bn_normal_left2_14": 2688, "activation_254": 0, "normal_add_3_2": 0, "separable_conv_2_normal_left1_14": 468384, "separable_conv_1_bn_normal_left1_11": 1344, "activation_114": 0, "activation_168": 0, "separable_conv_1_bn_normal_right2_5": 672, "activation_246": 0, "activation_112": 0, "activation_102": 0, "normal_add_2_17": 0, "separable_conv_2_normal_left2_3": 32424, "reduction_bn_1_reduce_6": 1344, "separable_conv_1_reduction_right2_reduce_12": 484512, "normal_left4_18": 0, "adjust_conv_1_7": 169344, "normal_bn_1_13": 2688, "separable_conv_1_bn_normal_left1_2": 672, "separable_conv_1_bn_normal_left2_11": 1344, "activation_127": 0, "normal_add_4_14": 0, "separable_conv_1_normal_left5_8": 115920, "activation_106": 0, "normal_add_1_10": 0, "separable_conv_1_bn_normal_right2_16": 2688, "separable_conv_2_bn_normal_right1_14": 2688, "reduction_add_2_stem_2": 0, "activation_82": 0, "activation_212": 0, "separable_conv_2_bn_reduction_right2_reduce_6": 1344, "activation_253": 0, "separable_conv_1_reduction_left4_stem_2": 7812, "normal_concat_1": 0, "normal_add_1_11": 0, "adjust_bn_13": 2688, "reduction_add4_stem_2": 0, "activation_130": 0, "reduction_add4_reduce_6": 0, "adjust_avg_pool_1_0": 0, "normal_concat_0": 0, "normal_add_5_0": 0, "separable_conv_1_bn_normal_right1_11": 1344, "reduction_left2_reduce_12": 0, "separable_conv_2_bn_reduction_left1_reduce_6": 1344, "separable_conv_1_bn_normal_right2_1": 672, "normal_right4_17": 0, "concatenate_4": 0, "separable_conv_2_normal_right2_9": 115920, "separable_conv_1_reduction_right1_stem_1": 8736, "separable_conv_1_normal_left5_13": 457632, "normal_concat_12": 0, "separable_conv_2_bn_normal_left2_16": 2688, "normal_add_2_7": 0, "adjust_conv_1_0": 14112, "add_2": 0, "activation_249": 0, "normal_conv_1_3": 169344, "separable_conv_1_bn_normal_left5_18": 2688, "reduction_add3_stem_2": 0, "adjust_bn_5": 672, "separable_conv_1_bn_normal_left2_13": 2688, "normal_bn_1_1": 672, "separable_conv_1_bn_normal_right1_9": 1344, "separable_conv_2_bn_normal_left5_18": 2688, "cropping2d_2": 0, "activation_154": 0, "separable_conv_1_normal_left1_14": 468384, "separable_conv_1_reduction_right1_reduce_6": 129360, "separable_conv_2_normal_right1_3": 29736, "adjust_bn_reduce_6": 1344, "separable_conv_2_normal_left5_12": 115920, "normal_add_1_5": 0, "adjust_bn_3": 672, "separable_conv_1_normal_left5_18": 457632, "separable_conv_2_bn_normal_right1_7": 1344, "normal_concat_8": 0, "separable_conv_1_bn_normal_left5_0": 672, "normal_add_5_14": 0, "activation_34": 0, "normal_bn_1_12": 1344, "reduction_add_2_reduce_12": 0, "separable_conv_2_bn_normal_left2_17": 2688, "normal_add_1_14": 0, "separable_conv_1_bn_normal_left1_17": 2688, "normal_left3_5": 0, "activation_60": 0, "activation_238": 0, "activation_63": 0, "separable_conv_2_normal_right1_18": 457632, "separable_conv_1_bn_normal_left5_12": 1344, "separable_conv_2_reduction_left4_reduce_12": 457632, "reduction_concat_stem_1": 0, "add_3": 0, "separable_conv_1_normal_left5_9": 115920, "separable_conv_1_bn_normal_left5_11": 1344, "normal_add_5_11": 0, "separable_conv_1_normal_right2_14": 457632, "activation_250": 0, "reduction_left2_stem_1": 0, "separable_conv_2_bn_normal_right2_12": 1344, "separable_conv_2_normal_right1_8": 115920, "adjust_conv_projection_16": 2709504, "reduction_add3_stem_1": 0, "normal_add_2_8": 0, "activation_111": 0, "normal_add_3_12": 0, "separable_conv_2_normal_left5_0": 29736, "separable_conv_1_normal_left1_0": 32424, "adjust_bn_11": 1344, "separable_conv_1_normal_left2_2": 32424, "activation_235": 0, "adjust_bn_15": 2688, "normal_add_5_12": 0, "separable_conv_1_normal_right2_10": 115920, "add_1": 0, "activation_233": 0, "normal_left4_14": 0, "activation_17": 0, "activation_65": 0, "separable_conv_2_bn_normal_right2_8": 1344, "activation_148": 0, "activation_75": 0, "separable_conv_1_bn_reduction_right2_reduce_12": 2688, "adjust_bn_8": 1344, "activation_132": 0, "activation_198": 0, "separable_conv_1_normal_left2_10": 121296, "separable_conv_2_bn_normal_right1_13": 2688, "reduction_conv_1_stem_1": 4032, "separable_conv_1_bn_normal_right2_12": 1344, "separable_conv_1_bn_normal_right1_7": 1344, "activation_9": 0, "activation_28": 0, "activation_109": 0, "reduction_add3_reduce_6": 0, "separable_conv_2_normal_left2_0": 32424, "activation_113": 0, "activation_57": 0, "normal_add_2_12": 0, "separable_conv_2_normal_right1_14": 457632, "activation_81": 0, "activation_119": 0, "normal_add_1_12": 0, "activation_251": 0, "activation_140": 0, "separable_conv_1_normal_right2_5": 29736, "activation_221": 0, "normal_left4_0": 0, "activation_80": 0, "activation_191": 0, "activation_165": 0, "separable_conv_1_bn_normal_left1_5": 672, "normal_add_2_15": 0, "normal_conv_1_17": 2709504, "separable_conv_2_bn_normal_left1_16": 2688, "normal_bn_1_5": 672, "activation_242": 0, "adjust_avg_pool_1_stem_2": 0, "reduction_left4_reduce_6": 0, "adjust_bn_2": 672, "activation_110": 0, "reduction_left2_stem_2": 0, "separable_conv_2_normal_left1_2": 32424, "reduction_left2_reduce_6": 0, "adjust_relu_1_13": 0, "separable_conv_1_bn_normal_left5_10": 1344, "separable_conv_2_bn_normal_right1_10": 1344, "normal_left4_1": 0, "normal_add_1_17": 0, "normal_left3_11": 0, "normal_left3_1": 0, "activation_11": 0, "normal_left3_14": 0, "activation_178": 0, "separable_conv_2_normal_right1_7": 115920, "separable_conv_1_bn_normal_left2_15": 2688, "activation_69": 0, "activation_88": 0, "separable_conv_2_bn_normal_left1_3": 672, "separable_conv_2_normal_right1_17": 457632, "adjust_conv_1_13": 677376, "separable_conv_1_normal_right1_2": 29736, "separable_conv_2_normal_left2_9": 121296, "activation_203": 0, "normal_add_2_5": 0, "activation_173": 0, "separable_conv_2_bn_normal_left2_13": 2688, "normal_add_4_5": 0, "separable_conv_2_normal_right2_0": 29736, "separable_conv_1_normal_left5_0": 29736, "adjust_bn_17": 2688, "reduction_add_1_reduce_12": 0, "separable_conv_1_bn_normal_left2_14": 2688, "normal_concat_11": 0, "separable_conv_2_normal_right2_7": 115920, "activation_85": 0, "normal_right4_2": 0, "activation_16": 0, "activation_188": 0, "separable_conv_2_normal_right1_11": 115920, "separable_conv_1_normal_left1_15": 468384, "activation_245": 0, "activation_31": 0, "separable_conv_1_reduction_left1_reduce_6": 121296, "activation_187": 0, "separable_conv_1_normal_left2_18": 468384, "separable_conv_2_bn_normal_left5_3": 672, "separable_conv_2_bn_normal_left2_0": 672, "normal_right4_18": 0, "separable_conv_1_normal_right1_16": 457632, "separable_conv_1_reduction_right2_stem_1": 8736, "separable_conv_2_bn_normal_left2_12": 1344, "separable_conv_1_bn_normal_left5_3": 672, "activation_133": 0, "adjust_avg_pool_2_stem_2": 0, "activation_162": 0, "separable_conv_1_bn_normal_right1_15": 2688, "separable_conv_1_normal_left1_12": 121296, "activation_196": 0, "activation_143": 0, "activation_201": 0, "separable_conv_1_bn_normal_left2_0": 672, "separable_conv_1_bn_reduction_left4_stem_2": 336, "activation_193": 0, "separable_conv_2_normal_left1_4": 32424, "separable_conv_2_normal_right1_13": 457632, "separable_conv_2_bn_normal_right1_4": 672, "separable_conv_1_bn_normal_right1_10": 1344, "normal_add_4_4": 0, "activation_1": 0, "normal_bn_1_16": 2688, "separable_conv_2_normal_left2_7": 121296, "separable_conv_1_bn_normal_left1_12": 1344, "separable_conv_2_normal_left2_2": 32424, "activation_118": 0, "activation_79": 0, "separable_conv_1_bn_normal_left1_10": 1344, "separable_conv_1_normal_left2_15": 468384, "activation_202": 0, "activation_73": 0, "separable_conv_1_bn_normal_left1_7": 1344, "separable_conv_2_bn_normal_right2_13": 2688, "activation_117": 0, "separable_conv_2_bn_normal_left2_10": 1344, "activation_163": 0, "separable_conv_2_normal_left2_8": 121296, "separable_conv_2_normal_left2_14": 468384, "separable_conv_2_bn_normal_left5_16": 2688, "normal_add_2_16": 0, "separable_conv_1_bn_normal_left2_5": 672, "normal_add_3_7": 0, "activation_259": 0, "normal_add_2_4": 0, "separable_conv_1_normal_left5_17": 457632, "separable_conv_1_bn_normal_left5_5": 672, "separable_conv_2_bn_normal_right1_18": 2688, "normal_left3_9": 0, "separable_conv_2_bn_normal_right2_3": 672, "adjust_relu_1_0": 0, "separable_conv_1_normal_right1_8": 115920, "normal_bn_1_7": 1344, "activation_107": 0, "separable_conv_2_normal_left1_12": 121296, "adjust_bn_10": 1344, "reduction_add_1_stem_1": 0, "separable_conv_2_bn_normal_left1_11": 1344, "activation_139": 0, "separable_conv_2_bn_normal_left1_8": 1344, "normal_conv_1_14": 2709504, "cropping2d_4": 0, "separable_conv_2_normal_left2_17": 468384, "activation_135": 0, "normal_bn_1_14": 2688, "separable_conv_1_reduction_left1_stem_2": 9156, "separable_conv_2_normal_right2_16": 457632, "activation_234": 0, "normal_left4_3": 0, "adjust_conv_projection_reduce_6": 338688, "activation_199": 0, "separable_conv_2_reduction_left1_stem_2": 9156, "reduction_left3_reduce_6": 0, "separable_conv_1_reduction_left4_stem_1": 2142, "separable_conv_2_bn_normal_left2_1": 672, "normal_concat_5": 0, "normal_left3_2": 0, "adjust_conv_projection_9": 677376, "separable_conv_2_bn_reduction_right1_stem_2": 336, "activation_150": 0, "separable_conv_2_bn_normal_left1_15": 2688, "separable_conv_1_bn_normal_left5_9": 1344, "activation_25": 0, "cropping2d_3": 0, "activation_22": 0, "normal_add_3_9": 0, "separable_conv_2_bn_normal_left1_14": 2688, "activation_92": 0, "separable_conv_2_normal_left5_9": 115920, "activation_35": 0, "adjust_avg_pool_1_7": 0, "normal_left4_12": 0, "separable_conv_1_bn_normal_left5_16": 2688, "separable_conv_1_bn_normal_left5_8": 1344, "separable_conv_1_bn_normal_right1_8": 1344, "separable_conv_2_normal_left5_2": 29736, "stem_bn1": 384, "activation_94": 0, "separable_conv_2_normal_left1_18": 468384, "separable_conv_2_reduction_left1_reduce_6": 121296, "separable_conv_1_bn_normal_left1_13": 2688, "activation_169": 0, "reduction_conv_1_reduce_6": 338688, "normal_conv_1_16": 2709504, "reduction_left3_stem_2": 0, "activation_18": 0, "activation_257": 0, "separable_conv_2_reduction_right2_reduce_6": 129360, "normal_left4_7": 0, "adjust_conv_projection_12": 677376, "activation_255": 0, "activation_183": 0, "normal_bn_1_3": 672, "separable_conv_2_bn_reduction_left1_stem_2": 336, "separable_conv_2_bn_normal_right2_10": 1344, "activation_53": 0, "separable_conv_2_normal_left5_14": 457632, "separable_conv_2_bn_normal_left1_0": 672, "reduction_add_2_reduce_6": 0, "normal_add_3_4": 0, "separable_conv_1_reduction_left4_reduce_12": 457632, "separable_conv_2_bn_normal_right1_3": 672, "normal_right4_9": 0, "separable_conv_1_normal_left5_3": 29736, "activation_104": 0, "activation_19": 0, "normal_add_3_13": 0, "normal_left4_17": 0, "separable_conv_2_bn_reduction_right1_reduce_6": 1344, "separable_conv_2_bn_normal_left2_3": 672, "activation_2": 0, "normal_add_3_11": 0, "normal_concat_7": 0, "normal_concat_15": 0, "separable_conv_2_bn_normal_left2_7": 1344, "activation_222": 0, "reduction_concat_stem_2": 0, "separable_conv_2_bn_normal_left1_17": 2688, "separable_conv_2_bn_normal_left5_15": 2688, "reduction_conv_1_stem_2": 14112, "activation_26": 0, "normal_right4_14": 0, "separable_conv_2_bn_normal_left2_2": 672, "activation_146": 0, "normal_right4_7": 0, "separable_conv_1_bn_normal_left2_18": 2688, "normal_add_5_16": 0, "separable_conv_1_bn_normal_left2_7": 1344, "normal_add_5_18": 0, "separable_conv_2_bn_normal_right2_4": 672, "normal_bn_1_17": 2688, "separable_conv_2_bn_reduction_right1_reduce_12": 2688, "separable_conv_1_normal_right2_9": 115920, "separable_conv_2_bn_normal_left2_5": 672, "separable_conv_2_normal_left2_12": 121296, "activation_98": 0, "separable_conv_2_bn_normal_right1_12": 1344, "activation_217": 0, "reduction_conv_1_reduce_12": 1354752, "separable_conv_2_reduction_right3_reduce_12": 468384, "normal_bn_1_4": 672, "normal_concat_14": 0, "reduction_add_1_reduce_6": 0, "activation_206": 0, "normal_left3_7": 0, "activation_141": 0, "separable_conv_2_normal_left2_4": 32424, "activation_40": 0, "activation_56": 0, "separable_conv_2_bn_reduction_left4_reduce_6": 1344, "reduction_bn_1_stem_2": 336, "separable_conv_1_normal_right1_18": 457632, "activation_105": 0, "separable_conv_2_normal_right1_9": 115920, "activation_166": 0, "separable_conv_2_normal_left2_18": 468384, "separable_conv_1_normal_left2_5": 32424, "separable_conv_2_normal_right2_14": 457632, "normal_left3_17": 0}, "config": {"name": "NASNet", "output_layers": [["predictions", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_1", "batch_input_shape": [null, 331, 331, 3], "dtype": "float32", "sparse": false}}, {"name": "stem_conv1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"name": "stem_conv1", "trainable": true, "filters": 96, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [3, 3], "use_bias": false, "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "bias_constraint": null}}, {"name": "stem_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["stem_conv1", 0, 0, {}]]], "config": {"name": "stem_bn1", "gamma_constraint": null, "scale": true, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9997, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "activation_1", "class_name": "Activation", "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"name": "reduction_conv_1_stem_1", "class_name": "Conv2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"name": "reduction_conv_1_stem_1", "trainable": true, "filters": 42, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [1, 1], "use_bias": false, "strides": [1, 1], "padding": "same", "data_format": "channels_last", "bias_constraint": null}}, {"name": "reduction_bn_1_stem_1", "class_name": "BatchNormalization", "inbound_nodes": [[["reduction_conv_1_stem_1", 0, 0, {}]]], "config": {"name": "reduction_bn_1_stem_1", "gamma_constraint": null, "scale": true, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9997, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "activation_2", "class_name": "Activation", "inbound_nodes": [[["reduction_bn_1_stem_1", 0, 0, {}]]], "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"name": "activation_4", "class_name": "Activation", "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"name": "separable_conv_1_reduction_left1_stem_1", "class_name": "SeparableConv2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"name": "separable_conv_1_reduction_left1_stem_1", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "depthwise_constraint": null, "trainable": true, "filters": 42, "bias_regularizer": null, "dilation_rate": [1, 1], "pointwise_constraint": null, "pointwise_regularizer": null, "activation": "linear", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [5, 5], "use_bias": false, "strides": [2, 2], "depthwise_regularizer": null, "padding": "same", "data_format": "channels_last", "depth_multiplier": 1, "bias_constraint": null}}, {"name": "separable_conv_1_reduction_right1_stem_1", "class_name": "SeparableConv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"name": "separable_conv_1_reduction_right1_stem_1", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "depthwise_constraint": null, "trainable": true, "filters": 42, "bias_regularizer": null, "dilation_rate": [1, 1], "pointwise_constraint": null, "pointwise_regularizer": null, "activation": "linear", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [7, 7], "use_bias": false, "strides": [2, 2], "depthwise_regularizer": null, "padding": "same", "data_format": "channels_last", "depth_multiplier": 1, "bias_constraint": null}}, {"name": "separable_conv_1_bn_reduction_left1_stem_1", "class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv_1_reduction_left1_stem_1", 0, 0, {}]]], "config": {"name": "separable_conv_1_bn_reduction_left1_stem_1", "gamma_constraint": null, "scale": true, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9997, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "separable_conv_1_bn_reduction_right1_stem_1", "class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv_1_reduction_right1_stem_1", 0, 0, {}]]], "config": {"name": "separable_conv_1_bn_reduction_right1_stem_1", "gamma_constraint": null, "scale": true, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9997, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "activation_3", "class_name": "Activation", "inbound_nodes": [[["separable_conv_1_bn_reduction_left1_stem_1", 0, 0, {}]]], "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"name": "activation_5", "class_name": "Activation", "inbound_nodes": [[["separable_conv_1_bn_reduction_right1_stem_1", 0, 0, {}]]], "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"name": "separable_conv_2_reduction_left1_stem_1", "class_name": "SeparableConv2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"name": "separable_conv_2_reduction_left1_stem_1", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "depthwise_constraint": null, "trainable": true, "filters": 42, "bias_regularizer": null, "dilation_rate": [1, 1], "pointwise_constraint": null, "pointwise_regularizer": null, "activation": "linear", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [5, 5], "use_bias": false, "strides": [1, 1], "depthwise_regularizer": null, "padding": "same", "data_format": "channels_last", "depth_multiplier": 1, "bias_constraint": null}}, {"name": "separable_conv_2_reduction_right1_stem_1", "class_name": "SeparableConv2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"name": "separable_conv_2_reduction_right1_stem_1", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "depthwise_constraint": null, "trainable": true, "filters": 42, "bias_regularizer": null, "dilation_rate": [1, 1], "pointwise_constraint": null, "pointwise_regularizer": null, "activation": "linear", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [7, 7], "use_bias": false, "strides": [1, 1], "depthwise_regularizer": null, "padding": "same", "data_format": "channels_last", "depth_multiplier": 1, "bias_constraint": null}}, {"name": "separable_conv_2_bn_reduction_left1_stem_1", "class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv_2_reduction_left1_stem_1", 0, 0, {}]]], "config": {"name": "separable_conv_2_bn_reduction_left1_stem_1", "gamma_constraint": null, "scale": true, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9997, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "separable_conv_2_bn_reduction_right1_stem_1", "class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv_2_reduction_right1_stem_1", 0, 0, {}]]], "config": {"name": "separable_conv_2_bn_reduction_right1_stem_1", "gamma_constraint": null, "scale": true, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9997, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "activation_6", "class_name": "Activation", "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"name": "reduction_add_1_stem_1", "class_name": "Add", "inbound_nodes": [[["separable_conv_2_bn_reduction_left1_stem_1", 0, 0, {}], ["separable_conv_2_bn_reduction_right1_stem_1", 0, 0, {}]]], "config": {"name": "reduction_add_1_stem_1", "trainable": true}}, {"name": "separable_conv_1_reduction_right2_stem_1", "class_name": "SeparableConv2D", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"name": "separable_conv_1_reduction_right2_stem_1", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "depthwise_constraint": null, "trainable": true, "filters": 42, "bias_regularizer": null, "dilation_rate": [1, 1], "pointwise_constraint": null, "pointwise_regularizer": null, "activation": "linear", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [7, 7], "use_bias": false, "strides": [2, 2], "depthwise_regularizer": null, "padding": "same", "data_format": "channels_last", "depth_multiplier": 1, "bias_constraint": null}}, {"name": "activation_8", "class_name": "Activation", "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "config": {"name": "activation_8", "activation": "relu", "trainable": true}}, {"name": "activation_10", "class_name": "Activation", "inbound_nodes": [[["reduction_add_1_stem_1", 0, 0, {}]]], "config": {"name": "activation_10", "activation": "relu", "trainable": true}}, {"name": "separable_conv_1_bn_reduction_right2_stem_1", "class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv_1_reduction_right2_stem_1", 0, 0, {}]]], "config": {"name": "separable_conv_1_bn_reduction_right2_stem_1", "gamma_constraint": null, "scale": true, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9997, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "separable_conv_1_reduction_right3_stem_1", "class_name": "SeparableConv2D", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"name": "separable_conv_1_reduction_right3_stem_1", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "depthwise_constraint": null, "trainable": true, "filters": 42, "bias_regularizer": null, "dilation_rate": [1, 1], "pointwise_constraint": null, "pointwise_regularizer": null, "activation": "linear", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [5, 5], "use_bias": false, "strides": [2, 2], "depthwise_regularizer": null, "padding": "same", "data_format": "channels_last", "depth_multiplier": 1, "bias_constraint": null}}, {"name": "separable_conv_1_reduction_left4_stem_1", "class_name": "SeparableConv2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"name": "separable_conv_1_reduction_left4_stem_1", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "depthwise_constraint": null, "trainable": true, "filters": 42, "bias_regularizer": null, "dilation_rate": [1, 1], "pointwise_constraint": null, "pointwise_regularizer": null, "activation": "linear", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [3, 3], "use_bias": false, "strides": [1, 1], "depthwise_regularizer": null, "padding": "same", "data_format": "channels_last", "depth_multiplier": 1, "bias_constraint": null}}, {"name": "activation_7", "class_name": "Activation", "inbound_nodes": [[["separable_conv_1_bn_reduction_right2_stem_1", 0, 0, {}]]], "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"name": "separable_conv_1_bn_reduction_right3_stem_1", "class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv_1_reduction_right3_stem_1", 0, 0, {}]]], "config": {"name": "separable_conv_1_bn_reduction_right3_stem_1", "gamma_constraint": null, "scale": true, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9997, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "separable_conv_1_bn_reduction_left4_stem_1", "class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv_1_reduction_left4_stem_1", 0, 0, {}]]], "config": {"name": "separable_conv_1_bn_reduction_left4_stem_1", "gamma_constraint": null, "scale": true, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9997, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "separable_conv_2_reduction_right2_stem_1", "class_name": "SeparableConv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"name": 