{"keras_version": "2.0.5", "params": {"block5_conv1": 2359808, "block3_conv4": 590080, "block1_conv1": 1792, "input_1": 0, "flatten": 0, "block4_conv3": 2359808, "block1_pool": 0, "block3_conv3": 590080, "block4_conv2": 2359808, "block5_conv4": 2359808, "block5_pool": 0, "fc1": 102764544, "block2_conv1": 73856, "block4_conv4": 2359808, "block2_conv2": 147584, "block4_conv1": 1180160, "block5_conv2": 2359808, "fc2": 16781312, "block3_conv2": 590080, "block3_conv1": 295168, "block1_conv2": 36928, "block5_conv3": 2359808, "block2_pool": 0, "predictions": 4097000, "block4_pool": 0, "block3_pool": 0}, "config": {"name": "vgg19", "input_layers": [["input_1", 0, 0]], "output_layers": [["predictions", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "config": {"sparse": false, "dtype": "float32", "name": "input_1", "batch_input_shape": [null, 224, 224, 3]}, "class_name": "InputLayer"}, {"name": "block1_conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"name": "block1_conv1", "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 64, "trainable": true, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"name": "block1_conv2", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "config": {"name": "block1_conv2", "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 64, "trainable": true, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"name": "block1_pool", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "config": {"pool_size": [2, 2], "padding": "valid", "name": "block1_pool", "strides": [2, 2], "data_format": "channels_last", "trainable": true}, "class_name": "MaxPooling2D"}, {"name": "block2_conv1", "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "config": {"name": "block2_conv1", "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 128, "trainable": true, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"name": "block2_conv2", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "config": {"name": "block2_conv2", "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 128, "trainable": true, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"name": "block2_pool", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "config": {"pool_size": [2, 2], "padding": "valid", "name": "block2_pool", "strides": [2, 2], "data_format": "channels_last", "trainable": true}, "class_name": "MaxPooling2D"}, {"name": "block3_conv1", "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "config": {"name": "block3_conv1", "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 256, "trainable": true, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"name": "block3_conv2", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "config": {"name": "block3_conv2", "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 256, "trainable": true, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"name": "block3_conv3", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "config": {"name": "block3_conv3", "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 256, "trainable": true, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"name": "block3_conv4", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "config": {"name": "block3_conv4", "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 256, "trainable": true, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"name": "block3_pool", "inbound_nodes": [[["block3_conv4", 0, 0, {}]]], "config": {"pool_size": [2, 2], "padding": "valid", "name": "block3_pool", "strides": [2, 2], "data_format": "channels_last", "trainable": true}, "class_name": "MaxPooling2D"}, {"name": "block4_conv1", "inbound_nodes": [[["block3_pool", 0, 0, {}]]], "config": {"name": "block4_conv1", "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 512, "trainable": true, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"name": "block4_conv2", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "config": {"name": "block4_conv2", "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 512, "trainable": true, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"name": "block4_conv3", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "config": {"name": "block4_conv3", "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 512, "trainable": true, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"name": "block4_conv4", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "config": {"name": "block4_conv4", "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 512, "trainable": true, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"name": "block4_pool", "inbound_nodes": [[["block4_conv4", 0, 0, {}]]], "config": {"pool_size": [2, 2], "padding": "valid", "name": "block4_pool", "strides": [2, 2], "data_format": "channels_last", "trainable": true}, "class_name": "MaxPooling2D"}, {"name": "block5_conv1", "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "config": {"name": "block5_conv1", "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 512, "trainable": true, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"name": "block5_conv2", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "config": {"name": "block5_conv2", "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 512, "trainable": true, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"name": "block5_conv3", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "config": {"name": "block5_conv3", "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 512, "trainable": true, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"name": "block5_conv4", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "config": {"name": "block5_conv4", "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 512, "trainable": true, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"name": "block5_pool", "inbound_nodes": [[["block5_conv4", 0, 0, {}]]], "config": {"pool_size": [2, 2], "padding": "valid", "name": "block5_pool", "strides": [2, 2], "data_format": "channels_last", "trainable": true}, "class_name": "MaxPooling2D"}, {"name": "flatten", "inbound_nodes": [[["block5_pool", 0, 0, {}]]], "config": {"name": "flatten", "trainable": true}, "class_name": "Flatten"}, {"name": "fc1", "inbound_nodes": [[["flatten", 0, 0, {}]]], "config": {"kernel_regularizer": null, "name": "fc1", "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "units": 4096, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"name": "fc2", "inbound_nodes": [[["fc1", 0, 0, {}]]], "config": {"kernel_regularizer": null, "name": "fc2", "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "units": 4096, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"name": "predictions", "inbound_nodes": [[["fc2", 0, 0, {}]]], "config": {"kernel_regularizer": null, "name": "predictions", "kernel_constraint": null, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "units": 1000, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}]}, "class_name": "Model", "backend": "tensorflow"}