{"params": {"dropout_1": 0, "dropout_8": 0, "conv2d_1": 432, "add_5": 0, "activation_24": 0, "activation_4": 0, "activation_20": 0, "conv2d_9": 230400, "batch_normalization_20": 2560, "batch_normalization_22": 2560, "activation_13": 0, "activation_6": 0, "conv2d_20": 1843200, "conv2d_10": 230400, "conv2d_23": 3686400, "batch_normalization_25": 2560, "conv2d_15": 921600, "add_6": 0, "batch_normalization_23": 2560, "activation_3": 0, "conv2d_28": 3686400, "input_1": 0, "dropout_10": 0, "batch_normalization_15": 1280, "batch_normalization_16": 1280, "conv2d_7": 230400, "conv2d_21": 3686400, "conv2d_16": 921600, "conv2d_25": 3686400, "conv2d_6": 230400, "batch_normalization_7": 640, "batch_normalization_4": 640, "activation_14": 0, "conv2d_11": 460800, "activation_18": 0, "dropout_7": 0, "conv2d_14": 921600, "activation_15": 0, "activation_2": 0, "add_3": 0, "add_12": 0, "add_11": 0, "activation_23": 0, "batch_normalization_6": 640, "flatten_1": 0, "dropout_9": 0, "activation_19": 0, "add_8": 0, "average_pooling2d_1": 0, "batch_normalization_10": 1280, "conv2d_18": 921600, "activation_5": 0, "batch_normalization_5": 640, "conv2d_22": 204800, "dropout_5": 0, "batch_normalization_13": 1280, "activation_8": 0, "dropout_2": 0, "activation_9": 0, "batch_normalization_18": 2560, "dropout_6": 0, "batch_normalization_21": 2560, "activation_17": 0, "conv2d_19": 921600, "batch_normalization_11": 1280, "dropout_4": 0, "activation_22": 0, "conv2d_26": 3686400, "dropout_3": 0, "conv2d_13": 51200, "batch_normalization_3": 640, "dropout_11": 0, "add_4": 0, "activation_10": 0, "dropout_12": 0, "activation_16": 0, "batch_normalization_9": 640, "conv2d_5": 230400, "activation_25": 0, "conv2d_4": 2560, "conv2d_3": 230400, "batch_normalization_1": 64, "conv2d_24": 3686400, "activation_11": 0, "conv2d_8": 230400, "conv2d_2": 23040, "add_1": 0, "conv2d_27": 3686400, "batch_normalization_12": 1280, "batch_normalization_2": 640, "batch_normalization_19": 2560, "activation_21": 0, "batch_normalization_8": 640, "batch_normalization_17": 1280, "add_7": 0, "activation_1": 0, "batch_normalization_24": 2560, "add_9": 0, "add_2": 0, "batch_normalization_14": 1280, "activation_12": 0, "add_10": 0, "conv2d_12": 921600, "activation_7": 0, "dense_1": 409600, "conv2d_17": 921600}, "keras_version": "2.2.2", "backend": "tensorflow", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"sparse": false, "name": "input_1", "batch_input_shape": [null, 32, 32, 3], "dtype": "float32"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "filters": 16, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "name": "conv2d_1", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "trainable": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv2d_2", "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "filters": 160, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "name": "conv2d_2", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "trainable": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "dropout_1", "class_name": "Dropout", "config": {"rate": 0.3, "noise_shape": null, "name": "dropout_1", "seed": null, "trainable": true}}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "conv2d_3", "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "filters": 160, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "name": "conv2d_3", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null}}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv2d_4", "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "filters": 160, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "name": "conv2d_4", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}], ["conv2d_4", 0, 0, {}]]], "name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true}}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "trainable": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "conv2d_5", "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "filters": 160, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "name": "conv2d_5", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "trainable": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "dropout_2", "class_name": "Dropout", "config": {"rate": 0.3, "noise_shape": null, "name": "dropout_2", "seed": null, "trainable": true}}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "conv2d_6", "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "filters": 160, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "name": "conv2d_6", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}], ["add_1", 0, 0, {}]]], "name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true}}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "trainable": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "conv2d_7", "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "filters": 160, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "name": "conv2d_7", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "trainable": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "dropout_3", "class_name": "Dropout", "config": {"rate": 0.3, "noise_shape": null, "name": "dropout_3", "seed": null, "trainable": true}}, {"inbound_nodes": [[["dropout_3", 0, 0, {}]]], "name": "conv2d_8", "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "filters": 160, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "name": "conv2d_8", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}], ["add_2", 0, 0, {}]]], "name": "add_3", "class_name": "Add", "config": {"name": "add_3", "trainable": true}}, {"inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "trainable": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "name": "activation_7", "class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "conv2d_9", "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "filters": 160, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "name": "conv2d_9", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "trainable": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "name": "activation_8", "class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["activation_8", 0, 0, {}]]], "name": "dropout_4", "class_name": "Dropout", "config": {"rate": 0.3, "noise_shape": null, "name": "dropout_4", "seed": null, "trainable": true}}, {"inbound_nodes": [[["dropout_4", 0, 0, {}]]], "name": "conv2d_10", "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "filters": 160, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "name": "conv2d_10", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}], ["add_3", 0, 0, {}]]], "name": "add_4", "class_name": "Add", "config": {"name": "add_4", "trainable": true}}, {"inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_9", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "trainable": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "name": "activation_9", "class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "conv2d_11", "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "filters": 320, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [2, 2], "name": "conv2d_11", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_10", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "trainable": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "name": "activation_10", "class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "dropout_5", "class_name": "Dropout", "config": {"rate": 0.3, "noise_shape": null, "name": "dropout_5", "seed": null, "trainable": true}}, {"inbound_nodes": [[["dropout_5", 0, 0, {}]]], "name": "conv2d_12", "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "filters": 320, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "name": "conv2d_12", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null}}, {"inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "conv2d_13", "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "filters": 320, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [2, 2], "name": "conv2d_13", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}], ["conv2d_13", 0, 0, {}]]], "name": "add_5", "class_name": "Add", "config": {"name": "add_5", "trainable": true}}, {"inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_11", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "trainable": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "name": "activation_11", "class_name": "Activation", "config": {"name": "activation_11", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["activation_11", 0, 0, {}]]], "name": "conv2d_14", "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "filters": 320, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "name": "conv2d_14", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_12", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "trainable": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "name": "activation_12", "class_name": "Activation", "config": {"name": "activation_12", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["activation_12", 0, 0, {}]]], "name": "dropout_6", "class_name": "Dropout", "config": {"rate": 0.3, "noise_shape": null, "name": "dropout_6", "seed": null, "trainable": true}}, {"inbound_nodes": [[["dropout_6", 0, 0, {}]]], "name": "conv2d_15", "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "filters": 320, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "name": "conv2d_15", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}], ["add_5", 0, 0, {}]]], "name": "add_6", "class_name": "Add", "config": {"name": "add_6", "trainable": true}}, {"inbound_nodes": [[["add_6", 0, 0, {}]]], "name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_13", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "trainable": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "name": "activation_13", "class_name": "Activation", "config": {"name": "activation_13", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["activation_13", 0, 0, {}]]], "name": "conv2d_16", "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "filters": 320, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "name": "conv2d_16", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "batch_normalization_14", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_14", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "trainable": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "name": "activation_14", "class_name": "Activation", "config": {"name": "activation_14", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["activation_14", 0, 0, {}]]], "name": "dropout_7", "class_name": "Dropout", "config": {"rate": 0.3, "noise_shape": null, "name": "dropout_7", "seed": null, "trainable": true}}, {"inbound_nodes": [[["dropout_7", 0, 0, {}]]], "name": "conv2d_17", "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "filters": 320, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "name": "conv2d_17", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_17", 0, 0, {}], ["add_6", 0, 0, {}]]], "name": "add_7", "class_name": "Add", "config": {"name": "add_7", "trainable": true}}, {"inbound_nodes": [[["add_7", 0, 0, {}]]], "name": "batch_normalization_15", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_15", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "trainable": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "name": "activation_15", "class_name": "Activation", "config": {"name": "activation_15", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["activation_15", 0, 0, {}]]], "name": "conv2d_18", "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "filters": 320, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "name": "conv2d_18", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "name": "batch_normalization_16", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_16", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "trainable": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "name": "activation_16", "class_name": "Activation", "config": {"name": "activation_16", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["activation_16", 0, 0, {}]]], "name": "dropout_8", "class_name": "Dropout", "config": {"rate": 0.3, "noise_shape": null, "name": "dropout_8", "seed": null, "trainable": true}}, {"inbound_nodes": [[["dropout_8", 0, 0, {}]]], "name": "conv2d_19", "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "filters": 320, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "name": "conv2d_19", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_19", 0, 0, {}], ["add_7", 0, 0, {}]]], "name": "add_8", "class_name": "Add", "config": {"name": "add_8", "trainable": true}}, {"inbound_nodes": [[["add_8", 0, 0, {}]]], "name": "batch_normalization_17", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_17", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "trainable": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "name": "activation_17", "class_name": "Activation", "config": {"name": "activation_17", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["activation_17", 0, 0, {}]]], "name": "conv2d_20", "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "filters": 640, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [2, 2], "name": "conv2d_20", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "name": "batch_normalization_18", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_18", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "trainable": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "name": "activation_18", "class_name": "Activation", "config": {"name": "activation_18", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["activation_18", 0, 0, {}]]], "name": "dropout_9", "class_name": "Dropout", "config": {"rate": 0.3, "noise_shape": null, "name": "dropout_9", "seed": null, "trainable": true}}, {"inbound_nodes": [[["dropout_9", 0, 0, {}]]], "name": "conv2d_21", "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "filters": 640, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "name": "conv2d_21", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null}}, {"inbound_nodes": [[["activation_17", 0, 0, {}]]], "name": "conv2d_22", "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "filters": 640, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [2, 2], "name": "conv2d_22", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_21", 0, 0, {}], ["conv2d_22", 0, 0, {}]]], "name": "add_9", "class_name": "Add", "config": {"name": "add_9", "trainable": true}}, {"inbound_nodes": [[["add_9", 0, 0, {}]]], "name": "batch_normalization_19", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_19", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "trainable": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "name": "activation_19", "class_name": "Activation", "config": {"name": "activation_19", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["activation_19", 0, 0, {}]]], "name": "conv2d_23", "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "filters": 640, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "name": "conv2d_23", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "name": "batch_normalization_20", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_20", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "trainable": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "name": "activation_20", "class_name": "Activation", "config": {"name": "activation_20", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["activation_20", 0, 0, {}]]], "name": "dropout_10", "class_name": "Dropout", "config": {"rate": 0.3, "noise_shape": null, "name": "dropout_10", "seed": null, "trainable": true}}, {"inbound_nodes": [[["dropout_10", 0, 0, {}]]], "name": "conv2d_24", "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "filters": 640, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "name": "conv2d_24", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_24", 0, 0, {}], ["add_9", 0, 0, {}]]], "name": "add_10", "class_name": "Add", "config": {"name": "add_10", "trainable": true}}, {"inbound_nodes": [[["add_10", 0, 0, {}]]], "name": "batch_normalization_21", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_21", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "trainable": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "name": "activation_21", "class_name": "Activation", "config": {"name": "activation_21", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["activation_21", 0, 0, {}]]], "name": "conv2d_25", "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "filters": 640, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "name": "conv2d_25", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "name": "batch_normalization_22", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_22", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "trainable": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "name": "activation_22", "class_name": "Activation", "config": {"name": "activation_22", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["activation_22", 0, 0, {}]]], "name": "dropout_11", "class_name": "Dropout", "config": {"rate": 0.3, "noise_shape": null, "name": "dropout_11", "seed": null, "trainable": true}}, {"inbound_nodes": [[["dropout_11", 0, 0, {}]]], "name": "conv2d_26", "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "filters": 640, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "name": "conv2d_26", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_26", 0, 0, {}], ["add_10", 0, 0, {}]]], "name": "add_11", "class_name": "Add", "config": {"name": "add_11", "trainable": true}}, {"inbound_nodes": [[["add_11", 0, 0, {}]]], "name": "batch_normalization_23", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_23", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "trainable": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "name": "activation_23", "class_name": "Activation", "config": {"name": "activation_23", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["activation_23", 0, 0, {}]]], "name": "conv2d_27", "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "filters": 640, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "name": "conv2d_27", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "name": "batch_normalization_24", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_24", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "trainable": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "name": "activation_24", "class_name": "Activation", "config": {"name": "activation_24", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["activation_24", 0, 0, {}]]], "name": "dropout_12", "class_name": "Dropout", "config": {"rate": 0.3, "noise_shape": null, "name": "dropout_12", "seed": null, "trainable": true}}, {"inbound_nodes": [[["dropout_12", 0, 0, {}]]], "name": "conv2d_28", "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "filters": 640, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "name": "conv2d_28", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_28", 0, 0, {}], ["add_11", 0, 0, {}]]], "name": "add_12", "class_name": "Add", "config": {"name": "add_12", "trainable": true}}, {"inbound_nodes": [[["add_12", 0, 0, {}]]], "name": "batch_normalization_25", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_25", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "trainable": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "name": "activation_25", "class_name": "Activation", "config": {"name": "activation_25", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["activation_25", 0, 0, {}]]], "name": "average_pooling2d_1", "class_name": "AveragePooling2D", "config": {"padding": "same", "trainable": true, "data_format": "channels_last", "strides": [1, 1], "name": "average_pooling2d_1", "pool_size": [8, 8]}}, {"inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "name": "flatten_1", "class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense", "config": {"use_bias": false, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "units": 10, "activation": "softmax", "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "name": "model_1"}, "class_name": "Model"}