{"class_name": "Model", "config": {"output_layers": [["predictions", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 299, 299, 3], "dtype": "float32", "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "strides": [2, 2], "filters": 32, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "padding": "valid", "name": "block1_conv1", "activity_regularizer": null, "trainable": true, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "block1_conv1"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "name": "block1_conv1_bn", "beta_regularizer": null}, "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "name": "block1_conv1_bn"}, {"class_name": "Activation", "config": {"trainable": true, "name": "block1_conv1_act", "activation": "relu"}, "inbound_nodes": [[["block1_conv1_bn", 0, 0, {}]]], "name": "block1_conv1_act"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "strides": [1, 1], "filters": 64, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "padding": "valid", "name": "block1_conv2", "activity_regularizer": null, "trainable": true, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block1_conv1_act", 0, 0, {}]]], "name": "block1_conv2"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "name": "block1_conv2_bn", "beta_regularizer": null}, "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "name": "block1_conv2_bn"}, {"class_name": "Activation", "config": {"trainable": true, "name": "block1_conv2_act", "activation": "relu"}, "inbound_nodes": [[["block1_conv2_bn", 0, 0, {}]]], "name": "block1_conv2_act"}, {"class_name": "SeparableConv2D", "config": {"depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "linear", "pointwise_constraint": null, "strides": [1, 1], "filters": 128, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "depthwise_constraint": null, "use_bias": false, "pointwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "trainable": true, "depth_multiplier": 1, "name": "block2_sepconv1", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]], "name": "block2_sepconv1"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "name": "block2_sepconv1_bn", "beta_regularizer": null}, "inbound_nodes": [[["block2_sepconv1", 0, 0, {}]]], "name": "block2_sepconv1_bn"}, {"class_name": "Activation", "config": {"trainable": true, "name": "block2_sepconv2_act", "activation": "relu"}, "inbound_nodes": [[["block2_sepconv1_bn", 0, 0, {}]]], "name": "block2_sepconv2_act"}, {"class_name": "SeparableConv2D", "config": {"depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "linear", "pointwise_constraint": null, "strides": [1, 1], "filters": 128, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "depthwise_constraint": null, "use_bias": false, "pointwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "trainable": true, "depth_multiplier": 1, "name": "block2_sepconv2", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block2_sepconv2_act", 0, 0, {}]]], "name": "block2_sepconv2"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "name": "block2_sepconv2_bn", "beta_regularizer": null}, "inbound_nodes": [[["block2_sepconv2", 0, 0, {}]]], "name": "block2_sepconv2_bn"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "strides": [2, 2], "filters": 128, "kernel_size": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "name": "conv2d_1", "activity_regularizer": null, "trainable": true, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]], "name": "conv2d_1"}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [3, 3], "name": "block2_pool"}, "inbound_nodes": [[["block2_sepconv2_bn", 0, 0, {}]]], "name": "block2_pool"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "name": "batch_normalization_1", "beta_regularizer": null}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_1"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_1"}, "inbound_nodes": [[["block2_pool", 0, 0, {}], ["batch_normalization_1", 0, 0, {}]]], "name": "add_1"}, {"class_name": "Activation", "config": {"trainable": true, "name": "block3_sepconv1_act", "activation": "relu"}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "block3_sepconv1_act"}, {"class_name": "SeparableConv2D", "config": {"depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "linear", "pointwise_constraint": null, "strides": [1, 1], "filters": 256, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "depthwise_constraint": null, "use_bias": false, "pointwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "trainable": true, "depth_multiplier": 1, "name": "block3_sepconv1", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block3_sepconv1_act", 0, 0, {}]]], "name": "block3_sepconv1"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "name": "block3_sepconv1_bn", "beta_regularizer": null}, "inbound_nodes": [[["block3_sepconv1", 0, 0, {}]]], "name": "block3_sepconv1_bn"}, {"class_name": "Activation", "config": {"trainable": true, "name": "block3_sepconv2_act", "activation": "relu"}, "inbound_nodes": [[["block3_sepconv1_bn", 0, 0, {}]]], "name": "block3_sepconv2_act"}, {"class_name": "SeparableConv2D", "config": {"depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "linear", "pointwise_constraint": null, "strides": [1, 1], "filters": 256, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "depthwise_constraint": null, "use_bias": false, "pointwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "trainable": true, "depth_multiplier": 1, "name": "block3_sepconv2", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block3_sepconv2_act", 0, 0, {}]]], "name": "block3_sepconv2"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "name": "block3_sepconv2_bn", "beta_regularizer": null}, "inbound_nodes": [[["block3_sepconv2", 0, 0, {}]]], "name": "block3_sepconv2_bn"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "strides": [2, 2], "filters": 256, "kernel_size": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "name": "conv2d_2", "activity_regularizer": null, "trainable": true, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "conv2d_2"}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [3, 3], "name": "block3_pool"}, "inbound_nodes": [[["block3_sepconv2_bn", 0, 0, {}]]], "name": "block3_pool"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "name": "batch_normalization_2", "beta_regularizer": null}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_2"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_2"}, "inbound_nodes": [[["block3_pool", 0, 0, {}], ["batch_normalization_2", 0, 0, {}]]], "name": "add_2"}, {"class_name": "Activation", "config": {"trainable": true, "name": "block4_sepconv1_act", "activation": "relu"}, "inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "block4_sepconv1_act"}, {"class_name": "SeparableConv2D", "config": {"depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "linear", "pointwise_constraint": null, "strides": [1, 1], "filters": 728, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "depthwise_constraint": null, "use_bias": false, "pointwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "trainable": true, "depth_multiplier": 1, "name": "block4_sepconv1", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block4_sepconv1_act", 0, 0, {}]]], "name": "block4_sepconv1"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "name": "block4_sepconv1_bn", "beta_regularizer": null}, "inbound_nodes": [[["block4_sepconv1", 0, 0, {}]]], "name": "block4_sepconv1_bn"}, {"class_name": "Activation", "config": {"trainable": true, "name": "block4_sepconv2_act", "activation": "relu"}, "inbound_nodes": [[["block4_sepconv1_bn", 0, 0, {}]]], "name": "block4_sepconv2_act"}, {"class_name": "SeparableConv2D", "config": {"depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "linear", "pointwise_constraint": null, "strides": [1, 1], "filters": 728, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "depthwise_constraint": null, "use_bias": false, "pointwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "trainable": true, "depth_multiplier": 1, "name": "block4_sepconv2", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block4_sepconv2_act", 0, 0, {}]]], "name": "block4_sepconv2"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "name": "block4_sepconv2_bn", "beta_regularizer": null}, "inbound_nodes": [[["block4_sepconv2", 0, 0, {}]]], "name": "block4_sepconv2_bn"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "strides": [2, 2], "filters": 728, "kernel_size": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "name": "conv2d_3", "activity_regularizer": null, "trainable": true, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "conv2d_3"}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [3, 3], "name": "block4_pool"}, "inbound_nodes": [[["block4_sepconv2_bn", 0, 0, {}]]], "name": "block4_pool"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "name": "batch_normalization_3", "beta_regularizer": null}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_3"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_3"}, "inbound_nodes": [[["block4_pool", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]], "name": "add_3"}, {"class_name": "Activation", "config": {"trainable": true, "name": "block5_sepconv1_act", "activation": "relu"}, "inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "block5_sepconv1_act"}, {"class_name": "SeparableConv2D", "config": {"depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "linear", "pointwise_constraint": null, "strides": [1, 1], "filters": 728, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "depthwise_constraint": null, "use_bias": false, "pointwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "trainable": true, "depth_multiplier": 1, "name": "block5_sepconv1", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block5_sepconv1_act", 0, 0, {}]]], "name": "block5_sepconv1"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "name": "block5_sepconv1_bn", "beta_regularizer": null}, "inbound_nodes": [[["block5_sepconv1", 0, 0, {}]]], "name": "block5_sepconv1_bn"}, {"class_name": "Activation", "config": {"trainable": true, "name": "block5_sepconv2_act", "activation": "relu"}, "inbound_nodes": [[["block5_sepconv1_bn", 0, 0, {}]]], "name": "block5_sepconv2_act"}, {"class_name": "SeparableConv2D", "config": {"depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "linear", "pointwise_constraint": null, "strides": [1, 1], "filters": 728, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "depthwise_constraint": null, "use_bias": false, "pointwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "trainable": true, "depth_multiplier": 1, "name": "block5_sepconv2", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block5_sepconv2_act", 0, 0, {}]]], "name": "block5_sepconv2"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "name": "block5_sepconv2_bn", "beta_regularizer": null}, "inbound_nodes": [[["block5_sepconv2", 0, 0, {}]]], "name": "block5_sepconv2_bn"}, {"class_name": "Activation", "config": {"trainable": true, "name": "block5_sepconv3_act", "activation": "relu"}, "inbound_nodes": [[["block5_sepconv2_bn", 0, 0, {}]]], "name": "block5_sepconv3_act"}, {"class_name": "SeparableConv2D", "config": {"depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "linear", "pointwise_constraint": null, "strides": [1, 1], "filters": 728, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "depthwise_constraint": null, "use_bias": false, "pointwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "trainable": true, "depth_multiplier": 1, "name": "block5_sepconv3", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block5_sepconv3_act", 0, 0, {}]]], "name": "block5_sepconv3"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "name": "block5_sepconv3_bn", "beta_regularizer": null}, "inbound_nodes": [[["block5_sepconv3", 0, 0, {}]]], "name": "block5_sepconv3_bn"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_4"}, "inbound_nodes": [[["block5_sepconv3_bn", 0, 0, {}], ["add_3", 0, 0, {}]]], "name": "add_4"}, {"class_name": "Activation", "config": {"trainable": true, "name": "block6_sepconv1_act", "activation": "relu"}, "inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "block6_sepconv1_act"}, {"class_name": "SeparableConv2D", "config": {"depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "linear", "pointwise_constraint": null, "strides": [1, 1], "filters": 728, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "depthwise_constraint": null, "use_bias": false, "pointwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "trainable": true, "depth_multiplier": 1, "name": "block6_sepconv1", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block6_sepconv1_act", 0, 0, {}]]], "name": "block6_sepconv1"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "name": "block6_sepconv1_bn", "beta_regularizer": null}, "inbound_nodes": [[["block6_sepconv1", 0, 0, {}]]], "name": "block6_sepconv1_bn"}, {"class_name": "Activation", "config": {"trainable": true, "name": "block6_sepconv2_act", "activation": "relu"}, "inbound_nodes": [[["block6_sepconv1_bn", 0, 0, {}]]], "name": "block6_sepconv2_act"}, {"class_name": "SeparableConv2D", "config": {"depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "linear", "pointwise_constraint": null, "strides": [1, 1], "filters": 728, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "depthwise_constraint": null, "use_bias": false, "pointwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "trainable": true, "depth_multiplier": 1, "name": "block6_sepconv2", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block6_sepconv2_act", 0, 0, {}]]], "name": "block6_sepconv2"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "name": "block6_sepconv2_bn", "beta_regularizer": null}, "inbound_nodes": [[["block6_sepconv2", 0, 0, {}]]], "name": "block6_sepconv2_bn"}, {"class_name": "Activation", "config": {"trainable": true, "name": "block6_sepconv3_act", "activation": "relu"}, "inbound_nodes": [[["block6_sepconv2_bn", 0, 0, {}]]], "name": "block6_sepconv3_act"}, {"class_name": "SeparableConv2D", "config": {"depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "linear", "pointwise_constraint": null, "strides": [1, 1], "filters": 728, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "depthwise_constraint": null, "use_bias": false, "pointwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "trainable": true, "depth_multiplier": 1, "name": "block6_sepconv3", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block6_sepconv3_act", 0, 0, {}]]], "name": "block6_sepconv3"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "name": "block6_sepconv3_bn", "beta_regularizer": null}, "inbound_nodes": [[["block6_sepconv3", 0, 0, {}]]], "name": "block6_sepconv3_bn"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_5"}, "inbound_nodes": [[["block6_sepconv3_bn", 0, 0, {}], ["add_4", 0, 0, {}]]], "name": "add_5"}, {"class_name": "Activation", "config": {"trainable": true, "name": "block7_sepconv1_act", "activation": "relu"}, "inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "block7_sepconv1_act"}, {"class_name": "SeparableConv2D", "config": {"depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "linear", "pointwise_constraint": null, "strides": [1, 1], "filters": 728, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "depthwise_constraint": null, "use_bias": false, "pointwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "trainable": true, "depth_multiplier": 1, "name": "block7_sepconv1", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block7_sepconv1_act", 0, 0, {}]]], "name": "block7_sepconv1"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "name": "block7_sepconv1_bn", "beta_regularizer": null}, "inbound_nodes": [[["block7_sepconv1", 0, 0, {}]]], "name": "block7_sepconv1_bn"}, {"class_name": "Activation", "config": {"trainable": true, "name": "block7_sepconv2_act", "activation": "relu"}, "inbound_nodes": [[["block7_sepconv1_bn", 0, 0, {}]]], "name": "block7_sepconv2_act"}, {"class_name": "SeparableConv2D", "config": {"depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "linear", "pointwise_constraint": null, "strides": [1, 1], "filters": 728, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "depthwise_constraint": null, "use_bias": false, "pointwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "trainable": true, "depth_multiplier": 1, "name": "block7_sepconv2", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block7_sepconv2_act", 0, 0, {}]]], "name": "block7_sepconv2"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "name": "block7_sepconv2_bn", "beta_regularizer": null}, "inbound_nodes": [[["block7_sepconv2", 0, 0, {}]]], "name": "block7_sepconv2_bn"}, {"class_name": "Activation", "config": {"trainable": true, "name": "block7_sepconv3_act", "activation": "relu"}, "inbound_nodes": [[["block7_sepconv2_bn", 0, 0, {}]]], "name": "block7_sepconv3_act"}, {"class_name": "SeparableConv2D", "config": {"depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "linear", "pointwise_constraint": null, "strides": [1, 1], "filters": 728, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "depthwise_constraint": null, "use_bias": false, "pointwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "trainable": true, "depth_multiplier": 1, "name": "block7_sepconv3", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block7_sepconv3_act", 0, 0, {}]]], "name": "block7_sepconv3"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "name": "block7_sepconv3_bn", "beta_regularizer": null}, "inbound_nodes": [[["block7_sepconv3", 0, 0, {}]]], "name": "block7_sepconv3_bn"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_6"}, "inbound_nodes": [[["block7_sepconv3_bn", 0, 0, {}], ["add_5", 0, 0, {}]]], "name": "add_6"}, {"class_name": "Activation", "config": {"trainable": true, "name": "block8_sepconv1_act", "activation": "relu"}, "inbound_nodes": [[["add_6", 0, 0, {}]]], "name": "block8_sepconv1_act"}, {"class_name": "SeparableConv2D", "config": {"depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "linear", "pointwise_constraint": null, "strides": [1, 1], "filters": 728, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "depthwise_constraint": null, "use_bias": false, "pointwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "trainable": true, "depth_multiplier": 1, "name": "block8_sepconv1", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block8_sepconv1_act", 0, 0, {}]]], "name": "block8_sepconv1"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "name": "block8_sepconv1_bn", "beta_regularizer": null}, "inbound_nodes": [[["block8_sepconv1", 0, 0, {}]]], "name": "block8_sepconv1_bn"}, {"class_name": "Activation", "config": {"trainable": true, "name": "block8_sepconv2_act", "activation": "relu"}, "inbound_nodes": [[["block8_sepconv1_bn", 0, 0, {}]]], "name": "block8_sepconv2_act"}, {"class_name": "SeparableConv2D", "config": {"depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "linear", "pointwise_constraint": null, "strides": [1, 1], "filters": 728, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "depthwise_constraint": null, "use_bias": false, "pointwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "trainable": true, "depth_multiplier": 1, "name": "block8_sepconv2", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block8_sepconv2_act", 0, 0, {}]]], "name": "block8_sepconv2"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "name": "block8_sepconv2_bn", "beta_regularizer": null}, "inbound_nodes": [[["block8_sepconv2", 0, 0, {}]]], "name": "block8_sepconv2_bn"}, {"class_name": "Activation", "config": {"trainable": true, "name": "block8_sepconv3_act", "activation": "relu"}, "inbound_nodes": [[["block8_sepconv2_bn", 0, 0, {}]]], "name": "block8_sepconv3_act"}, {"class_name": "SeparableConv2D", "config": {"depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "linear", "pointwise_constraint": null, "strides": [1, 1], "filters": 728, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "depthwise_constraint": null, "use_bias": false, "pointwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "trainable": true, "depth_multiplier": 1, "name": "block8_sepconv3", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block8_sepconv3_act", 0, 0, {}]]], "name": "block8_sepconv3"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "name": "block8_sepconv3_bn", "beta_regularizer": null}, "inbound_nodes": [[["block8_sepconv3", 0, 0, {}]]], "name": "block8_sepconv3_bn"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_7"}, "inbound_nodes": [[["block8_sepconv3_bn", 0, 0, {}], ["add_6", 0, 0, {}]]], "name": "add_7"}, {"class_name": "Activation", "config": {"trainable": true, "name": "block9_sepconv1_act", "activation": "relu"}, "inbound_nodes": [[["add_7", 0, 0, {}]]], "name": "block9_sepconv1_act"}, {"class_name": "SeparableConv2D", "config": {"depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "linear", "pointwise_constraint": null, "strides": [1, 1], "filters": 728, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "depthwise_constraint": null, "use_bias": false, "pointwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "trainable": true, "depth_multiplier": 1, "name": "block9_sepconv1", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block9_sepconv1_act", 0, 0, {}]]], "name": "block9_sepconv1"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "name": "block9_sepconv1_bn", "beta_regularizer": null}, "inbound_nodes": [[["block9_sepconv1", 0, 0, {}]]], "name": "block9_sepconv1_bn"}, {"class_name": "Activation", "config": {"trainable": true, "name": "block9_sepconv2_act", "activation": "relu"}, "inbound_nodes": [[["block9_sepconv1_bn", 0, 0, {}]]], "name": "block9_sepconv2_act"}, {"class_name": "SeparableConv2D", "config": {"depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "linear", "pointwise_constraint": null, "strides": [1, 1], "filters": 728, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "depthwise_constraint": null, "use_bias": false, "pointwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "trainable": true, "depth_multiplier": 1, "name": "block9_sepconv2", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block9_sepconv2_act", 0, 0, {}]]], "name": "block9_sepconv2"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "name": "block9_sepconv2_bn", "beta_regularizer": null}, "inbound_nodes": [[["block9_sepconv2", 0, 0, {}]]], "name": "block9_sepconv2_bn"}, {"class_name": "Activation", "config": {"trainable": true, "name": "block9_sepconv3_act", "activation": "relu"}, "inbound_nodes": [[["block9_sepconv2_bn", 0, 0, {}]]], "name": "block9_sepconv3_act"}, {"class_name": "SeparableConv2D", "config": {"depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "linear", "pointwise_constraint": null, "strides": [1, 1], "filters": 728, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "depthwise_constraint": null, "use_bias": false, "pointwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "trainable": true, "depth_multiplier": 1, "name": "block9_sepconv3", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block9_sepconv3_act", 0, 0, {}]]], "name": "block9_sepconv3"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "name": "block9_sepconv3_bn", "beta_regularizer": null}, "inbound_nodes": [[["block9_sepconv3", 0, 0, {}]]], "name": "block9_sepconv3_bn"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_8"}, "inbound_nodes": [[["block9_sepconv3_bn", 0, 0, {}], ["add_7", 0, 0, {}]]], "name": "add_8"}, {"class_name": "Activation", "config": {"trainable": true, "name": "block10_sepconv1_act", "activation": "relu"}, "inbound_nodes": [[["add_8", 0, 0, {}]]], "name": "block10_sepconv1_act"}, {"class_name": "SeparableConv2D", "config": {"depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "linear", "pointwise_constraint": null, "strides": [1, 1], "filters": 728, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "depthwise_constraint": null, "use_bias": false, "pointwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "trainable": true, "depth_multiplier": 1, "name": "block10_sepconv1", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block10_sepconv1_act", 0, 0, {}]]], "name": "block10_sepconv1"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "name": "block10_sepconv1_bn", "beta_regularizer": null}, "inbound_nodes": [[["block10_sepconv1", 0, 0, {}]]], "name": "block10_sepconv1_bn"}, {"class_name": "Activation", "config": {"trainable": true, "name": "block10_sepconv2_act", "activation": "relu"}, "inbound_nodes": [[["block10_sepconv1_bn", 0, 0, {}]]], "name": "block10_sepconv2_act"}, {"class_name": "SeparableConv2D", "config": {"depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "linear", "pointwise_constraint": null, "strides": [1, 1], "filters": 728, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "depthwise_constraint": null, "use_bias": false, "pointwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "trainable": true, "depth_multiplier": 1, "name": "block10_sepconv2", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block10_sepconv2_act", 0, 0, {}]]], "name": "block10_sepconv2"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "name": "block10_sepconv2_bn", "beta_regularizer": null}, "inbound_nodes": [[["block10_sepconv2", 0, 0, {}]]], "name": "block10_sepconv2_bn"}, {"class_name": "Activation", "config": {"trainable": true, "name": "block10_sepconv3_act", "activation": "relu"}, "inbound_nodes": [[["block10_sepconv2_bn", 0, 0, {}]]], "name": "block10_sepconv3_act"}, {"class_name": "SeparableConv2D", "config": {"depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "linear", "pointwise_constraint": null, "strides": [1, 1], "filters": 728, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "depthwise_constraint": null, "use_bias": false, "pointwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "trainable": true, 