{
    "class_name": "Model",
    "config": {
        "name": "model_1",
        "layers": [
            {
                "name": "input_1",
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        224,
                        224,
                        3
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "name": "input_1"
                },
                "inbound_nodes": []
            },
            {
                "name": "conv2d_1",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_1",
                    "trainable": true,
                    "filters": 96,
                    "kernel_size": [
                        11,
                        11
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 0.0
                        }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "input_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_1",
                "class_name": "Activation",
                "config": {
                    "name": "activation_1",
                    "trainable": true,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_2",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_2",
                    "trainable": true,
                    "filters": 256,
                    "kernel_size": [
                        5,
                        5
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_2",
                "class_name": "Activation",
                "config": {
                    "name": "activation_2",
                    "trainable": true,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "max_pooling2d_2",
                "class_name": "MaxPooling2D",
                "config": {
                    "name": "max_pooling2d_2",
                    "trainable": true,
                    "pool_size": [
                        2,
                        2
                    ],
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "data_format": "channels_last"
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "zero_padding2d_1",
                "class_name": "ZeroPadding2D",
                "config": {
                    "name": "zero_padding2d_1",
                    "trainable": true,
                    "padding": [
                        [
                            1,
                            1
                        ],
                        [
                            1,
                            1
                        ]
                    ],
                    "data_format": "channels_last"
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_3",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_3",
                    "trainable": true,
                    "filters": 512,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_3",
                "class_name": "Activation",
                "config": {
                    "name": "activation_3",
                    "trainable": true,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "max_pooling2d_3",
                "class_name": "MaxPooling2D",
                "config": {
                    "name": "max_pooling2d_3",
                    "trainable": true,
                    "pool_size": [
                        2,
                        2
                    ],
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "data_format": "channels_last"
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "zero_padding2d_2",
                "class_name": "ZeroPadding2D",
                "config": {
                    "name": "zero_padding2d_2",
                    "trainable": true,
                    "padding": [
                        [
                            1,
                            1
                        ],
                        [
                            1,
                            1
                        ]
                    ],
                    "data_format": "channels_last"
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_4",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_4",
                    "trainable": true,
                    "filters": 1024,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_4",
                "class_name": "Activation",
                "config": {
                    "name": "activation_4",
                    "trainable": true,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "zero_padding2d_3",
                "class_name": "ZeroPadding2D",
                "config": {
                    "name": "zero_padding2d_3",
                    "trainable": true,
                    "padding": [
                        [
                            1,
                            1
                        ],
                        [
                            1,
                            1
                        ]
                    ],
                    "data_format": "channels_last"
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_5",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_5",
                    "trainable": true,
                    "filters": 1024,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_5",
                "class_name": "Activation",
                "config": {
                    "name": "activation_5",
                    "trainable": true,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "max_pooling2d_4",
                "class_name": "MaxPooling2D",
                "config": {
                    "name": "max_pooling2d_4",
                    "trainable": true,
                    "pool_size": [
                        2,
                        2
                    ],
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "data_format": "channels_last"
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "flatten_1",
                "class_name": "Flatten",
                "config": {
                    "name": "flatten_1",
                    "trainable": true,
                    "data_format": "channels_last"
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "dense_1",
                "class_name": "Dense",
                "config": {
                    "name": "dense_1",
                    "trainable": true,
                    "units": 3072,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "flatten_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_6",
                "class_name": "Activation",
                "config": {
                    "name": "activation_6",
                    "trainable": true,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "dropout_1",
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_1",
                    "trainable": true,
                    "rate": 0.5,
                    "noise_shape": null,
                    "seed": null
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_6",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "dense_2",
                "class_name": "Dense",
                "config": {
                    "name": "dense_2",
                    "trainable": true,
                    "units": 4096,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "dropout_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_7",
                "class_name": "Activation",
                "config": {
                    "name": "activation_7",
                    "trainable": true,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "dropout_2",
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_2",
                    "trainable": true,
                    "rate": 0.5,
                    "noise_shape": null,
                    "seed": null
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_7",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "dense_3",
                "class_name": "Dense",
                "config": {
                    "name": "dense_3",
                    "trainable": true,
                    "units": 1000,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "dropout_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_8",
                "class_name": "Activation",
                "config": {
                    "name": "activation_8",
                    "trainable": true,
                    "activation": "softmax"
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            }
        ],
        "input_layers": [
            [
                "input_1",
                0,
                0
            ]
        ],
        "output_layers": [
            [
                "activation_8",
                0,
                0
            ]
        ]
    },
    "keras_version": "2.2.2",
    "backend": "tensorflow",
    "params": {
        "input_1": 0,
        "conv2d_1": 34944,
        "activation_1": 0,
        "conv2d_2": 614656,
        "activation_2": 0,
        "max_pooling2d_2": 0,
        "zero_padding2d_1": 0,
        "conv2d_3": 1180160,
        "activation_3": 0,
        "max_pooling2d_3": 0,
        "zero_padding2d_2": 0,
        "conv2d_4": 4719616,
        "activation_4": 0,
        "zero_padding2d_3": 0,
        "conv2d_5": 9438208,
        "activation_5": 0,
        "max_pooling2d_4": 0,
        "flatten_1": 0,
        "dense_1": 2831158272,
        "activation_6": 0,
        "dropout_1": 0,
        "dense_2": 12587008,
        "activation_7": 0,
        "dropout_2": 0,
        "dense_3": 4097000,
        "activation_8": 0
    }
}