{"config": [{"config": {"batch_input_shape": [null, 224, 224, 3], "kernel_size": [11, 11], "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0}, "class_name": "L1L2"}, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "name": "conv2d_1", "filters": 96, "use_bias": true, "bias_regularizer": null, "trainable": true, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"beta_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "batch_normalization_1", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"trainable": true, "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [5, 5], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "filters": 256, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "padding": "same", "name": "conv2d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"beta_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "batch_normalization_2", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"trainable": true, "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_1", "padding": [[1, 1], [1, 1]]}, "class_name": "ZeroPadding2D"}, {"config": {"kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "filters": 512, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "padding": "same", "name": "conv2d_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"beta_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "batch_normalization_3", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"trainable": true, "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_3", "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_2", "padding": [[1, 1], [1, 1]]}, "class_name": "ZeroPadding2D"}, {"config": {"kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "filters": 1024, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "padding": "same", "name": "conv2d_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"beta_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "batch_normalization_4", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_3", "padding": [[1, 1], [1, 1]]}, "class_name": "ZeroPadding2D"}, {"config": {"kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "filters": 1024, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "padding": "same", "name": "conv2d_5", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"beta_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "batch_normalization_5", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "class_name": "Activation"}, {"config": {"trainable": true, "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_4", "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "units": 3072, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "name": "dense_1", "use_bias": true, "bias_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"beta_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "batch_normalization_6", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "class_name": "Activation"}, {"config": {"noise_shape": null, "trainable": true, "rate": 0.5, "seed": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "units": 4096, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "name": "dense_2", "use_bias": true, "bias_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"beta_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "batch_normalization_7", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_7"}, "class_name": "Activation"}, {"config": {"noise_shape": null, "trainable": true, "rate": 0.5, "seed": null, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "units": 1000, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "name": "dense_3", "use_bias": true, "bias_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"beta_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "batch_normalization_8", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_8"}, "class_name": "Activation"}], "backend": "tensorflow", "params": {"zero_padding2d_3": 0, "activation_3": 0, "batch_normalization_1": 384, "dropout_1": 0, "dropout_2": 0, "dense_3": 4097000, "activation_2": 0, "max_pooling2d_4": 0, "dense_2": 12587008, "activation_1": 0, "conv2d_1": 34944, "conv2d_4": 4719616, "batch_normalization_7": 16384, "conv2d_3": 1180160, "activation_4": 0, "batch_normalization_8": 4000, "flatten_1": 0, "max_pooling2d_1": 0, "activation_7": 0, "activation_8": 0, "batch_normalization_5": 4096, "conv2d_2": 614656, "max_pooling2d_2": 0, "batch_normalization_4": 4096, "zero_padding2d_2": 0, "dense_1": 805309440, "batch_normalization_3": 2048, "batch_normalization_2": 1024, "activation_5": 0, "batch_normalization_6": 12288, "zero_padding2d_1": 0, "activation_6": 0, "max_pooling2d_3": 0, "conv2d_5": 9438208}, "class_name": "Sequential", "keras_version": "2.2.2"}