{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "conv1-1", "class_name": "Conv2D", "config": {"name": "conv1-1", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "batchnorm1-1", "class_name": "BatchNormalization", "config": {"name": "batchnorm1-1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1-1", 0, 0, {}]]]}, {"name": "relu1-1", "class_name": "Activation", "config": {"name": "relu1-1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnorm1-1", 0, 0, {}]]]}, {"name": "conv1-2", "class_name": "Conv2D", "config": {"name": "conv1-2", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu1-1", 0, 0, {}]]]}, {"name": "batchnorm1-2", "class_name": "BatchNormalization", "config": {"name": "batchnorm1-2", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1-2", 0, 0, {}]]]}, {"name": "relu1-2", "class_name": "Activation", "config": {"name": "relu1-2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnorm1-2", 0, 0, {}]]]}, {"name": "max_pooling_with_argmax2d_6", "class_name": "MaxPoolingWithArgmax2D", "config": {"name": "max_pooling_with_argmax2d_6", "trainable": true}, "inbound_nodes": [[["relu1-2", 0, 0, {}]]]}, {"name": "conv2-1", "class_name": "Conv2D", "config": {"name": "conv2-1", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling_with_argmax2d_6", 0, 0, {}]]]}, {"name": "batchnorm2-1", "class_name": "BatchNormalization", "config": {"name": "batchnorm2-1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2-1", 0, 0, {}]]]}, {"name": "relu2-1", "class_name": "Activation", "config": {"name": "relu2-1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnorm2-1", 0, 0, {}]]]}, {"name": "conv2-2", "class_name": "Conv2D", "config": {"name": "conv2-2", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu2-1", 0, 0, {}]]]}, {"name": "batchnorm2-2", "class_name": "BatchNormalization", "config": {"name": "batchnorm2-2", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2-2", 0, 0, {}]]]}, {"name": "relu2-2", "class_name": "Activation", "config": {"name": "relu2-2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnorm2-2", 0, 0, {}]]]}, {"name": "max_pooling_with_argmax2d_7", "class_name": "MaxPoolingWithArgmax2D", "config": {"name": "max_pooling_with_argmax2d_7", "trainable": true}, "inbound_nodes": [[["relu2-2", 0, 0, {}]]]}, {"name": "conv3-1", "class_name": "Conv2D", "config": {"name": "conv3-1", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling_with_argmax2d_7", 0, 0, {}]]]}, {"name": "batchnorm3-1", "class_name": "BatchNormalization", "config": {"name": "batchnorm3-1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3-1", 0, 0, {}]]]}, {"name": "relu3-1", "class_name": "Activation", "config": {"name": "relu3-1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnorm3-1", 0, 0, {}]]]}, {"name": "conv3-2", "class_name": "Conv2D", "config": {"name": "conv3-2", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu3-1", 0, 0, {}]]]}, {"name": "batchnorm3-2", "class_name": "BatchNormalization", "config": {"name": "batchnorm3-2", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3-2", 0, 0, {}]]]}, {"name": "relu3-2", "class_name": "Activation", "config": {"name": "relu3-2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnorm3-2", 0, 0, {}]]]}, {"name": "conv3-3", "class_name": "Conv2D", "config": {"name": "conv3-3", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu3-2", 0, 0, {}]]]}, {"name": "batchnorm3-3", "class_name": "BatchNormalization", "config": {"name": "batchnorm3-3", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3-3", 0, 0, {}]]]}, {"name": "relu3-3", "class_name": "Activation", "config": {"name": "relu3-3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnorm3-3", 0, 0, {}]]]}, {"name": "max_pooling_with_argmax2d_8", "class_name": "MaxPoolingWithArgmax2D", "config": {"name": "max_pooling_with_argmax2d_8", "trainable": true}, "inbound_nodes": [[["relu3-3", 0, 0, {}]]]}, {"name": "conv4-1", "class_name": "Conv2D", "config": {"name": "conv4-1", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling_with_argmax2d_8", 0, 0, {}]]]}, {"name": "batchnorm4-1", "class_name": "BatchNormalization", "config": {"name": "batchnorm4-1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv4-1", 0, 0, {}]]]}, {"name": "relu4-1", "class_name": "Activation", "config": {"name": "relu4-1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnorm4-1", 0, 0, {}]]]}, {"name": "conv4-2", "class_name": "Conv2D", "config": {"name": "conv4-2", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu4-1", 0, 0, {}]]]}, {"name": "batchnorm4-2", "class_name": "BatchNormalization", "config": {"name": "batchnorm4-2", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv4-2", 0, 0, {}]]]}, {"name": "relu4-2", "class_name": "Activation", "config": {"name": "relu4-2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnorm4-2", 0, 0, {}]]]}, {"name": "conv4-3", "class_name": "Conv2D", "config": {"name": "conv4-3", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu4-2", 0, 0, {}]]]}, {"name": "batchnorm4-3", "class_name": "BatchNormalization", "config": {"name": "batchnorm4-3", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv4-3", 0, 0, {}]]]}, {"name": "relu4-3", "class_name": "Activation", "config": {"name": "relu4-3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnorm4-3", 0, 0, {}]]]}, {"name": "max_pooling_with_argmax2d_9", "class_name": "MaxPoolingWithArgmax2D", "config": {"name": "max_pooling_with_argmax2d_9", "trainable": true}, "inbound_nodes": [[["relu4-3", 0, 0, {}]]]}, {"name": "conv5-1", "class_name": "Conv2D", "config": {"name": "conv5-1", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling_with_argmax2d_9", 0, 0, {}]]]}, {"name": "batchnorm5-1", "class_name": "BatchNormalization", "config": {"name": "batchnorm5-1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv5-1", 0, 0, {}]]]}, {"name": "relu5-1", "class_name": "Activation", "config": {"name": "relu5-1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnorm5-1", 0, 0, {}]]]}, {"name": "conv5-2", "class_name": "Conv2D", "config": {"name": "conv5-2", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu5-1", 0, 0, {}]]]}, {"name": "batchnorm5-2", "class_name": "BatchNormalization", "config": {"name": "batchnorm5-2", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv5-2", 0, 0, {}]]]}, {"name": "relu5-2", "class_name": "Activation", "config": {"name": "relu5-2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnorm5-2", 0, 0, {}]]]}, {"name": "conv5-3", "class_name": "Conv2D", "config": {"name": "conv5-3", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu5-2", 0, 0, {}]]]}, {"name": "batchnorm5-3", "class_name": "BatchNormalization", "config": {"name": "batchnorm5-3", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv5-3", 0, 0, {}]]]}, {"name": "relu5-3", "class_name": "Activation", "config": {"name": "relu5-3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnorm5-3", 0, 0, {}]]]}, {"name": "max_pooling_with_argmax2d_10", "class_name": "MaxPoolingWithArgmax2D", "config": {"name": "max_pooling_with_argmax2d_10", "trainable": true}, "inbound_nodes": [[["relu5-3", 0, 0, {}]]]}, {"name": "fc6", "class_name": "Conv2D", "config": {"name": "fc6", "trainable": true, "filters": 512, "kernel_size": [7, 7], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling_with_argmax2d_10", 0, 0, {}]]]}, {"name": "batchnorm_fc6", "class_name": "BatchNormalization", "config": {"name": "batchnorm_fc6", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["fc6", 0, 0, {}]]]}, {"name": "relu_fc6", "class_name": "Activation", "config": {"name": "relu_fc6", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnorm_fc6", 0, 0, {}]]]}, {"name": "fc7", "class_name": "Conv2D", "config": {"name": "fc7", "trainable": true, "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu_fc6", 0, 0, {}]]]}, {"name": "batchnorm_fc7", "class_name": "BatchNormalization", "config": {"name": "batchnorm_fc7", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["fc7", 0, 0, {}]]]}, {"name": "relu_fc7", "class_name": "Activation", "config": {"name": "relu_fc7", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnorm_fc7", 0, 0, {}]]]}, {"name": "deconv-fc6", "class_name": "Conv2DTranspose", "config": {"name": "deconv-fc6", "trainable": true, "filters": 512, "kernel_size": [7, 7], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["relu_fc7", 0, 0, {}]]]}, {"name": "batchnorm_deconv-fc6", "class_name": "BatchNormalization", "config": {"name": "batchnorm_deconv-fc6", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["deconv-fc6", 0, 0, {}]]]}, {"name": "relu_deconv-fc6", "class_name": "Activation", "config": {"name": "relu_deconv-fc6", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnorm_deconv-fc6", 0, 0, {}]]]}, {"name": "unpool5", "class_name": "MaxUnpooling2D", "config": {"name": "unpool5", "trainable": true}, "inbound_nodes": [[["relu_deconv-fc6", 0, 0, {}], ["max_pooling_with_argmax2d_9", 0, 1, {}]]]}, {"name": "deconv5-1", "class_name": "Conv2DTranspose", "config": {"name": "deconv5-1", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["unpool5", 0, 0, {}]]]}, {"name": "batchnorm_deconv5-1", "class_name": "BatchNormalization", "config": {"name": "batchnorm_deconv5-1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["deconv5-1", 0, 0, {}]]]}, {"name": "relu_deconv5-1", "class_name": "Activation", "config": {"name": "relu_deconv5-1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnorm_deconv5-1", 0, 0, {}]]]}, {"name": "deconv5-2", "class_name": "Conv2DTranspose", "config": {"name": "deconv5-2", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["relu_deconv5-1", 0, 0, {}]]]}, {"name": "batchnorm_deconv5-2", "class_name": "BatchNormalization", "config": {"name": "batchnorm_deconv5-2", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["deconv5-2", 0, 0, {}]]]}, {"name": "relu_deconv5-2", "class_name": "Activation", "config": {"name": "relu_deconv5-2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnorm_deconv5-2", 0, 0, {}]]]}, {"name": "deconv5-3", "class_name": "Conv2DTranspose", "config": {"name": "deconv5-3", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["relu_deconv5-2", 0, 0, {}]]]}, {"name": "batchnorm_deconv5-3", "class_name": "BatchNormalization", "config": {"name": "batchnorm_deconv5-3", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["deconv5-3", 0, 0, {}]]]}, {"name": "relu_deconv5-3", "class_name": "Activation", "config": {"name": "relu_deconv5-3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnorm_deconv5-3", 0, 0, {}]]]}, {"name": "unpool4", "class_name": "MaxUnpooling2D", "config": {"name": "unpool4", "trainable": true}, "inbound_nodes": [[["relu_deconv5-3", 0, 0, {}], ["max_pooling_with_argmax2d_9", 0, 1, {}]]]}, {"name": "deconv4-1", "class_name": "Conv2DTranspose", "config": {"name": "deconv4-1", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["unpool4", 0, 0, {}]]]}, {"name": "batchnorm_deconv4-1", "class_name": "BatchNormalization", "config": {"name": "batchnorm_deconv4-1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["deconv4-1", 0, 0, {}]]]}, {"name": "relu_deconv4-1", "class_name": "Activation", "config": {"name": "relu_deconv4-1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnorm_deconv4-1", 0, 0, {}]]]}, {"name": "deconv4-2", "class_name": "Conv2DTranspose", "config": {"name": "deconv4-2", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["relu_deconv4-1", 0, 0, {}]]]}, {"name": "batchnorm_deconv4-2", "class_name": "BatchNormalization", "config": {"name": "batchnorm_deconv4-2", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["deconv4-2", 0, 0, {}]]]}, {"name": "relu_deconv4-2", "class_name": "Activation", "config": {"name": "relu_deconv4-2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnorm_deconv4-2", 0, 0, {}]]]}, {"name": "deconv4-3", "class_name": "Conv2DTranspose", "config": {"name": "deconv4-3", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["relu_deconv4-2", 0, 0, {}]]]}, {"name": "batchnorm_deconv4-3", "class_name": "BatchNormalization", "config": {"name": "batchnorm_deconv4-3", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["deconv4-3", 0, 0, {}]]]}, {"name": "relu_deconv4-3", "class_name": "Activation", "config": {"name": "relu_deconv4-3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnorm_deconv4-3", 0, 0, {}]]]}, {"name": "unpool3", "class_name": "MaxUnpooling2D", "config": {"name": "unpool3", "trainable": true}, "inbound_nodes": [[["relu_deconv4-3", 0, 0, {}], ["max_pooling_with_argmax2d_8", 0, 1, {}]]]}, {"name": "deconv3-1", "class_name": "Conv2DTranspose", "config": {"name": "deconv3-1", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["unpool3", 0, 0, {}]]]}, {"name": "batchnorm_deconv3-1", "class_name": "BatchNormalization", "config": {"name": "batchnorm_deconv3-1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["deconv3-1", 0, 0, {}]]]}, {"name": "relu_deconv3-1", "class_name": "Activation", "config": {"name": "relu_deconv3-1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnorm_deconv3-1", 0, 0, {}]]]}, {"name": "deconv3-2", "class_name": "Conv2DTranspose", "config": {"name": "deconv3-2", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["relu_deconv3-1", 0, 0, {}]]]}, {"name": "batchnorm_deconv3-2", "class_name": "BatchNormalization", "config": {"name": "batchnorm_deconv3-2", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["deconv3-2", 0, 0, {}]]]}, {"name": "relu_deconv3-2", "class_name": "Activation", "config": {"name": "relu_deconv3-2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnorm_deconv3-2", 0, 0, {}]]]}, {"name": "deconv3-3", "class_name": "Conv2DTranspose", "config": {"name": "deconv3-3", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["relu_deconv3-2", 0, 0, {}]]]}, {"name": "batchnorm_deconv3-3", "class_name": "BatchNormalization", "config": {"name": "batchnorm_deconv3-3", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["deconv3-3", 0, 0, {}]]]}, {"name": "relu_deconv3-3", "class_name": "Activation", "config": {"name": "relu_deconv3-3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnorm_deconv3-3", 0, 0, {}]]]}, {"name": "unpool2", "class_name": "MaxUnpooling2D", "config": {"name": "unpool2", "trainable": true}, "inbound_nodes": [[["relu_deconv3-3", 0, 0, {}], ["max_pooling_with_argmax2d_7", 0, 1, {}]]]}, {"name": "deconv2-1", "class_name": "Conv2DTranspose", "config": {"name": "deconv2-1", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["unpool2", 0, 0, {}]]]}, {"name": "batchnorm_deconv2-1", "class_name": "BatchNormalization", "config": {"name": "batchnorm_deconv2-1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["deconv2-1", 0, 0, {}]]]}, {"name": "relu_deconv2-1", "class_name": "Activation", "config": {"name": "relu_deconv2-1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnorm_deconv2-1", 0, 0, {}]]]}, {"name": "deconv2-2", "class_name": "Conv2DTranspose", "config": {"name": "deconv2-2", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["relu_deconv2-1", 0, 0, {}]]]}, {"name": "batchnorm_deconv2-2", "class_name": "BatchNormalization", "config": {"name": "batchnorm_deconv2-2", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["deconv2-2", 0, 0, {}]]]}, {"name": "relu_deconv2-2", "class_name": "Activation", "config": {"name": "relu_deconv2-2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnorm_deconv2-2", 0, 0, {}]]]}, {"name": "unpool1", "class_name": "MaxUnpooling2D", "config": {"name": "unpool1", "trainable": true}, "inbound_nodes": [[["relu_deconv2-2", 0, 0, {}], ["max_pooling_with_argmax2d_6", 0, 1, {}]]]}, {"name": "deconv1-1", "class_name": "Conv2DTranspose", "config": {"name": "deconv1-1", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["unpool1", 0, 0, {}]]]}, {"name": "batchnorm_deconv1-1", "class_name": "BatchNormalization", "config": {"name": "batchnorm_deconv1-1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["deconv1-1", 0, 0, {}]]]}, {"name": "relu_deconv1-1", "class_name": "Activation", "config": {"name": "relu_deconv1-1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnorm_deconv1-1", 0, 0, {}]]]}, {"name": "deconv1-2", "class_name": "Conv2DTranspose", "config": {"name": "deconv1-2", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["relu_deconv1-1", 0, 0, {}]]]}, {"name": "batchnorm_deconv1-2", "class_name": "BatchNormalization", "config": {"name": "batchnorm_deconv1-2", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["deconv1-2", 0, 0, {}]]]}, {"name": "relu_deconv1-2", "class_name": "Activation", "config": {"name": "relu_deconv1-2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnorm_deconv1-2", 0, 0, {}]]]}, {"name": "output", "class_name": "Conv2DTranspose", "config": {"name": "output", "trainable": true, "filters": 21, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["relu_deconv1-2", 0, 0, {}]]]}], "input_layers": [["input_2", 0, 0]], "output_layers": [["output", 0, 0]]}, "keras_version": "2.2.2", "backend": "tensorflow", "params": {"input_2": 0, "conv1-1": 1728, "batchnorm1-1": 256, "relu1-1": 0, "conv1-2": 36864, "batchnorm1-2": 256, "relu1-2": 0, "max_pooling_with_argmax2d_6": 0, "conv2-1": 73728, "batchnorm2-1": 512, "relu2-1": 0, "conv2-2": 147456, "batchnorm2-2": 512, "relu2-2": 0, "max_pooling_with_argmax2d_7": 0, "conv3-1": 294912, "batchnorm3-1": 1024, "relu3-1": 0, "conv3-2": 589824, "batchnorm3-2": 1024, "relu3-2": 0, "conv3-3": 589824, "batchnorm3-3": 1024, "relu3-3": 0, "max_pooling_with_argmax2d_8": 0, "conv4-1": 1179648, "batchnorm4-1": 2048, "relu4-1": 0, "conv4-2": 2359296, "batchnorm4-2": 2048, "relu4-2": 0, "conv4-3": 2359296, "batchnorm4-3": 2048, "relu4-3": 0, "max_pooling_with_argmax2d_9": 0, "conv5-1": 2359296, "batchnorm5-1": 2048, "relu5-1": 0, "conv5-2": 2359296, "batchnorm5-2": 2048, "relu5-2": 0, "conv5-3": 2359296, "batchnorm5-3": 2048, "relu5-3": 0, "max_pooling_with_argmax2d_10": 0, "fc6": 12845056, "batchnorm_fc6": 2048, "relu_fc6": 0, "fc7": 262144, "batchnorm_fc7": 2048, "relu_fc7": 0, "deconv-fc6": 12845056, "batchnorm_deconv-fc6": 2048, "relu_deconv-fc6": 0, "unpool5": 0, "deconv5-1": 2359296, "batchnorm_deconv5-1": 2048, "relu_deconv5-1": 0, "deconv5-2": 2359296, "batchnorm_deconv5-2": 2048, "relu_deconv5-2": 0, "deconv5-3": 2359296, "batchnorm_deconv5-3": 2048, "relu_deconv5-3": 0, "unpool4": 0, "deconv4-1": 2359296, "batchnorm_deconv4-1": 2048, "relu_deconv4-1": 0, "deconv4-2": 2359296, "batchnorm_deconv4-2": 2048, "relu_deconv4-2": 0, "deconv4-3": 1179648, "batchnorm_deconv4-3": 1024, "relu_deconv4-3": 0, "unpool3": 0, "deconv3-1": 589824, "batchnorm_deconv3-1": 1024, "relu_deconv3-1": 0, "deconv3-2": 589824, "batchnorm_deconv3-2": 1024, "relu_deconv3-2": 0, "deconv3-3": 294912, "batchnorm_deconv3-3": 512, "relu_deconv3-3": 0, "unpool2": 0, "deconv2-1": 147456, "batchnorm_deconv2-1": 512, "relu_deconv2-1": 0, "deconv2-2": 73728, "batchnorm_deconv2-2": 256, "relu_deconv2-2": 0, "unpool1": 0, "deconv1-1": 36864, "batchnorm_deconv1-1": 256, "relu_deconv1-1": 0, "deconv1-2": 36864, "batchnorm_deconv1-2": 256, "relu_deconv1-2": 0, "output": 1365}}