{"class_name": "Model", "params": {"conv3_block1_2_conv": 36864, "conv4_block7_0_bn": 1792, "conv3_block2_1_relu": 0, "conv4_block5_concat": 0, "conv5_block11_1_relu": 0, "conv3_block9_0_bn": 1536, "conv5_block9_0_relu": 0, "conv3_block3_1_relu": 0, "conv3_block1_0_bn": 512, "conv2_block4_1_bn": 512, "conv4_block19_concat": 0, "conv3_block4_1_conv": 28672, "conv5_block7_concat": 0, "conv4_block5_0_bn": 1536, "conv4_block6_1_relu": 0, "conv4_block17_1_bn": 512, "conv5_block15_0_bn": 3840, "conv4_block24_concat": 0, "conv5_block2_1_relu": 0, "conv2_block3_1_conv": 16384, "conv5_block3_1_conv": 73728, "conv5_block15_2_conv": 36864, "conv4_block4_concat": 0, "conv4_block5_1_bn": 512, "conv3_block2_concat": 0, "conv4_block12_0_bn": 2432, "conv3_block3_1_bn": 512, "conv4_block1_0_bn": 1024, "conv4_block3_1_relu": 0, "conv5_block11_2_conv": 36864, "conv4_block4_1_bn": 512, "conv5_block7_1_relu": 0, "conv4_block4_0_relu": 0, "conv3_block9_1_conv": 49152, "conv4_block17_1_relu": 0, "conv4_block6_1_bn": 512, "conv5_block13_1_bn": 512, "conv4_block23_1_bn": 512, "conv4_block1_1_conv": 32768, "pool1": 0, "conv3_block7_concat": 0, "zero_padding2d_2": 0, "conv1/conv": 9408, "conv3_block11_2_conv": 36864, "conv3_block4_concat": 0, "conv4_block21_1_conv": 114688, "conv4_block7_2_conv": 36864, "conv4_block18_concat": 0, "conv4_block4_1_conv": 45056, "conv5_block16_concat": 0, "conv3_block8_concat": 0, "conv3_block11_1_bn": 512, "conv4_block24_0_bn": 3968, "conv4_block18_1_conv": 102400, "conv3_block3_concat": 0, "conv5_block14_concat": 0, "conv4_block22_concat": 0, "conv5_block6_2_conv": 36864, "conv4_block19_1_relu": 0, "conv5_block14_1_conv": 118784, "conv2_block5_2_conv": 36864, "conv5_block14_0_bn": 3712, "conv3_block7_1_conv": 40960, "conv3_block1_1_conv": 16384, "conv5_block13_1_conv": 114688, "conv3_block5_concat": 0, "conv2_block1_2_conv": 36864, "conv5_block5_1_bn": 512, "conv4_block7_0_relu": 0, "conv4_block10_concat": 0, "conv5_block9_1_relu": 0, "conv5_block9_1_bn": 512, "conv4_block8_1_bn": 512, "pool3_conv": 131072, "conv3_block11_1_relu": 0, "conv4_block12_1_conv": 77824, "conv4_block11_2_conv": 36864, "bn": 4096, "conv2_block5_0_bn": 768, "conv3_block8_2_conv": 36864, "conv4_block11_0_relu": 0, "conv5_block12_1_conv": 110592, "pool3_pool": 0, "conv4_block16_concat": 0, "conv3_block6_0_bn": 1152, "conv5_block10_1_conv": 102400, "conv4_block12_1_relu": 0, "conv3_block12_0_bn": 1920, "conv3_block10_1_bn": 512, "conv4_block5_1_relu": 0, "conv2_block6_1_bn": 512, "conv2_block4_0_relu": 0, "conv4_block9_1_conv": 65536, "conv5_block7_1_bn": 512, "conv3_block10_concat": 0, "conv4_block6_1_conv": 53248, "conv3_block2_0_bn": 640, "conv4_block6_0_relu": 0, "conv4_block1_1_bn": 512, "conv4_block21_1_relu": 0, "conv3_block11_0_relu": 0, "conv4_block7_1_relu": 0, "conv4_block10_0_relu": 0, "conv2_block5_1_relu": 0, "conv5_block1_1_conv": 65536, "conv5_block8_1_conv": 94208, "conv4_block16_0_bn": 2944, "conv4_block12_1_bn": 512, "conv5_block12_concat": 0, "conv2_block4_1_relu": 0, "conv5_block7_0_relu": 0, "conv3_block12_concat": 0, "pool3_relu": 0, "conv2_block1_1_relu": 0, "conv3_block12_1_bn": 512, "conv4_block16_2_conv": 36864, "conv5_block15_0_relu": 0, "conv4_block2_2_conv": 36864, "conv4_block6_2_conv": 36864, "conv4_block2_0_relu": 0, "conv5_block14_1_bn": 512, "conv4_block3_0_bn": 1280, "conv4_block23_1_conv": 122880, "conv4_block22_2_conv": 36864, "conv5_block15_1_bn": 512, "conv3_block12_1_conv": 61440, "conv4_block14_1_bn": 512, "conv5_block3_0_relu": 0, "conv3_block5_0_bn": 1024, "conv4_block17_0_relu": 0, "conv5_block3_2_conv": 36864, "conv4_block12_concat": 0, "conv4_block7_1_bn": 512, "conv4_block19_0_bn": 3328, "conv2_block1_0_bn": 256, "conv3_block11_1_conv": 57344, "conv3_block11_concat": 0, "conv4_block21_0_bn": 3584, "conv2_block1_1_conv": 8192, "conv5_block11_1_conv": 106496, "conv4_block16_1_conv": 94208, "conv5_block8_0_relu": 0, "conv4_block3_1_conv": 40960, "conv4_block13_0_bn": 2560, "conv5_block7_0_bn": 2816, "conv5_block8_2_conv": 36864, "conv5_block10_0_relu": 0, "conv2_block3_1_bn": 512, "conv4_block8_0_bn": 1920, "conv4_block8_0_relu": 0, "conv3_block10_0_bn": 1664, "conv3_block12_1_relu": 0, "conv4_block2_1_conv": 36864, "conv4_block3_1_bn": 512, "conv5_block1_1_bn": 512, "zero_padding2d_1": 0, "conv5_block2_0_bn": 2176, "conv4_block13_0_relu": 0, "conv4_block22_0_relu": 0, "conv2_block4_0_bn": 640, "conv3_block6_concat": 0, "conv3_block7_0_relu": 0, "conv3_block5_1_bn": 512, "pool2_conv": 32768, "conv5_block10_1_bn": 512, "conv3_block6_0_relu": 0, "conv4_block12_2_conv": 36864, "conv2_block2_concat": 0, "conv5_block4_0_bn": 2432, "conv2_block3_0_bn": 512, "conv4_block20_0_bn": 3456, "conv3_block4_1_relu": 0, "conv3_block6_1_conv": 36864, "conv5_block16_2_conv": 36864, "conv4_block14_1_conv": 86016, "conv2_block6_1_conv": 28672, "conv3_block9_1_bn": 512, "conv3_block1_1_relu": 0, "conv2_block6_1_relu": 0, "conv4_block24_1_conv": 126976, "conv2_block4_1_conv": 20480, "conv5_block2_1_conv": 69632, "conv5_block2_0_relu": 0, "conv5_block4_concat": 0, "conv3_block3_1_conv": 24576, "conv5_block10_0_bn": 3200, "conv2_block3_2_conv": 36864, "conv4_block15_2_conv": 36864, "conv4_block17_2_conv": 36864, "conv4_block20_0_relu": 0, "conv4_block5_0_relu": 0, "conv5_block13_0_bn": 3584, "conv2_block1_0_relu": 0, "conv3_block2_2_conv": 36864, "conv5_block5_2_conv": 36864, "conv3_block5_1_conv": 32768, "conv5_block15_concat": 0, "conv5_block16_1_bn": 512, "conv2_block1_1_bn": 512, "conv5_block6_concat": 0, "conv3_block3_0_relu": 0, "conv5_block1_0_relu": 0, "pool2_bn": 1024, "conv5_block4_2_conv": 36864, "conv4_block9_0_bn": 2048, "conv5_block9_0_bn": 3072, "conv4_block4_1_relu": 0, "conv4_block16_0_relu": 0, "conv4_block9_concat": 0, "conv4_block11_1_conv": 73728, "conv2_block2_0_bn": 384, "conv4_block15_1_relu": 0, "conv5_block11_concat": 0, "conv5_block12_2_conv": 36864, "conv4_block10_1_conv": 69632, "conv4_block1_concat": 0, "input_1": 0, "conv2_block3_concat": 0, "conv5_block8_0_bn": 2944, "conv5_block5_1_conv": 81920, "conv4_block8_1_relu": 0, "conv4_block20_1_conv": 110592, "conv4_block15_1_bn": 512, "conv2_block6_0_relu": 0, "conv5_block3_concat": 0, "conv4_block22_0_bn": 3712, "conv3_block9_0_relu": 0, "conv4_block21_concat": 0, "conv4_block19_2_conv": 36864, "conv5_block6_0_bn": 2688, "conv4_block11_concat": 0, "conv5_block5_1_relu": 0, "conv3_block5_0_relu": 0, "conv5_block13_1_relu": 0, "conv3_block1_concat": 0, "conv2_block2_2_conv": 36864, "conv4_block23_0_bn": 3840, "conv4_block1_1_relu": 0, "conv4_block3_2_conv": 36864, "conv3_block8_1_relu": 0, "conv2_block5_1_conv": 24576, "conv3_block6_1_relu": 0, "conv4_block23_1_relu": 0, "conv3_block4_1_bn": 512, "conv5_block13_0_relu": 0, "conv2_block2_1_conv": 12288, "conv4_block9_1_bn": 512, "conv4_block4_0_bn": 1408, "conv3_block8_1_conv": 45056, "pool3_bn": 2048, "conv4_block2_1_relu": 0, "conv5_block2_concat": 0, "conv3_block10_1_relu": 0, "conv4_block16_1_bn": 512, "conv2_block2_1_bn": 512, "conv5_block4_1_relu": 0, "conv4_block6_concat": 0, "conv3_block8_0_relu": 0, "conv2_block3_1_relu": 0, "conv4_block8_concat": 0, "conv3_block6_2_conv": 36864, "conv4_block3_0_relu": 0, "fc1000": 1025000, "conv5_block15_1_conv": 122880, "avg_pool": 0, "conv3_block2_0_relu": 0, "conv4_block19_0_relu": 0, "conv2_block4_concat": 0, "conv4_block9_2_conv": 36864, "conv3_block7_1_bn": 512, "conv4_block17_concat": 0, "conv2_block2_1_relu": 0, "conv5_block6_0_relu": 0, "conv5_block11_1_bn": 512, "conv4_block20_2_conv": 36864, "conv3_block3_2_conv": 36864, "conv3_block1_0_relu": 0, "conv4_block18_1_bn": 512, "conv4_block13_1_conv": 81920, "conv3_block9_2_conv": 36864, "conv4_block7_1_conv": 57344, "conv5_block6_1_bn": 512, "conv4_block2_concat": 0, "conv4_block19_1_bn": 512, "conv4_block9_1_relu": 0, "pool4_conv": 524288, "conv4_block24_1_bn": 512, "conv4_block14_0_bn": 2688, "conv4_block1_0_relu": 0, "conv4_block10_2_conv": 36864, "conv4_block18_0_bn": 3200, "conv5_block4_1_bn": 512, "conv5_block6_1_conv": 86016, "conv5_block7_2_conv": 36864, "conv4_block22_1_conv": 118784, "pool4_bn": 4096, "conv5_block10_1_relu": 0, "conv2_block6_2_conv": 36864, "conv3_block4_2_conv": 36864, "conv5_block9_1_conv": 98304, "conv3_block6_1_bn": 512, "conv2_block5_0_relu": 0, "conv2_block6_concat": 0, "conv5_block9_concat": 0, "conv4_block15_1_conv": 90112, "conv4_block5_2_conv": 36864, "conv5_block16_0_bn": 3968, "conv5_block16_0_relu": 0, "conv4_block21_0_relu": 0, "conv4_block18_2_conv": 36864, "conv4_block15_0_relu": 0, "conv3_block5_1_relu": 0, "conv5_block13_concat": 0, "conv3_block1_1_bn": 512, "conv2_block1_concat": 0, "pool2_pool": 0, "conv5_block8_1_bn": 512, "conv3_block3_0_bn": 768, "conv4_block2_1_bn": 512, "conv3_block12_2_conv": 36864, "conv4_block4_2_conv": 36864, "conv5_block6_1_relu": 0, "conv4_block11_1_bn": 512, "conv4_block15_0_bn": 2816, "conv5_block1_2_conv": 36864, "conv4_block20_concat": 0, "conv3_block7_0_bn": 1280, "conv5_block3_1_bn": 512, "conv5_block8_1_relu": 0, "conv1/relu": 0, "conv5_block9_2_conv": 36864, "conv4_block9_0_relu": 0, "conv3_block11_0_bn": 1792, "conv4_block23_2_conv": 36864, "conv5_block4_0_relu": 0, "conv5_block5_0_relu": 0, "conv2_block4_2_conv": 36864, "conv4_block2_0_bn": 1152, "conv4_block8_1_conv": 61440, "conv5_block15_1_relu": 0, "conv3_block8_1_bn": 512, "conv4_block18_1_relu": 0, "conv2_block5_concat": 0, "conv5_block8_concat": 0, "conv1/bn": 256, "conv4_block12_0_relu": 0, "conv4_block24_0_relu": 0, "conv4_block8_2_conv": 36864, "conv4_block17_1_conv": 98304, "conv4_block5_1_conv": 49152, "conv5_block10_2_conv": 36864, "conv5_block4_1_conv": 77824, "conv3_block2_1_conv": 20480, "conv4_block22_1_relu": 0, "conv4_block17_0_bn": 3072, "conv5_block12_1_bn": 512, "conv5_block11_0_relu": 0, "conv4_block24_2_conv": 36864, "conv3_block10_1_conv": 53248, "conv3_block7_1_relu": 0, "conv4_block23_concat": 0, "conv5_block14_1_relu": 0, "conv4_block10_0_bn": 2176, "conv4_block21_2_conv": 36864, "conv4_block15_concat": 0, "conv5_block12_0_bn": 3456, "conv5_block13_2_conv": 36864, "conv4_block20_1_relu": 0, "conv4_block3_concat": 0, "conv5_block12_1_relu": 0, "conv5_block16_1_relu": 0, "conv4_block11_0_bn": 2304, "conv3_block2_1_bn": 512, "conv3_block4_0_relu": 0, "conv2_block6_0_bn": 896, "conv5_block1_1_relu": 0, "conv5_block16_1_conv": 126976, "conv4_block19_1_conv": 106496, "conv4_block7_concat": 0, "conv3_block4_0_bn": 896, "conv5_block2_1_bn": 512, "conv5_block14_2_conv": 36864, "conv2_block3_0_relu": 0, "conv4_block10_1_relu": 0, "conv5_block10_concat": 0, "conv4_block14_2_conv": 36864, "conv5_block5_concat": 0, "conv3_block8_0_bn": 1408, "conv3_block7_2_conv": 36864, "conv4_block22_1_bn": 512, "conv3_block10_2_conv": 36864, "conv4_block1_2_conv": 36864, "conv3_block12_0_relu": 0, "conv3_block10_0_relu": 0, "conv4_block6_0_bn": 1664, "pool4_relu": 0, "conv4_block13_1_bn": 512, "pool2_relu": 0, "conv4_block23_0_relu": 0, "conv3_block9_1_relu": 0, "conv5_block7_1_conv": 90112, "conv5_block12_0_relu": 0, "conv4_block11_1_relu": 0, "conv4_block21_1_bn": 512, "conv5_block2_2_conv": 36864, "conv4_block24_1_relu": 0, "conv5_block3_0_bn": 2304, "conv4_block16_1_relu": 0, "conv5_block14_0_relu": 0, "conv4_block13_concat": 0, "conv4_block20_1_bn": 512, "pool4_pool": 0, "conv5_block3_1_relu": 0, "conv4_block14_concat": 0, "conv2_block5_1_bn": 512, "conv5_block1_0_bn": 2048, "conv4_block14_0_relu": 0, "conv4_block14_1_relu": 0, "conv4_block10_1_bn": 512, "conv4_block13_2_conv": 36864, "conv5_block5_0_bn": 2560, "conv3_block5_2_conv": 36864, "conv2_block2_0_relu": 0, "conv4_block13_1_relu": 0, "conv5_block11_0_bn": 3328, "conv3_block9_concat": 0, "conv5_block1_concat": 0, "conv4_block18_0_relu": 0}, "keras_version": "2.2.2", "config": {"name": "densenet121", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"name": "input_1", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 224, 224, 3]}, "inbound_nodes": []}, {"name": "zero_padding2d_1", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_1", "data_format": "channels_last", "padding": [[3, 3], [3, 3]], "trainable": true}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv1/conv", "class_name": "Conv2D", "config": {"name": "conv1/conv", "activity_regularizer": null, "kernel_size": [7, 7], "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "strides": [2, 2], "use_bias": false, "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last"}, "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]]}, {"name": "conv1/bn", "class_name": "BatchNormalization", "config": {"name": "conv1/bn", "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 1.001e-05, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true}, "inbound_nodes": [[["conv1/conv", 0, 0, {}]]]}, {"name": "conv1/relu", "class_name": "Activation", "config": {"name": "conv1/relu", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv1/bn", 0, 0, {}]]]}, {"name": "zero_padding2d_2", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_2", "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true}, "inbound_nodes": [[["conv1/relu", 0, 0, {}]]]}, {"name": "pool1", "class_name": "MaxPooling2D", "config": {"name": "pool1", "pool_size": [3, 3], "padding": "valid", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}, "inbound_nodes": [[["zero_padding2d_2", 0, 0, {}]]]}, {"name": "conv2_block1_0_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block1_0_bn", "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 1.001e-05, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true}, "inbound_nodes": [[["pool1", 0, 0, {}]]]}, {"name": "conv2_block1_0_relu", "class_name": "Activation", "config": {"name": "conv2_block1_0_relu", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv2_block1_0_bn", 0, 0, {}]]]}, {"name": "conv2_block1_1_conv", "class_name": "Conv2D", "config": {"name": "conv2_block1_1_conv", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "strides": [1, 1], "use_bias": false, "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last"}, "inbound_nodes": [[["conv2_block1_0_relu", 0, 0, {}]]]}, {"name": "conv2_block1_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block1_1_bn", "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 1.001e-05, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true}, "inbound_nodes": [[["conv2_block1_1_conv", 0, 0, {}]]]}, {"name": "conv2_block1_1_relu", "class_name": "Activation", "config": {"name": "conv2_block1_1_relu", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv2_block1_1_bn", 0, 0, {}]]]}, {"name": "conv2_block1_2_conv", "class_name": "Conv2D", "config": {"name": "conv2_block1_2_conv", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "use_bias": false, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last"}, "inbound_nodes": [[["conv2_block1_1_relu", 0, 0, {}]]]}, {"name": "conv2_block1_concat", "class_name": "Concatenate", "config": {"name": "conv2_block1_concat", "axis": 3, "trainable": true}, "inbound_nodes": [[["pool1", 0, 0, {}], ["conv2_block1_2_conv", 0, 0, {}]]]}, {"name": "conv2_block2_0_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block2_0_bn", "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 1.001e-05, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true}, "inbound_nodes": [[["conv2_block1_concat", 0, 0, {}]]]}, {"name": "conv2_block2_0_relu", "class_name": "Activation", "config": {"name": "conv2_block2_0_relu", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv2_block2_0_bn", 0, 0, {}]]]}, {"name": "conv2_block2_1_conv", "class_name": "Conv2D", "config": {"name": "conv2_block2_1_conv", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "strides": [1, 1], "use_bias": false, "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last"}, "inbound_nodes": [[["conv2_block2_0_relu", 0, 0, {}]]]}, {"name": "conv2_block2_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block2_1_bn", "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 1.001e-05, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true}, "inbound_nodes": [[["conv2_block2_1_conv", 0, 0, {}]]]}, {"name": "conv2_block2_1_relu", "class_name": "Activation", "config": {"name": "conv2_block2_1_relu", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv2_block2_1_bn", 0, 0, {}]]]}, {"name": "conv2_block2_2_conv", "class_name": "Conv2D", "config": {"name": "conv2_block2_2_conv", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "use_bias": false, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last"}, "inbound_nodes": [[["conv2_block2_1_relu", 0, 0, {}]]]}, {"name": "conv2_block2_concat", "class_name": "Concatenate", "config": {"name": "conv2_block2_concat", "axis": 3, "trainable": true}, "inbound_nodes": [[["conv2_block1_concat", 0, 0, {}], ["conv2_block2_2_conv", 0, 0, {}]]]}, {"name": "conv2_block3_0_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block3_0_bn", "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 1.001e-05, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true}, "inbound_nodes": [[["conv2_block2_concat", 0, 0, {}]]]}, {"name": "conv2_block3_0_relu", "class_name": "Activation", "config": {"name": "conv2_block3_0_relu", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv2_block3_0_bn", 0, 0, {}]]]}, {"name": "conv2_block3_1_conv", "class_name": "Conv2D", "config": {"name": "conv2_block3_1_conv", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "strides": [1, 1], "use_bias": false, "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last"}, "inbound_nodes": [[["conv2_block3_0_relu", 0, 0, {}]]]}, {"name": "conv2_block3_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block3_1_bn", "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 1.001e-05, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true}, "inbound_nodes": [[["conv2_block3_1_conv", 0, 0, {}]]]}, {"name": "conv2_block3_1_relu", "class_name": "Activation", "config": {"name": "conv2_block3_1_relu", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv2_block3_1_bn", 0, 0, {}]]]}, {"name": "conv2_block3_2_conv", "class_name": "Conv2D", "config": {"name": "conv2_block3_2_conv", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "use_bias": false, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last"}, "inbound_nodes": [[["conv2_block3_1_relu", 0, 0, {}]]]}, {"name": "conv2_block3_concat", "class_name": "Concatenate", "config": {"name": "conv2_block3_concat", "axis": 3, "trainable": true}, "inbound_nodes": [[["conv2_block2_concat", 0, 0, {}], ["conv2_block3_2_conv", 0, 0, {}]]]}, {"name": "conv2_block4_0_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block4_0_bn", "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 1.001e-05, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true}, "inbound_nodes": [[["conv2_block3_concat", 0, 0, {}]]]}, {"name": "conv2_block4_0_relu", "class_name": "Activation", "config": {"name": "conv2_block4_0_relu", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv2_block4_0_bn", 0, 0, {}]]]}, {"name": "conv2_block4_1_conv", "class_name": "Conv2D", "config": {"name": "conv2_block4_1_conv", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "strides": [1, 1], "use_bias": false, "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last"}, "inbound_nodes": [[["conv2_block4_0_relu", 0, 0, {}]]]}, {"name": "conv2_block4_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block4_1_bn", "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 1.001e-05, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true}, "inbound_nodes": [[["conv2_block4_1_conv", 0, 0, {}]]]}, {"name": "conv2_block4_1_relu", "class_name": "Activation", "config": {"name": "conv2_block4_1_relu", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv2_block4_1_bn", 0, 0, {}]]]}, {"name": "conv2_block4_2_conv", "class_name": "Conv2D", "config": {"name": "conv2_block4_2_conv", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "use_bias": false, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last"}, "inbound_nodes": [[["conv2_block4_1_relu", 0, 0, {}]]]}, {"name": "conv2_block4_concat", "class_name": "Concatenate", "config": {"name": "conv2_block4_concat", "axis": 3, "trainable": true}, "inbound_nodes": [[["conv2_block3_concat", 0, 0, {}], ["conv2_block4_2_conv", 0, 0, {}]]]}, {"name": "conv2_block5_0_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block5_0_bn", "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 1.001e-05, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true}, "inbound_nodes": [[["conv2_block4_concat", 0, 0, {}]]]}, {"name": "conv2_block5_0_relu", "class_name": "Activation", "config": {"name": "conv2_block5_0_relu", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv2_block5_0_bn", 0, 0, {}]]]}, {"name": "conv2_block5_1_conv", "class_name": "Conv2D", "config": {"name": "conv2_block5_1_conv", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "strides": [1, 1], "use_bias": false, "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last"}, "inbound_nodes": [[["conv2_block5_0_relu", 0, 0, {}]]]}, {"name": "conv2_block5_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block5_1_bn", "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 1.001e-05, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true}, "inbound_nodes": [[["conv2_block5_1_conv", 0, 0, {}]]]}, {"name": "conv2_block5_1_relu", "class_name": "Activation", "config": {"name": "conv2_block5_1_relu", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv2_block5_1_bn", 0, 0, {}]]]}, {"name": "conv2_block5_2_conv", "class_name": "Conv2D", "config": {"name": "conv2_block5_2_conv", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "use_bias": false, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last"}, "inbound_nodes": [[["conv2_block5_1_relu", 0, 0, {}]]]}, {"name": "conv2_block5_concat", "class_name": "Concatenate", "config": {"name": "conv2_block5_concat", "axis": 3, "trainable": true}, "inbound_nodes": [[["conv2_block4_concat", 0, 0, {}], ["conv2_block5_2_conv", 0, 0, {}]]]}, {"name": "conv2_block6_0_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block6_0_bn", "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 1.001e-05, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true}, "inbound_nodes": [[["conv2_block5_concat", 0, 0, {}]]]}, {"name": "conv2_block6_0_relu", "class_name": "Activation", "config": {"name": "conv2_block6_0_relu", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv2_block6_0_bn", 0, 0, {}]]]}, {"name": "conv2_block6_1_conv", "class_name": "Conv2D", "config": {"name": "conv2_block6_1_conv", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "strides": [1, 1], "use_bias": false, "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last"}, "inbound_nodes": [[["conv2_block6_0_relu", 0, 0, {}]]]}, {"name": "conv2_block6_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block6_1_bn", "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 1.001e-05, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true}, "inbound_nodes": [[["conv2_block6_1_conv", 0, 0, {}]]]}, {"name": "conv2_block6_1_relu", "class_name": "Activation", "config": {"name": "conv2_block6_1_relu", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv2_block6_1_bn", 0, 0, {}]]]}, {"name": "conv2_block6_2_conv", "class_name": "Conv2D", "config": {"name": "conv2_block6_2_conv", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "use_bias": false, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last"}, "inbound_nodes": [[["conv2_block6_1_relu", 0, 0, {}]]]}, {"name": "conv2_block6_concat", "class_name": "Concatenate", "config": {"name": "conv2_block6_concat", "axis": 3, "trainable": true}, "inbound_nodes": [[["conv2_block5_concat", 0, 0, {}], ["conv2_block6_2_conv", 0, 0, {}]]]}, {"name": "pool2_bn", "class_name": "BatchNormalization", "config": {"name": "pool2_bn", "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 1.001e-05, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true}, "inbound_nodes": [[["conv2_block6_concat", 0, 0, {}]]]}, {"name": "pool2_relu", "class_name": "Activation", "config": {"name": "pool2_relu", "activation": "relu", "trainable": true}, "inbound_nodes": [[["pool2_bn", 0, 0, {}]]]}, {"name": "pool2_conv", "class_name": "Conv2D", "config": {"name": "pool2_conv", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "strides": [1, 1], "use_bias": false, "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last"}, "inbound_nodes": [[["pool2_relu", 0, 0, {}]]]}, {"name": "pool2_pool", "class_name": "AveragePooling2D", "config": {"name": "pool2_pool", "pool_size": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}, "inbound_nodes": [[["pool2_conv", 0, 0, {}]]]}, {"name": "conv3_block1_0_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block1_0_bn", "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 1.001e-05, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true}, "inbound_nodes": [[["pool2_pool", 0, 0, {}]]]}, {"name": "conv3_block1_0_relu", "class_name": "Activation", "config": {"name": "conv3_block1_0_relu", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv3_block1_0_bn", 0, 0, {}]]]}, {"name": "conv3_block1_1_conv", "class_name": "Conv2D", "config": {"name": "conv3_block1_1_conv", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "strides": [1, 1], "use_bias": false, "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last"}, "inbound_nodes": [[["conv3_block1_0_relu", 0, 0, {}]]]}, {"name": "conv3_block1_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block1_1_bn", "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 1.001e-05, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true}, "inbound_nodes": [[["conv3_block1_1_conv", 0, 0, {}]]]}, {"name": "conv3_block1_1_relu", "class_name": "Activation", "config": {"name": "conv3_block1_1_relu", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv3_block1_1_bn", 0, 0, {}]]]}, {"name": "conv3_block1_2_conv", "class_name": "Conv2D", "config": {"name": "conv3_block1_2_conv", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "use_bias": false, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last"}, "inbound_nodes": [[["conv3_block1_1_relu", 0, 0, {}]]]}, {"name": "conv3_block1_concat", "class_name": "Concatenate", "config": {"name": "conv3_block1_concat", "axis": 3, "trainable": true}, "inbound_nodes": [[["pool2_pool", 0, 0, {}], ["conv3_block1_2_conv", 0, 0, {}]]]}, {"name": "conv3_block2_0_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block2_0_bn", "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 1.001e-05, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true}, "inbound_nodes": [[["conv3_block1_concat", 0, 0, {}]]]}, {"name": "conv3_block2_0_relu", "class_name": "Activation", "config": {"name": "conv3_block2_0_relu", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv3_block2_0_bn", 0, 0, {}]]]}, {"name": "conv3_block2_1_conv", "class_name": "Conv2D", "config": {"name": "conv3_block2_1_conv", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "strides": [1, 1], "use_bias": false, "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last"}, "inbound_nodes": [[["conv3_block2_0_relu", 0, 0, {}]]]}, {"name": "conv3_block2_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block2_1_bn", "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 1.001e-05, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true}, "inbound_nodes": [[["conv3_block2_1_conv", 0, 0, {}]]]}, {"name": "conv3_block2_1_relu", "class_name": "Activation", "config": {"name": "conv3_block2_1_relu", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv3_block2_1_bn", 0, 0, {}]]]}, {"name": "conv3_block2_2_conv", "class_name": "Conv2D", "config": {"name": "conv3_block2_2_conv", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "use_bias": false, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last"}, "inbound_nodes": [[["conv3_block2_1_relu", 0, 0, {}]]]}, {"name": "conv3_block2_concat", "class_name": "Concatenate", "config": {"name": "conv3_block2_concat", "axis": 3, "trainable": true}, "inbound_nodes": [[["conv3_block1_concat", 0, 0, {}], ["conv3_block2_2_conv", 0, 0, {}]]]}, {"name": "conv3_block3_0_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block3_0_bn", "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 1.001e-05, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true}, "inbound_nodes": [[["conv3_block2_concat", 0, 0, {}]]]}, {"name": "conv3_block3_0_relu", "class_name": "Activation", "config": {"name": "conv3_block3_0_relu", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv3_block3_0_bn", 0, 0, {}]]]}, {"name": "conv3_block3_1_conv", "class_name": "Conv2D", "config": {"name": "conv3_block3_1_conv", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "strides": [1, 1], "use_bias": false, "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last"}, "inbound_nodes": [[["conv3_block3_0_relu", 0, 0, {}]]]}, {"name": "conv3_block3_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block3_1_bn", "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 1.001e-05, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true}, "inbound_nodes": [[["conv3_block3_1_conv", 0, 0, {}]]]}, {"name": "conv3_block3_1_relu", "class_name": "Activation", "config": {"name": "conv3_block3_1_relu", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv3_block3_1_bn", 0, 0, {}]]]}, {"name": "conv3_block3_2_conv", "class_name": "Conv2D", "config": {"name": "conv3_block3_2_conv", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "use_bias": false, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last"}, "inbound_nodes": [[["conv3_block3_1_relu", 0, 0, {}]]]}, {"name": "conv3_block3_concat", "class_name": "Concatenate", "config": {"name": "conv3_block3_concat", "axis": 3, "trainable": true}, "inbound_nodes": [[["conv3_block2_concat", 0, 0, {}], ["conv3_block3_2_conv", 0, 0, {}]]]}, {"name": "conv3_block4_0_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block4_0_bn", "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 1.001e-05, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true}, "inbound_nodes": [[["conv3_block3_concat", 0, 0, {}]]]}, {"name": "conv3_block4_0_relu", "class_name": "Activation", "config": {"name": "conv3_block4_0_relu", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv3_block4_0_bn", 0, 0, {}]]]}, {"name": "conv3_block4_1_conv", "class_name": "Conv2D", "config": {"name": "conv3_block4_1_conv", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "strides": [1, 1], "use_bias": false, "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last"}, "inbound_nodes": [[["conv3_block4_0_relu", 0, 0, {}]]]}, {"name": "conv3_block4_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block4_1_bn", "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 1.001e-05, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true}, "inbound_nodes": [[["conv3_block4_1_conv", 0, 0, {}]]]}, {"name": "conv3_block4_1_relu", "class_name": "Activation", "config": {"name": "conv3_block4_1_relu", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv3_block4_1_bn", 0, 0, {}]]]}, {"name": "conv3_block4_2_conv", "class_name": "Conv2D", "config": {"name": "conv3_block4_2_conv", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "use_bias": false, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last"}, "inbound_nodes": [[["conv3_block4_1_relu", 0, 0, {}]]]}, {"name": "conv3_block4_concat", "class_name": "Concatenate", "config": {"name": "conv3_block4_concat", "axis": 3, "trainable": true}, "inbound_nodes": [[["conv3_block3_concat", 0, 0, {}], ["conv3_block4_2_conv", 0, 0, {}]]]}, {"name": "conv3_block5_0_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block5_0_bn", "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 1.001e-05, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true}, "inbound_nodes": [[["conv3_block4_concat", 0, 0, {}]]]}, {"name": "conv3_block5_0_relu", "class_name": "Activation", "config": {"name": "conv3_block5_0_relu", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv3_block5_0_bn", 0, 0, {}]]]}, {"name": "conv3_block5_1_conv", "class_name": "Conv2D", "config": {"name": "conv3_block5_1_conv", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "strides": [1, 1], "use_bias": false, "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last"}, "inbound_nodes": [[["conv3_block5_0_relu", 0, 0, {}]]]}, {"name": "conv3_block5_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block5_1_bn", "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": 