{"class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "zero_padding2d_1", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_1", "trainable": true, "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv1", "class_name": "Conv2D", "config": {"name": "conv1", "trainable": true, "filters": 64, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]]}, {"name": "bn_conv1", "class_name": "FixedBatchNormalization", "config": {"name": "bn_conv1", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn_conv1", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "res2a_branch2a", "class_name": "Conv2D", "config": {"name": "res2a_branch2a", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "bn2a_branch2a", "class_name": "FixedBatchNormalization", "config": {"name": "bn2a_branch2a", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]]}, {"name": "res2a_branch2b", "class_name": "Conv2D", "config": {"name": "res2a_branch2b", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "bn2a_branch2b", "class_name": "FixedBatchNormalization", "config": {"name": "bn2a_branch2b", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2a_branch2b", 0, 0, {}]]]}, {"name": "res2a_branch2c", "class_name": "Conv2D", "config": {"name": "res2a_branch2c", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "res2a_branch1", "class_name": "Conv2D", "config": {"name": "res2a_branch1", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "bn2a_branch2c", "class_name": "FixedBatchNormalization", "config": {"name": "bn2a_branch2c", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]]}, {"name": "bn2a_branch1", "class_name": "FixedBatchNormalization", "config": {"name": "bn2a_branch1", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res2a_branch1", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["bn2a_branch2c", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "res2b_branch2a", "class_name": "Conv2D", "config": {"name": "res2b_branch2a", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"name": "bn2b_branch2a", "class_name": "FixedBatchNormalization", "config": {"name": "bn2b_branch2a", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]]}, {"name": "res2b_branch2b", "class_name": "Conv2D", "config": {"name": "res2b_branch2b", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"name": "bn2b_branch2b", "class_name": "FixedBatchNormalization", "config": {"name": "bn2b_branch2b", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]]}, {"name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2b_branch2b", 0, 0, {}]]]}, {"name": "res2b_branch2c", "class_name": "Conv2D", "config": {"name": "res2b_branch2c", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"name": "bn2b_branch2c", "class_name": "FixedBatchNormalization", "config": {"name": "bn2b_branch2c", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res2b_branch2c", 0, 0, {}]]]}, {"name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["bn2b_branch2c", 0, 0, {}], ["activation_4", 0, 0, {}]]]}, {"name": "activation_7", "class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "res2c_branch2a", "class_name": "Conv2D", "config": {"name": "res2c_branch2a", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"name": "bn2c_branch2a", "class_name": "FixedBatchNormalization", "config": {"name": "bn2c_branch2a", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res2c_branch2a", 0, 0, {}]]]}, {"name": "activation_8", "class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2c_branch2a", 0, 0, {}]]]}, {"name": "res2c_branch2b", "class_name": "Conv2D", "config": {"name": "res2c_branch2b", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"name": "bn2c_branch2b", "class_name": "FixedBatchNormalization", "config": {"name": "bn2c_branch2b", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res2c_branch2b", 0, 0, {}]]]}, {"name": "activation_9", "class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2c_branch2b", 0, 0, {}]]]}, {"name": "res2c_branch2c", "class_name": "Conv2D", "config": {"name": "res2c_branch2c", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"name": "bn2c_branch2c", "class_name": "FixedBatchNormalization", "config": {"name": "bn2c_branch2c", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res2c_branch2c", 0, 0, {}]]]}, {"name": "add_3", "class_name": "Add", "config": {"name": "add_3", "trainable": true}, "inbound_nodes": [[["bn2c_branch2c", 0, 0, {}], ["activation_7", 0, 0, {}]]]}, {"name": "activation_10", "class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"name": "res3a_branch2a", "class_name": "Conv2D", "config": {"name": "res3a_branch2a", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"name": "bn3a_branch2a", "class_name": "FixedBatchNormalization", "config": {"name": "bn3a_branch2a", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res3a_branch2a", 0, 0, {}]]]}, {"name": "activation_11", "class_name": "Activation", "config": {"name": "activation_11", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]]}, {"name": "res3a_branch2b", "class_name": "Conv2D", "config": {"name": "res3a_branch2b", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"name": "bn3a_branch2b", "class_name": "FixedBatchNormalization", "config": {"name": "bn3a_branch2b", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]]}, {"name": "activation_12", "class_name": "Activation", "config": {"name": "activation_12", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3a_branch2b", 0, 0, {}]]]}, {"name": "res3a_branch2c", "class_name": "Conv2D", "config": {"name": "res3a_branch2c", "trainable": true, "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"name": "res3a_branch1", "class_name": "Conv2D", "config": {"name": "res3a_branch1", "trainable": true, "filters": 512, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"name": "bn3a_branch2c", "class_name": "FixedBatchNormalization", "config": {"name": "bn3a_branch2c", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res3a_branch2c", 0, 0, {}]]]}, {"name": "bn3a_branch1", "class_name": "FixedBatchNormalization", "config": {"name": "bn3a_branch1", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res3a_branch1", 0, 0, {}]]]}, {"name": "add_4", "class_name": "Add", "config": {"name": "add_4", "trainable": true}, "inbound_nodes": [[["bn3a_branch2c", 0, 0, {}], ["bn3a_branch1", 0, 0, {}]]]}, {"name": "activation_13", "class_name": "Activation", "config": {"name": "activation_13", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"name": "res3b_branch2a", "class_name": "Conv2D", "config": {"name": "res3b_branch2a", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"name": "bn3b_branch2a", "class_name": "FixedBatchNormalization", "config": {"name": "bn3b_branch2a", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res3b_branch2a", 0, 0, {}]]]}, {"name": "activation_14", "class_name": "Activation", "config": {"name": "activation_14", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3b_branch2a", 0, 0, {}]]]}, {"name": "res3b_branch2b", "class_name": "Conv2D", "config": {"name": "res3b_branch2b", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"name": "bn3b_branch2b", "class_name": "FixedBatchNormalization", "config": {"name": "bn3b_branch2b", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res3b_branch2b", 0, 0, {}]]]}, {"name": "activation_15", "class_name": "Activation", "config": {"name": "activation_15", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3b_branch2b", 0, 0, {}]]]}, {"name": "res3b_branch2c", "class_name": "Conv2D", "config": {"name": "res3b_branch2c", "trainable": true, "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_15", 0, 0, {}]]]}, {"name": "bn3b_branch2c", "class_name": "FixedBatchNormalization", "config": {"name": "bn3b_branch2c", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res3b_branch2c", 0, 0, {}]]]}, {"name": "add_5", "class_name": "Add", "config": {"name": "add_5", "trainable": true}, "inbound_nodes": [[["bn3b_branch2c", 0, 0, {}], ["activation_13", 0, 0, {}]]]}, {"name": "activation_16", "class_name": "Activation", "config": {"name": "activation_16", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"name": "res3c_branch2a", "class_name": "Conv2D", "config": {"name": "res3c_branch2a", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"name": "bn3c_branch2a", "class_name": "FixedBatchNormalization", "config": {"name": "bn3c_branch2a", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res3c_branch2a", 0, 0, {}]]]}, {"name": "activation_17", "class_name": "Activation", "config": {"name": "activation_17", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3c_branch2a", 0, 0, {}]]]}, {"name": "res3c_branch2b", "class_name": "Conv2D", "config": {"name": "res3c_branch2b", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"name": "bn3c_branch2b", "class_name": "FixedBatchNormalization", "config": {"name": "bn3c_branch2b", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res3c_branch2b", 0, 0, {}]]]}, {"name": "activation_18", "class_name": "Activation", "config": {"name": "activation_18", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3c_branch2b", 0, 0, {}]]]}, {"name": "res3c_branch2c", "class_name": "Conv2D", "config": {"name": "res3c_branch2c", "trainable": true, "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_18", 0, 0, {}]]]}, {"name": "bn3c_branch2c", "class_name": "FixedBatchNormalization", "config": {"name": "bn3c_branch2c", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res3c_branch2c", 0, 0, {}]]]}, {"name": "add_6", "class_name": "Add", "config": {"name": "add_6", "trainable": true}, "inbound_nodes": [[["bn3c_branch2c", 0, 0, {}], ["activation_16", 0, 0, {}]]]}, {"name": "activation_19", "class_name": "Activation", "config": {"name": "activation_19", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"name": "res3d_branch2a", "class_name": "Conv2D", "config": {"name": "res3d_branch2a", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_19", 0, 0, {}]]]}, {"name": "bn3d_branch2a", "class_name": "FixedBatchNormalization", "config": {"name": "bn3d_branch2a", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res3d_branch2a", 0, 0, {}]]]}, {"name": "activation_20", "class_name": "Activation", "config": {"name": "activation_20", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3d_branch2a", 0, 0, {}]]]}, {"name": "res3d_branch2b", "class_name": "Conv2D", "config": {"name": "res3d_branch2b", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_20", 0, 0, {}]]]}, {"name": "bn3d_branch2b", "class_name": "FixedBatchNormalization", "config": {"name": "bn3d_branch2b", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res3d_branch2b", 0, 0, {}]]]}, {"name": "activation_21", "class_name": "Activation", "config": {"name": "activation_21", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3d_branch2b", 0, 0, {}]]]}, {"name": "res3d_branch2c", "class_name": "Conv2D", "config": {"name": "res3d_branch2c", "trainable": true, "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"name": "bn3d_branch2c", "class_name": "FixedBatchNormalization", "config": {"name": "bn3d_branch2c", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res3d_branch2c", 0, 0, {}]]]}, {"name": "add_7", "class_name": "Add", "config": {"name": "add_7", "trainable": true}, "inbound_nodes": [[["bn3d_branch2c", 0, 0, {}], ["activation_19", 0, 0, {}]]]}, {"name": "activation_22", "class_name": "Activation", "config": {"name": "activation_22", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"name": "res4a_branch2a", "class_name": "Conv2D", "config": {"name": "res4a_branch2a", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_22", 0, 0, {}]]]}, {"name": "bn4a_branch2a", "class_name": "FixedBatchNormalization", "config": {"name": "bn4a_branch2a", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res4a_branch2a", 0, 0, {}]]]}, {"name": "activation_23", "class_name": "Activation", "config": {"name": "activation_23", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4a_branch2a", 0, 0, {}]]]}, {"name": "res4a_branch2b", "class_name": "Conv2D", "config": {"name": "res4a_branch2b", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"name": "bn4a_branch2b", "class_name": "FixedBatchNormalization", "config": {"name": "bn4a_branch2b", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res4a_branch2b", 0, 0, {}]]]}, {"name": "activation_24", "class_name": "Activation", "config": {"name": "activation_24", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4a_branch2b", 0, 0, {}]]]}, {"name": "res4a_branch2c", "class_name": "Conv2D", "config": {"name": "res4a_branch2c", "trainable": true, "filters": 1024, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_24", 0, 0, {}]]]}, {"name": "res4a_branch1", "class_name": "Conv2D", "config": {"name": "res4a_branch1", "trainable": true, "filters": 1024, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_22", 0, 0, {}]]]}, {"name": "bn4a_branch2c", "class_name": "FixedBatchNormalization", "config": {"name": "bn4a_branch2c", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res4a_branch2c", 0, 0, {}]]]}, {"name": "bn4a_branch1", "class_name": "FixedBatchNormalization", "config": {"name": "bn4a_branch1", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res4a_branch1", 0, 0, {}]]]}, {"name": "add_8", "class_name": "Add", "config": {"name": "add_8", "trainable": true}, "inbound_nodes": [[["bn4a_branch2c", 0, 0, {}], ["bn4a_branch1", 0, 0, {}]]]}, {"name": "activation_25", "class_name": "Activation", "config": {"name": "activation_25", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"name": "res4b_branch2a", "class_name": "Conv2D", "config": {"name": "res4b_branch2a", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_25", 0, 0, {}]]]}, {"name": "bn4b_branch2a", "class_name": "FixedBatchNormalization", "config": {"name": "bn4b_branch2a", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res4b_branch2a", 0, 0, {}]]]}, {"name": "activation_26", "class_name": "Activation", "config": {"name": "activation_26", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4b_branch2a", 0, 0, {}]]]}, {"name": "res4b_branch2b", "class_name": "Conv2D", "config": {"name": "res4b_branch2b", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_26", 0, 0, {}]]]}, {"name": "bn4b_branch2b", "class_name": "FixedBatchNormalization", "config": {"name": "bn4b_branch2b", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res4b_branch2b", 0, 0, {}]]]}, {"name": "activation_27", "class_name": "Activation", "config": {"name": "activation_27", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4b_branch2b", 0, 0, {}]]]}, {"name": "res4b_branch2c", "class_name": "Conv2D", "config": {"name": "res4b_branch2c", "trainable": true, "filters": 1024, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_27", 0, 0, {}]]]}, {"name": "bn4b_branch2c", "class_name": "FixedBatchNormalization", "config": {"name": "bn4b_branch2c", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res4b_branch2c", 0, 0, {}]]]}, {"name": "add_9", "class_name": "Add", "config": {"name": "add_9", "trainable": true}, "inbound_nodes": [[["bn4b_branch2c", 0, 0, {}], ["activation_25", 0, 0, {}]]]}, {"name": "activation_28", "class_name": "Activation", "config": {"name": "activation_28", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"name": "res4c_branch2a", "class_name": "Conv2D", "config": {"name": "res4c_branch2a", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_28", 0, 0, {}]]]}, {"name": "bn4c_branch2a", "class_name": "FixedBatchNormalization", "config": {"name": "bn4c_branch2a", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res4c_branch2a", 0, 0, {}]]]}, {"name": "activation_29", "class_name": "Activation", "config": {"name": "activation_29", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4c_branch2a", 0, 0, {}]]]}, {"name": "res4c_branch2b", "class_name": "Conv2D", "config": {"name": "res4c_branch2b", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_29", 0, 0, {}]]]}, {"name": "bn4c_branch2b", "class_name": "FixedBatchNormalization", "config": {"name": "bn4c_branch2b", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res4c_branch2b", 0, 0, {}]]]}, {"name": "activation_30", "class_name": "Activation", "config": {"name": "activation_30", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4c_branch2b", 0, 0, {}]]]}, {"name": "res4c_branch2c", "class_name": "Conv2D", "config": {"name": "res4c_branch2c", "trainable": true, "filters": 1024, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_30", 0, 0, {}]]]}, {"name": "bn4c_branch2c", "class_name": "FixedBatchNormalization", "config": {"name": "bn4c_branch2c", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res4c_branch2c", 0, 0, {}]]]}, {"name": "add_10", "class_name": "Add", "config": {"name": "add_10", "trainable": true}, "inbound_nodes": [[["bn4c_branch2c", 0, 0, {}], ["activation_28", 0, 0, {}]]]}, {"name": "activation_31", "class_name": "Activation", "config": {"name": "activation_31", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_10", 0, 0, {}]]]}, {"name": "res4d_branch2a", "class_name": "Conv2D", "config": {"name": "res4d_branch2a", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_31", 0, 0, {}]]]}, {"name": "bn4d_branch2a", "class_name": "FixedBatchNormalization", "config": {"name": "bn4d_branch2a", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res4d_branch2a", 0, 0, {}]]]}, {"name": "activation_32", "class_name": "Activation", "config": {"name": "activation_32", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4d_branch2a", 0, 0, {}]]]}, {"name": "res4d_branch2b", "class_name": "Conv2D", "config": {"name": "res4d_branch2b", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_32", 0, 0, {}]]]}, {"name": "bn4d_branch2b", "class_name": "FixedBatchNormalization", "config": {"name": "bn4d_branch2b", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res4d_branch2b", 0, 0, {}]]]}, {"name": "activation_33", "class_name": "Activation", "config": {"name": "activation_33", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4d_branch2b", 0, 0, {}]]]}, {"name": "res4d_branch2c", "class_name": "Conv2D", "config": {"name": "res4d_branch2c", "trainable": true, "filters": 1024, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_33", 0, 0, {}]]]}, {"name": "bn4d_branch2c", "class_name": "FixedBatchNormalization", "config": {"name": "bn4d_branch2c", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res4d_branch2c", 0, 0, {}]]]}, {"name": "add_11", "class_name": "Add", "config": {"name": "add_11", "trainable": true}, "inbound_nodes": [[["bn4d_branch2c", 0, 0, {}], ["activation_31", 0, 0, {}]]]}, {"name": "activation_34", "class_name": "Activation", "config": {"name": "activation_34", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_11", 0, 0, {}]]]}, {"name": "res4e_branch2a", "class_name": "Conv2D", "config": {"name": "res4e_branch2a", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_34", 0, 0, {}]]]}, {"name": "bn4e_branch2a", "class_name": "FixedBatchNormalization", "config": {"name": "bn4e_branch2a", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res4e_branch2a", 0, 0, {}]]]}, {"name": "activation_35", "class_name": "Activation", "config": {"name": "activation_35", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4e_branch2a", 0, 0, {}]]]}, {"name": "res4e_branch2b", "class_name": "Conv2D", "config": {"name": "res4e_branch2b", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_35", 0, 0, {}]]]}, {"name": "bn4e_branch2b", "class_name": "FixedBatchNormalization", "config": {"name": "bn4e_branch2b", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res4e_branch2b", 0, 0, {}]]]}, {"name": "activation_36", "class_name": "Activation", "config": {"name": "activation_36", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4e_branch2b", 0, 0, {}]]]}, {"name": "res4e_branch2c", "class_name": "Conv2D", "config": {"name": "res4e_branch2c", "trainable": true, "filters": 1024, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_36", 0, 0, {}]]]}, {"name": "bn4e_branch2c", "class_name": "FixedBatchNormalization", "config": {"name": "bn4e_branch2c", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res4e_branch2c", 0, 0, {}]]]}, {"name": "add_12", "class_name": "Add", "config": {"name": "add_12", "trainable": true}, "inbound_nodes": [[["bn4e_branch2c", 0, 0, {}], ["activation_34", 0, 0, {}]]]}, {"name": "activation_37", "class_name": "Activation", "config": {"name": "activation_37", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_12", 0, 0, {}]]]}, {"name": "res4f_branch2a", "class_name": "Conv2D", "config": {"name": "res4f_branch2a", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_37", 0, 0, {}]]]}, {"name": "bn4f_branch2a", "class_name": "FixedBatchNormalization", "config": {"name": "bn4f_branch2a", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res4f_branch2a", 0, 0, {}]]]}, {"name": "activation_38", "class_name": "Activation", "config": {"name": "activation_38", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4f_branch2a", 0, 0, {}]]]}, {"name": "res4f_branch2b", "class_name": "Conv2D", "config": {"name": "res4f_branch2b", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_38", 0, 0, {}]]]}, {"name": "bn4f_branch2b", "class_name": "FixedBatchNormalization", "config": {"name": "bn4f_branch2b", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res4f_branch2b", 0, 0, {}]]]}, {"name": "activation_39", "class_name": "Activation", "config": {"name": "activation_39", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4f_branch2b", 0, 0, {}]]]}, {"name": "res4f_branch2c", "class_name": "Conv2D", "config": {"name": "res4f_branch2c", "trainable": true, "filters": 1024, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_39", 0, 0, {}]]]}, {"name": "bn4f_branch2c", "class_name": "FixedBatchNormalization", "config": {"name": "bn4f_branch2c", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}, "inbound_nodes": [[["res4f_branch2c", 0, 0, {}]]]}, {"name": "add_13", "class_name": "Add", "config": {"name": "add_13", "trainable": true}, "inbound_nodes": [[["bn4f_branch2c", 0, 0, {}], ["activation_37", 0, 0, {}]]]}, {"name": "activation_40", "class_name": "Activation", "config": {"name": "activation_40", "trainable": true,