{
    "params": {
        "conv2d_32": 1049088,
        "batch_normalization_25": 2048,
        "dropout_26": 0,
        "activation_28": 0,
        "activation_12": 0,
        "activation_26": 0,
        "conv2d_10": 73856,
        "activation_35": 0,
        "dropout_4": 0,
        "batch_normalization_17": 1024,
        "dropout_11": 0,
        "activation_17": 0,
        "conv2d_15": 295168,
        "max_pooling2d_3": 0,
        "batch_normalization_22": 2048,
        "activation_8": 0,
        "batch_normalization_33": 2048,
        "conv2d_28": 1180160,
        "batch_normalization_32": 2048,
        "max_pooling2d_2": 0,
        "batch_normalization_34": 2048,
        "activation_31": 0,
        "conv2d_14": 73856,
        "dropout_28": 0,
        "activation_13": 0,
        "activation_2": 0,
        "conv2d_33": 1049088,
        "dropout_23": 0,
        "dropout_17": 0,
        "conv2d_12": 147584,
        "activation_15": 0,
        "join_layer_7": 0,
        "activation_5": 0,
        "activation_25": 0,
        "conv2d_22": 1180160,
        "activation_9": 0,
        "batch_normalization_15": 1024,
        "conv2d_29": 1049088,
        "dropout_12": 0,
        "dropout_16": 0,
        "batch_normalization_14": 512,
        "activation_6": 0,
        "dropout_19": 0,
        "activation_36": 0,
        "batch_normalization_31": 2048,
        "activation_34": 0,
        "batch_normalization_5": 256,
        "join_layer_1": 0,
        "batch_normalization_27": 2048,
        "batch_normalization_3": 256,
        "dropout_1": 0,
        "conv2d_26": 2359808,
        "dropout_7": 0,
        "conv2d_23": 2359808,
        "join_layer_4": 0,
        "conv2d_30": 1049088,
        "batch_normalization_10": 512,
        "activation_21": 0,
        "activation_24": 0,
        "batch_normalization_19": 1024,
        "activation_23": 0,
        "dropout_20": 0,
        "batch_normalization_23": 2048,
        "batch_normalization_4": 256,
        "activation_16": 0,
        "dropout_25": 0,
        "conv2d_3": 1792,
        "conv2d_1": 1792,
        "conv2d_11": 147584,
        "conv2d_34": 1049088,
        "conv2d_2": 36928,
        "activation_1": 0,
        "join_layer_2": 0,
        "conv2d_20": 590080,
        "activation_22": 0,
        "max_pooling2d_1": 0,
        "activation_27": 0,
        "max_pooling2d_4": 0,
        "dropout_15": 0,
        "activation_7": 0,
        "conv2d_27": 2359808,
        "activation_10": 0,
        "batch_normalization_29": 2048,
        "conv2d_24": 1180160,
        "batch_normalization_28": 2048,
        "input_1": 0,
        "batch_normalization_18": 1024,
        "batch_normalization_30": 2048,
        "conv2d_18": 590080,
        "dropout_22": 0,
        "conv2d_17": 295168,
        "batch_normalization_8": 512,
        "conv2d_31": 1049088,
        "batch_normalization_20": 1024,
        "dropout_18": 0,
        "flatten_1": 0,
        "conv2d_21": 295168,
        "batch_normalization_11": 512,
        "activation_14": 0,
        "activation_11": 0,
        "activation_19": 0,
        "conv2d_19": 590080,
        "conv2d_6": 36928,
        "max_pooling2d_5": 0,
        "batch_normalization_7": 256,
        "join_layer_5": 0,
        "batch_normalization_16": 1024,
        "dropout_9": 0,
        "join_layer_10": 0,
        "batch_normalization_24": 2048,
        "conv2d_5": 36928,
        "dropout_14": 0,
        "batch_normalization_13": 512,
        "dropout_5": 0,
        "batch_normalization_26": 2048,
        "activation_20": 0,
        "activation_33": 0,
        "conv2d_8": 73856,
        "join_layer_8": 0,
        "conv2d_7": 1792,
        "join_layer_6": 0,
        "activation_18": 0,
        "batch_normalization_12": 512,
        "dropout_2": 0,
        "join_layer_3": 0,
        "dense_1": 51300,
        "activation_29": 0,
        "dropout_3": 0,
        "activation_30": 0,
        "dropout_21": 0,
        "dropout_13": 0,
        "join_layer_9": 0,
        "dropout_10": 0,
        "activation_3": 0,
        "batch_normalization_6": 256,
        "conv2d_9": 147584,
        "dropout_6": 0,
        "dropout_24": 0,
        "conv2d_16": 590080,
        "dropout_27": 0,
        "batch_normalization_21": 1024,
        "conv2d_25": 2359808,
        "batch_normalization_1": 256,
        "conv2d_4": 36928,
        "activation_32": 0,
        "batch_normalization_2": 256,
        "dropout_8": 0,
        "batch_normalization_9": 512,
        "batch_normalization_35": 2048,
        "conv2d_35": 1049088,
        "conv2d_13": 147584,
        "activation_4": 0
    },
    "class_name": "Model",
    "keras_version": "2.2.2",
    "config": {
        "name": "model_1",
        "input_layers": [
            [
                "input_1",
                0,
                0
            ]
        ],
        "layers": [
            {
                "inbound_nodes": [],
                "name": "input_1",
                "class_name": "InputLayer",
                "config": {
                    "dtype": "float32",
                    "sparse": false,
                    "name": "input_1",
                    "batch_input_shape": [
                        null,
                        32,
                        32,
                        3
                    ]
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "input_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_1",
                "class_name": "Conv2D",
                "config": {
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "seed": null,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "scale": 2.0
                        }
                    },
                    "activation": "linear",
                    "kernel_regularizer": null,
                    "padding": "same",
                    "filters": 64,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "data_format": "channels_last",
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_constraint": null,
                    "kernel_constraint": null,
                    "trainable": true,
                    "name": "conv2d_1",
                    "strides": [
                        1,
                        1
                    ]
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "conv2d_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_1",
                "class_name": "BatchNormalization",
                "config": {
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null,
                    "gamma_regularizer": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "axis": -1,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "epsilon": 0.001,
                    "center": true,
                    "momentum": 0.99,
                    "trainable": true,
                    "name": "batch_normalization_1",
                    "scale": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_1",
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_1",
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "activation_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_2",
                "class_name": "Conv2D",
                "config": {
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "seed": null,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "scale": 2.0
                        }
                    },
                    "activation": "linear",
                    "kernel_regularizer": null,
                    "padding": "same",
                    "filters": 64,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "data_format": "channels_last",
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_constraint": null,
                    "kernel_constraint": null,
                    "trainable": true,
                    "name": "conv2d_2",
                    "strides": [
                        1,
                        1
                    ]
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "input_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_3",
                "class_name": "Conv2D",
                "config": {
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "seed": null,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "scale": 2.0
                        }
                    },
                    "activation": "linear",
                    "kernel_regularizer": null,
                    "padding": "same",
                    "filters": 64,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "data_format": "channels_last",
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_constraint": null,
                    "kernel_constraint": null,
                    "trainable": true,
                    "name": "conv2d_3",
                    "strides": [
                        1,
                        1
                    ]
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "conv2d_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_2",
                "class_name": "BatchNormalization",
                "config": {
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null,
                    "gamma_regularizer": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "axis": -1,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "epsilon": 0.001,
                    "center": true,
                    "momentum": 0.99,
                    "trainable": true,
                    "name": "batch_normalization_2",
                    "scale": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "conv2d_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_3",
                "class_name": "BatchNormalization",
                "config": {
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null,
                    "gamma_regularizer": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "axis": -1,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "epsilon": 0.001,
                    "center": true,
                    "momentum": 0.99,
                    "trainable": true,
                    "name": "batch_normalization_3",
                    "scale": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_2",
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_2",
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_3",
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_3",
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "activation_2",
                            0,
                            0,
                            {}
                        ],
                        [
                            "activation_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "join_layer_1",
                "class_name": "JoinLayer",
                "config": {
                    "name": "join_layer_1",
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "join_layer_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_4",
                "class_name": "Conv2D",
                "config": {
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "seed": null,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "scale": 2.0
                        }
                    },
                    "activation": "linear",
                    "kernel_regularizer": null,
                    "padding": "same",
                    "filters": 64,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "data_format": "channels_last",
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_constraint": null,
                    "kernel_constraint": null,
                    "trainable": true,
                    "name": "conv2d_4",
                    "strides": [
                        1,
                        1
                    ]
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "conv2d_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_4",
                "class_name": "BatchNormalization",
                "config": {
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null,
                    "gamma_regularizer": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "axis": -1,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "epsilon": 0.001,
                    "center": true,
                    "momentum": 0.99,
                    "trainable": true,
                    "name": "batch_normalization_4",
                    "scale": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_4",
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_4",
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "activation_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_5",
                "class_name": "Conv2D",
                "config": {
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "seed": null,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "scale": 2.0
                        }
                    },
                    "activation": "linear",
                    "kernel_regularizer": null,
                    "padding": "same",
                    "filters": 64,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "data_format": "channels_last",
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_constraint": null,
                    "kernel_constraint": null,
                    "trainable": true,
                    "name": "conv2d_5",
                    "strides": [
                        1,
                        1
                    ]
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "join_layer_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_6",
                "class_name": "Conv2D",
                "config": {
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "seed": null,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "scale": 2.0
                        }
                    },
                    "activation": "linear",
                    "kernel_regularizer": null,
                    "padding": "same",
                    "filters": 64,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "data_format": "channels_last",
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_constraint": null,
                    "kernel_constraint": null,
                    "trainable": true,
                    "name": "conv2d_6",
                    "strides": [
                        1,
                        1
                    ]
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "input_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_7",
                "class_name": "Conv2D",
                "config": {
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "seed": null,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "scale": 2.0
                        }
                    },
                    "activation": "linear",
                    "kernel_regularizer": null,
                    "padding": "same",
                    "filters": 64,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "data_format": "channels_last",
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_constraint": null,
                    "kernel_constraint": null,
                    "trainable": true,
                    "name": "conv2d_7",
                    "strides": [
                        1,
                        1
                    ]
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "conv2d_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_5",
                "class_name": "BatchNormalization",
                "config": {
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null,
                    "gamma_regularizer": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "axis": -1,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "epsilon": 0.001,
                    "center": true,
                    "momentum": 0.99,
                    "trainable": true,
                    "name": "batch_normalization_5",
                    "scale": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "conv2d_6",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_6",
                "class_name": "BatchNormalization",
                "config": {
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null,
                    "gamma_regularizer": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "axis": -1,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "epsilon": 0.001,
                    "center": true,
                    "momentum": 0.99,
                    "trainable": true,
                    "name": "batch_normalization_6",
                    "scale": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "conv2d_7",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_7",
                "class_name": "BatchNormalization",
                "config": {
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null,
                    "gamma_regularizer": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "axis": -1,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "epsilon": 0.001,
                    "center": true,
                    "momentum": 0.99,
                    "trainable": true,
                    "name": "batch_normalization_7",
                    "scale": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_5",
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_5",
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_6",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_6",
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_6",
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_7",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_7",
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_7",
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "activation_5",
                            0,
                            0,
                            {}
                        ],
                        [
                            "activation_6",
                            0,
                            0,
                            {}
                        ],
                        [
                            "activation_7",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "join_layer_2",
                "class_name": "JoinLayer",
                "config": {
                    "name": "join_layer_2",
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "join_layer_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "max_pooling2d_1",
                "class_name": "MaxPooling2D",
                "config": {
                    "data_format": "channels_last",
                    "padding": "valid",
                    "name": "max_pooling2d_1",
                    "trainable": true,
                    "pool_size": [
                        2,
                        2
                    ],
                    "strides": [
                        2,
                        2
                    ]
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_8",
                "class_name": "Conv2D",
                "config": {
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "seed": null,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "scale": 2.0
                        }
                    },
                    "activation": "linear",
                    "kernel_regularizer": null,
                    "padding": "same",
                    "filters": 128,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "data_format": "channels_last",
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_constraint": null,
                    "kernel_constraint": null,
                    "trainable": true,
                    "name": "conv2d_8",
                    "strides": [
                        1,
                        1
                    ]
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "conv2d_8",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dropout_1",
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_1",
                    "noise_shape": null,
                    "trainable": true,
                    "rate": 0.1,
                    "seed": null
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "dropout_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_8",
                "class_name": "BatchNormalization",
                "config": {
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null,
                    "gamma_regularizer": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "axis": -1,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "epsilon": 0.001,
                    "center": true,
                    "momentum": 0.99,
                    "trainable": true,
                    "name": "batch_normalization_8",
                    "scale": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_8",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_8",
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_8",
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "activation_8",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_9",
                "class_name": "Conv2D",
                "config": {
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "seed": null,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "scale": 2.0
                        }
                    },
                    "activation": "linear",
                    "kernel_regularizer": null,
                    "padding": "same",
                    "filters": 128,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "data_format": "channels_last",
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_constraint": null,
                    "kernel_constraint": null,
                    "trainable": true,
                    "name": "conv2d_9",
                    "strides": [
                        1,
                        1
                    ]
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_10",
                "class_name": "Conv2D",
                "config": {
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "seed": null,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "scale": 2.0
                        }
                    },
                    "activation": "linear",
                    "kernel_regularizer": null,
                    "padding": "same",
                    "filters": 128,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "data_format": "channels_last",
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_constraint": null,
                    "kernel_constraint": null,
                    "trainable": true,
                    "name": "conv2d_10",
                    "strides": [
                        1,
                        1
                    ]
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "conv2d_9",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dropout_2",
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_2",
                    "noise_shape": null,
                    "trainable": true,
                    "rate": 0.1,
                    "seed": null
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "conv2d_10",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dropout_3",
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_3",
                    "noise_shape": null,
                    "trainable": true,
                    "rate": 0.1,
                    "seed": null
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "dropout_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_9",
                "class_name": "BatchNormalization",
                "config": {
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null,
                    "gamma_regularizer": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "axis": -1,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "epsilon": 0.001,
                    "center": true,
                    "momentum": 0.99,
                    "trainable": true,
                    "name": "batch_normalization_9",
                    "scale": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "dropout_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_10",
                "class_name": "BatchNormalization",
                "config": {
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null,
                    "gamma_regularizer": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "axis": -1,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "epsilon": 0.001,
                    "center": true,
                    "momentum": 0.99,
                    "trainable": true,
                    "name": "batch_normalization_10",
                    "scale": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_9",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_9",
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_9",
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_10",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_10",
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_10",
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "activation_9",
                            0,
                            0,
                            {}
                        ],
                        [
                            "activation_10",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "join_layer_3",
                "class_name": "JoinLayer",
                "config": {
                    "name": "join_layer_3",
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "join_layer_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_11",
                "class_name": "Conv2D",
                "config": {
