{"class_name": "Model", "params": {"separable_conv_2_normal_left2_11": 35376, "normal_add_2_1": 0, "activation_87": 0, "activation_56": 0, "reduction_conv_1_stem_1": 352, "separable_conv_1_bn_reduction_right2_stem_2": 88, "separable_conv_1_bn_normal_left2_2": 176, "separable_conv_2_normal_left5_2": 2332, "separable_conv_2_bn_normal_left5_5": 352, "separable_conv_1_bn_normal_left1_8": 352, "reduction_left2_reduce_4": 0, "separable_conv_1_normal_right2_6": 8536, "separable_conv_2_normal_right2_6": 8536, "activation_29": 0, "separable_conv_2_normal_right2_1": 2332, "normal_add_5_7": 0, "normal_left4_7": 0, "normal_add_3_11": 0, "separable_conv_2_reduction_left1_stem_2": 1034, "normal_bn_1_11": 704, "activation_85": 0, "normal_conv_1_9": 123904, "activation_57": 0, "separable_conv_2_bn_normal_left2_0": 176, "stem_bn1": 128, "activation_23": 0, "separable_conv_2_bn_normal_left2_9": 704, "activation_112": 0, "normal_add_2_10": 0, "activation_79": 0, "normal_add_5_11": 0, "reduction_add_1_reduce_4": 0, "activation_168": 0, "reduction_conv_1_reduce_4": 23232, "normal_add_5_12": 0, "reduction_left2_stem_2": 0, "separable_conv_1_normal_right1_2": 2332, "separable_conv_2_bn_normal_left1_2": 176, "reduction_left2_stem_1": 0, "activation_11": 0, "separable_conv_1_bn_reduction_left4_reduce_8": 704, "separable_conv_2_bn_reduction_left1_stem_2": 88, "separable_conv_2_normal_left5_12": 32560, "separable_conv_1_normal_left1_0": 3036, "separable_conv_2_reduction_left4_stem_1": 220, "activation_121": 0, "activation_143": 0, "activation_16": 0, "activation_47": 0, "normal_right4_3": 0, "activation_126": 0, "separable_conv_2_normal_left1_3": 3036, "activation_105": 0, "separable_conv_2_bn_reduction_right1_reduce_4": 352, "separable_conv_1_bn_normal_left2_3": 176, "normal_bn_1_12": 704, "separable_conv_2_normal_left2_10": 35376, "normal_add_1_3": 0, "separable_conv_1_bn_normal_left5_2": 176, "reduction_concat_reduce_4": 0, "separable_conv_2_bn_normal_right1_9": 704, "activation_36": 0, "normal_left3_6": 0, "normal_conv_1_3": 11616, "separable_conv_1_normal_left2_7": 9944, "separable_conv_1_bn_normal_left5_9": 704, "separable_conv_2_normal_left5_8": 8536, "activation_39": 0, "separable_conv_1_bn_reduction_right1_stem_2": 88, "activation_171": 0, "separable_conv_2_normal_left2_7": 9944, "separable_conv_2_bn_normal_right2_11": 704, "separable_conv_2_bn_normal_left1_3": 176, "activation_69": 0, "separable_conv_1_reduction_left4_stem_2": 682, "separable_conv_1_bn_normal_left5_1": 176, "normal_left4_0": 0, "activation_104": 0, "separable_conv_2_reduction_left1_stem_1": 396, "activation_186": 0, "separable_conv_2_bn_normal_right1_3": 176, "normal_conv_1_2": 11616, "separable_conv_2_normal_left5_6": 8536, "separable_conv_1_bn_normal_left5_10": 704, "separable_conv_2_bn_reduction_left4_reduce_4": 352, "activation_45": 0, "separable_conv_1_bn_reduction_left1_reduce_4": 352, "normal_bn_1_10": 704, "separable_conv_2_bn_normal_left1_9": 704, "separable_conv_1_bn_reduction_right3_reduce_8": 704, "separable_conv_2_bn_normal_left1_12": 704, "activation_107": 0, "separable_conv_1_bn_reduction_right1_reduce_4": 352, "reduction_right5_stem_2": 0, "separable_conv_2_normal_right1_11": 32560, "activation_134": 0, "activation_173": 0, "separable_conv_2_bn_normal_right2_3": 176, "normal_add_5_3": 0, "separable_conv_1_bn_normal_right2_2": 176, "separable_conv_1_bn_normal_left5_3": 176, "normal_concat_2": 0, "activation_73": 0, "reduction_add_1_reduce_8": 0, "reduction_bn_1_stem_1": 44, "separable_conv_1_bn_reduction_left1_stem_2": 88, "activation_97": 0, "separable_conv_1_normal_right2_10": 32560, "reduction_conv_1_reduce_8": 92928, "activation_155": 0, "activation_123": 0, "separable_conv_1_normal_right1_7": 8536, "separable_conv_1_bn_normal_left5_6": 352, "separable_conv_2_reduction_right1_reduce_8": 39600, "activation_130": 0, "separable_conv_2_bn_normal_left1_11": 704, "normal_add_1_8": 0, "normal_add_4_0": 0, "activation_95": 0, "normal_add_1_9": 0, "separable_conv_1_bn_normal_right1_1": 176, "separable_conv_2_normal_right1_3": 2332, "activation_120": 0, "activation_22": 0, "activation_131": 0, "normal_concat_8": 0, "adjust_relu_1_stem_2": 0, "separable_conv_2_bn_normal_left1_10": 704, "normal_left3_0": 0, "activation_152": 0, "separable_conv_2_reduction_right1_reduce_4": 12056, "add_3": 0, "normal_add_2_3": 0, "adjust_relu_1_5": 0, "separable_conv_2_bn_normal_right1_5": 352, "adjust_conv_1_5": 11616, "separable_conv_1_bn_normal_left2_8": 352, "normal_left3_11": 0, "activation_136": 0, "separable_conv_1_normal_right2_3": 2332, "normal_add_5_0": 0, "activation_74": 0, "separable_conv_1_bn_reduction_left1_stem_1": 44, "normal_right4_9": 0, "activation_160": 0, "separable_conv_2_reduction_right3_reduce_8": 35376, "activation_106": 0, "add_2": 0, "separable_conv_2_normal_left2_6": 9944, "separable_conv_1_bn_normal_right1_0": 176, "activation_172": 0, "normal_left4_1": 0, "normal_left3_7": 0, "separable_conv_1_reduction_right1_stem_2": 1562, "separable_conv_1_bn_normal_left2_10": 704, "activation_94": 0, "activation_148": 0, "separable_conv_2_reduction_right2_reduce_8": 39600, "activation_70": 0, "separable_conv_2_normal_left5_0": 2332, "separable_conv_1_bn_normal_left2_5": 352, "activation_2": 0, "reduction_left4_reduce_4": 0, "normal_add_1_12": 0, "separable_conv_2_bn_normal_right2_10": 704, "normal_add_3_12": 0, "activation_31": 0, "adjust_conv_projection_1": 3872, "activation_44": 0, "separable_conv_1_normal_left2_0": 3036, "separable_conv_2_bn_reduction_left1_reduce_4": 352, "adjust_bn_5": 352, "normal_add_2_7": 0, "separable_conv_2_bn_reduction_left4_stem_1": 44, "separable_conv_2_normal_right1_10": 32560, "separable_conv_2_normal_right2_0": 2332, "activation_86": 0, "normal_conv_1_0": 3872, "activation_92": 0, "normal_add_4_9": 0, "separable_conv_2_normal_right1_2": 2332, "normal_left4_6": 0, "separable_conv_1_normal_left2_3": 3036, "activation_21": 0, "separable_conv_1_normal_left2_9": 35376, "normal_add_5_8": 0, "separable_conv_1_normal_left1_9": 35376, "adjust_bn_reduce_4": 352, "separable_conv_2_normal_right1_12": 32560, "separable_conv_2_normal_right1_1": 2332, "separable_conv_2_bn_normal_right1_1": 176, "separable_conv_2_bn_normal_right2_2": 176, "activation_102": 0, "activation_76": 0, "activation_99": 0, "adjust_conv_projection_3": 11616, "normal_add_1_5": 0, "separable_conv_1_normal_right1_6": 8536, "separable_conv_2_normal_left2_5": 9944, "separable_conv_1_reduction_right3_reduce_8": 35376, "normal_add_2_6": 0, "activation_40": 0, "reduction_right5_reduce_4": 0, "activation_72": 0, "adjust_relu_1_9": 0, "activation_110": 0, "activation_122": 0, "separable_conv_1_normal_right1_11": 32560, "separable_conv_2_normal_left1_8": 9944, "separable_conv_1_normal_left5_12": 32560, "separable_conv_1_bn_normal_left2_11": 704, "concatenate_4": 0, "reduction_add3_stem_2": 0, "activation_163": 0, "adjust_bn_3": 176, "activation_183": 0, "activation_90": 0, "separable_conv_2_reduction_right2_reduce_4": 12056, "activation_38": 0, "reduction_add_2_reduce_4": 0, "separable_conv_2_bn_reduction_left1_stem_1": 44, "separable_conv_2_normal_left1_11": 35376, "normal_bn_1_6": 352, "activation_164": 0, "separable_conv_1_bn_normal_right2_9": 704, "activation_30": 0, "activation_101": 0, "normal_concat_9": 0, "separable_conv_1_bn_normal_left2_7": 352, "separable_conv_1_bn_reduction_right2_reduce_4": 352, "normal_bn_1_7": 352, "activation_19": 0, "separable_conv_2_normal_right1_9": 32560, "activation_170": 0, "separable_conv_1_normal_right1_9": 32560, "activation_100": 0, "activation_62": 0, "activation_75": 0, "normal_right4_7": 0, "activation_109": 0, "separable_conv_1_normal_left2_5": 9944, "normal_conv_1_5": 30976, "separable_conv_1_normal_left5_8": 8536, "separable_conv_2_normal_left5_11": 32560, "normal_conv_1_1": 11616, "separable_conv_1_reduction_left1_stem_2": 1034, "separable_conv_1_bn_normal_left5_12": 704, "separable_conv_1_normal_left2_6": 9944, "separable_conv_1_bn_reduction_right3_stem_1": 44, "separable_conv_2_bn_normal_left5_9": 704, "normal_add_5_9": 0, "activation_28": 0, "adjust_avg_pool_1_stem_2": 0, "normal_add_4_1": 0, "activation_1": 0, "normal_add_2_5": 0, "separable_conv_2_bn_reduction_right2_reduce_8": 704, "separable_conv_2_normal_right1_5": 8536, "separable_conv_1_normal_right1_8": 8536, "separable_conv_2_reduction_left4_reduce_8": 32560, "normal_add_2_2": 0, "separable_conv_1_normal_left2_8": 9944, "separable_conv_2_normal_left2_3": 3036, "separable_conv_2_bn_normal_left2_12": 704, "normal_conv_1_10": 185856, "adjust_conv_projection_11": 185856, "normal_add_5_6": 0, "separable_conv_1_normal_right2_2": 2332, "activation_65": 0, "separable_conv_1_reduction_right2_stem_1": 1920, "reduction_add_2_stem_1": 0, "activation_176": 0, "separable_conv_1_bn_normal_left5_7": 352, "separable_conv_1_bn_reduction_right1_reduce_8": 704, "activation_117": 0, "activation_43": 0, "normal_left4_3": 0, "normal_left3_9": 0, "activation_41": 0, "adjust_conv_projection_8": 46464, "separable_conv_1_normal_right1_3": 2332, "separable_conv_2_normal_left1_9": 35376, "separable_conv_2_bn_normal_right2_0": 176, "separable_conv_1_normal_left1_11": 35376, "normal_add_4_6": 0, "normal_bn_1_5": 352, "separable_conv_2_normal_left5_3": 2332, "separable_conv_2_bn_normal_right2_8": 352, "normal_right4_10": 0, "activation_182": 0, "activation_175": 0, "normal_bn_1_9": 704, "separable_conv_1_normal_left2_2": 3036, "input_1": 0, "adjust_conv_1_9": 46464, "separable_conv_1_bn_normal_right2_11": 704, "separable_conv_1_normal_left1_5": 9944, "adjust_bn_9": 704, "separable_conv_2_bn_normal_left5_6": 352, "separable_conv_2_bn_normal_left2_1": 176, "activation_125": 0, "separable_conv_1_normal_left5_5": 8536, "activation_169": 0, "separable_conv_1_bn_normal_left1_3": 176, "separable_conv_1_bn_normal_left1_0": 176, "normal_add_1_6": 0, "activation_66": 0, "separable_conv_2_normal_right2_8": 8536, "activation_25": 0, "normal_left4_11": 0, "reduction_add_2_stem_2": 0, "separable_conv_2_normal_left2_0": 3036, "separable_conv_1_bn_normal_right2_6": 352, "separable_conv_2_normal_right2_5": 8536, "activation_37": 0, "adjust_conv_projection_reduce_8": 92928, "adjust_avg_pool_1_5": 0, "activation_52": 0, "adjust_bn_2": 176, "activation_153": 0, "separable_conv_1_reduction_right2_reduce_8": 39600, "normal_add_1_7": 0, "normal_conv_1_11": 185856, "adjust_bn_1": 176, "activation_108": 0, "normal_bn_1_2": 176, "separable_conv_2_normal_left1_7": 9944, "activation_132": 0, "separable_conv_1_normal_left1_1": 3036, "reduction_left4_reduce_8": 0, "activation_68": 0, "separable_conv_1_bn_normal_left2_9": 704, "separable_conv_2_normal_right2_11": 32560, "separable_conv_1_bn_normal_right1_12": 704, "activation_166": 0, "separable_conv_1_bn_normal_left5_0": 176, "normal_add_4_12": 0, "activation_5": 0, "activation_24": 0, "normal_add_1_0": 0, "normal_add_3_7": 0, "separable_conv_1_normal_right1_0": 2332, "normal_right4_1": 0, "reduction_concat_reduce_8": 0, "separable_conv_1_reduction_right3_stem_1": 1152, "normal_add_5_5": 0, "concatenate_2": 0, "activation_35": 0, "normal_add_4_3": 0, "activation_158": 0, "normal_conv_1_6": 46464, "activation_55": 0, "separable_conv_2_bn_normal_left5_10": 704, "normal_left3_12": 0, "separable_conv_2_bn_reduction_right1_stem_1": 44, "activation_157": 0, "normal_add_1_10": 0, "separable_conv_2_bn_normal_right1_0": 176, "separable_conv_1_bn_normal_right2_7": 352, "normal_left3_10": 0, "reduction_add3_reduce_8": 0, "separable_conv_1_bn_normal_right2_5": 352, "normal_left3_3": 0, "separable_conv_1_normal_left5_3": 2332, "adjust_bn_10": 704, "separable_conv_2_normal_right2_9": 32560, "activation_58": 0, "normal_right4_5": 0, "activation_139": 0, "separable_conv_2_reduction_left1_reduce_8": 35376, "normal_left3_1": 0, "normal_right4_12": 0, "normal_concat_7": 0, "separable_conv_1_normal_left1_7": 9944, "adjust_relu_1_0": 0, "activation_50": 0, "activation_124": 0, "normal_concat_6": 0, "activation_119": 0, "separable_conv_1_bn_reduction_right3_reduce_4": 352, "separable_conv_2_normal_right1_8": 8536, "adjust_conv_2_stem_2": 352, "separable_conv_1_bn_reduction_left4_reduce_4": 352, "separable_conv_1_bn_normal_left1_1": 176, "separable_conv_2_bn_normal_left2_8": 352, "reduction_add_1_stem_1": 0, "normal_conv_1_12": 185856, "separable_conv_1_bn_normal_right1_8": 352, "separable_conv_1_bn_reduction_left4_stem_2": 88, "activation_18": 0, "separable_conv_1_bn_normal_left1_5": 352, "activation_26": 0, "separable_conv_1_bn_reduction_right2_reduce_8": 704, "zero_padding2d_3": 0, "reduction_add_2_reduce_8": 0, "adjust_avg_pool_1_9": 0, "activation_48": 0, "normal_concat_1": 0, "activation_78": 0, "separable_conv_2_bn_normal_left1_6": 352, "adjust_avg_pool_2_9": 0, "separable_conv_1_bn_normal_left1_12": 704, "separable_conv_2_reduction_left4_reduce_4": 8536, "adjust_conv_projection_reduce_4": 23232, "separable_conv_1_bn_normal_right1_10": 704, "separable_conv_2_bn_reduction_right1_stem_2": 88, "activation_33": 0, "separable_conv_1_normal_right2_5": 8536, "activation_184": 0, "activation_32": 0, "normal_add_2_0": 0, "separable_conv_1_reduction_left4_reduce_8": 32560, "normal_add_5_2": 0, "adjust_avg_pool_2_0": 0, "separable_conv_2_normal_left2_8": 9944, "separable_conv_1_bn_normal_right2_0": 176, "normal_left4_10": 0, "separable_conv_1_bn_normal_left5_11": 704, "separable_conv_1_normal_left2_11": 35376, "activation_156": 0, "activation_51": 0, "activation_127": 0, "cropping2d_1": 0, "separable_conv_1_normal_right2_7": 8536, "separable_conv_1_normal_left5_6": 8536, "adjust_conv_projection_12": 185856, "activation_114": 0, "separable_conv_2_reduction_right1_stem_2": 1562, "separable_conv_2_reduction_left4_stem_2": 682, "activation_137": 0, "separable_conv_2_bn_normal_left1_1": 176, "normal_add_4_10": 0, "activation_13": 0, "normal_bn_1_0": 176, "normal_concat_10": 0, "separable_conv_2_normal_right2_3": 2332, "separable_conv_2_normal_right1_7": 8536, "separable_conv_2_normal_right2_12": 32560, "separable_conv_1_normal_left1_10": 35376, "activation_6": 0, "activation_49": 0, "adjust_bn_reduce_8": 704, "normal_add_2_12": 0, "reduction_add4_stem_2": 0, "normal_add_1_11": 0, "separable_conv_1_normal_left1_6": 9944, "normal_left3_5": 0, "separable_conv_2_bn_reduction_right3_stem_2": 88, "normal_add_4_5": 0, "activation_54": 0, "normal_left3_8": 0, "separable_conv_1_bn_normal_left1_11": 704, "adjust_avg_pool_1_0": 0, "add_1": 0, "adjust_bn_8": 352, "normal_concat_0": 0, "separable_conv_2_bn_normal_left5_3": 176, "global_average_pooling2d_1": 0, "normal_left4_5": 0, "separable_conv_1_reduction_right1_stem_1": 1920, "normal_add_3_2": 0, "separable_conv_2_bn_normal_right2_6": 352, "adjust_conv_projection_6": 30976, "add_4": 0, "separable_conv_1_normal_left5_1": 2332, "separable_conv_2_normal_left1_10": 35376, "separable_conv_2_normal_left5_9": 32560, "separable_conv_2_normal_left2_12": 35376, "separable_conv_1_bn_normal_right1_5": 352, "separable_conv_1_bn_normal_right1_3": 176, "separable_conv_1_normal_left1_3": 3036, "activation_149": 0, "adjust_conv_projection_10": 123904, "normal_add_1_2": 0, "activation_116": 0, "cropping2d_3": 0, "separable_conv_1_normal_left2_1": 3036, "separable_conv_1_bn_normal_right2_1": 176, "activation_12": 0, "normal_right4_6": 0, "adjust_bn_12": 704, "adjust_bn_6": 352, "normal_add_5_10": 0, "normal_add_3_10": 0, "normal_add_3_8": 0, "separable_conv_2_bn_reduction_right1_reduce_8": 704, "separable_conv_1_normal_right1_5": 8536, "reduction_add4_stem_1": 0, "reduction_bn_1_reduce_4": 352, "separable_conv_2_reduction_right3_reduce_4": 9944, "activation_98": 0, "reduction_left2_reduce_8": 0, "normal_concat_11": 0, "separable_conv_1_normal_right2_12": 32560, "activation_111": 0, "normal_add_1_1": 0, "activation_96": 0, "separable_conv_1_normal_left2_10": 35376, "separable_conv_1_bn_reduction_right3_stem_2": 88, "separable_conv_2_bn_normal_left2_6": 352, "activation_188": 0, "zero_padding2d_2": 0, "stem_conv1": 864, "reduction_bn_1_reduce_8": 704, "activation_93": 0, "separable_conv_2_bn_reduction_right2_stem_2": 88, "adjust_conv_projection_2": 11616, "separable_conv_1_bn_normal_right1_9": 704, "normal_concat_12": 0, "activation_146": 0, "activation_165": 0, "normal_left4_12": 0, "separable_conv_1_reduction_left1_reduce_8": 35376, "adjust_bn_7": 352, "activation_174": 0, "activation_178": 0, "normal_add_4_8": 0, "activation_142": 0, "separable_conv_2_normal_right2_7": 8536, "activation_181": 0, "normal_conv_1_7": 46464, "separable_conv_2_normal_left1_0": 3036, "separable_conv_2_bn_reduction_left4_reduce_8": 704, "separable_conv_2_bn_normal_left2_11": 704, "separable_conv_2_bn_normal_left5_7": 352, "separable_conv_1_bn_normal_left2_12": 704, "separable_conv_2_bn_normal_right2_1": 176, "separable_conv_2_bn_normal_right1_7": 352, "separable_conv_1_bn_normal_left5_8": 352, "separable_conv_1_bn_normal_right1_7": 352, "separable_conv_2_bn_reduction_left1_reduce_8": 704, "separable_conv_2_bn_normal_left5_8": 352, "reduction_bn_1_stem_2": 88, "normal_add_4_2": 0, "activation_179": 0, "separable_conv_1_normal_left5_2": 2332, "normal_bn_1_1": 176, "normal_add_3_5": 0, "activation_27": 0, "activation_4": 0, "activation_113": 0, "separable_conv_2_bn_normal_left2_7": 352, "separable_conv_1_normal_left1_12": 35376, "separable_conv_2_reduction_right1_stem_1": 660, "separable_conv_2_bn_normal_right1_6": 352, "separable_conv_2_normal_left5_1": 2332, "separable_conv_1_bn_normal_left1_6": 352, "activation_167": 0, "zero_padding2d_1": 0, "separable_conv_2_bn_reduction_right3_stem_1": 44, "cropping2d_4": 0, "separable_conv_2_bn_normal_right2_5": 352, "separable_conv_1_bn_normal_right2_12": 704, "activation_7": 0, "separable_conv_1_bn_normal_left1_9": 704, "separable_conv_1_normal_right2_1": 2332, "separable_conv_1_reduction_right3_reduce_4": 9944, "separable_conv_1_bn_normal_right1_11": 704, "separable_conv_1_normal_left1_2": 3036, "separable_conv_2_bn_normal_right1_2": 176, "separable_conv_2_bn_normal_left2_10": 704, "separable_conv_2_normal_left5_10": 32560, "separable_conv_1_normal_left5_11": 32560, "activation_147": 0, "separable_conv_1_bn_normal_left1_7": 352, "separable_conv_2_bn_normal_right1_11": 704, "separable_conv_2_normal_left2_2": 3036, "activation_82": 0, "activation_20": 0, "activation_162": 0, "separable_conv_1_bn_reduction_right1_stem_1": 44, "separable_conv_2_normal_left1_5": 9944, "activation_60": 0, "adjust_avg_pool_2_5": 0, "adjust_conv_2_9": 46464, "normal_left4_8": 0, "separable_conv_1_bn_reduction_left1_reduce_8": 704, "separable_conv_2_bn_reduction_left4_stem_2": 88, "activation_150": 0, "adjust_conv_projection_7": 46464, "activation_84": 0, "separable_conv_1_normal_left5_7": 8536, "separable_conv_2_bn_reduction_right3_reduce_8": 704, "normal_right4_0": 0, "separable_conv_2_bn_reduction_right3_reduce_4": 352, "reduction_concat_stem_2": 0, "activation_161": 0, "activation_118": 0, "activation_144": 0, "activation_77": 0, "separable_conv_2_bn_normal_left5_11": 704, "activation_91": 0, "concatenate_1": 0, "normal_right4_11": 0, "normal_add_2_11": 0, "separable_conv_1_bn_normal_left1_2": 176, "separable_conv_2_reduction_left1_reduce_4": 9944, "activation_17": 0, "normal_concat_3": 0, "reduction_left4_stem_1": 0, "normal_bn_1_8": 352, "activation_138": 0, "separable_conv_2_normal_right2_10": 32560, "activation_42": 0, "adjust_avg_pool_2_stem_2": 0, "reduction_conv_1_stem_2": 968, "normal_left4_9": 0, "adjust_bn_0": 176, "separable_conv_2_normal_left1_2": 3036, "reduction_left3_stem_1": 0, "cropping2d_2": 0, "normal_left3_2": 0, "separable_conv_2_bn_normal_left5_0": 176, "reduction_right5_reduce_8": 0, "adjust_bn_stem_2": 88, "activation_151": 0, "separable_conv_1_reduction_left1_reduce_4": 9944, "activation_81": 0, "separable_conv_2_bn_normal_left5_1": 176, "reduction_left4_stem_2": 0, "separable_conv_1_normal_left1_8": 9944, "separable_conv_1_bn_normal_right1_2": 176, "normal_add_3_0": 0, "separable_conv_2_reduction_right2_stem_1": 660, "separable_conv_2_bn_normal_right2_7": 352, "separable_conv_1_bn_normal_right2_8": 352, "separable_conv_2_normal_left2_1": 3036, "separable_conv_1_normal_right1_12": 32560, "activation_3": 0, "activation_135": 0, "separable_conv_2_normal_left2_9": 35376, "activation_89": 0, "separable_conv_2_normal_right2_2": 2332, "separable_conv_2_bn_reduction_right2_stem_1": 44, "separable_conv_1_bn_normal_right2_10": 704, "normal_add_5_1": 0, "separable_conv_2_normal_left5_7": 8536, "separable_conv_2_bn_normal_right1_10": 704, "activation_133": 0, "separable_conv_1_normal_left5_10": 32560, "normal_add_3_6": 0, "separable_conv_1_bn_normal_left2_6": 352, "separable_conv_1_bn_reduction_left4_stem_1": 44, "separable_conv_1_normal_right2_8": 8536, "activation_67": 0, "reduction_add3_stem_1": 0, "reduction_right5_stem_1": 0, "activation_83": 0, "activation_140": 0, "activation_103": 0, "reduction_concat_stem_1": 0, "activation_71": 0, "separable_conv_1_bn_normal_left1_10": 704, "separable_conv_1_normal_right2_9": 32560, "normal_add_2_8": 0, "separable_conv_1_normal_right2_11": 32560, "reduction_left3_stem_2": 0, "separable_conv_1_normal_right1_10": 32560, "separable_conv_2_bn_normal_left2_2": 176, "separable_conv_1_bn_normal_right2_3": 176, "normal_add_4_7": 0, "activation_14": 0, "normal_right4_2": 0, "separable_conv_2_bn_normal_left5_12": 704, "separable_conv_2_normal_left1_1": 3036, "separable_conv_2_bn_normal_left1_5": 352, "activation_10": 0, "normal_left4_2": 0, "separable_conv_1_normal_right2_0": 2332, "adjust_conv_2_5": 11616, "separable_conv_1_reduction_right3_stem_2": 1034, "separable_conv_1_reduction_right1_reduce_8": 39600, "separable_conv_1_reduction_right2_reduce_4": 12056, "activation_63": 0, "normal_add_3_3": 0, "activation_53": 0, "activation_61": 0, "separable_conv_2_bn_reduction_right2_reduce_4": 352, "separable_conv_2_normal_right1_6": 8536, "separable_conv_2_bn_normal_left1_7": 352, "activation_34": 0, "activation_154": 0, "activation_185": 0, "separable_conv_2_bn_normal_left2_5": 352, "adjust_bn_11": 704, "activation_180": 0, "separable_conv_2_bn_normal_left1_8": 352, "normal_add_4_11": 0, "activation_59": 0, "activation_177": 0, "normal_add_3_1": 0, "reduction_left3_reduce_4": 0, "separable_conv_1_normal_left5_0": 2332, "normal_bn_1_3": 176, "separable_conv_1_reduction_left4_stem_1": 220, "normal_add_2_9": 0, "reduction_add4_reduce_4": 0, "separable_conv_2_reduction_right2_stem_2": 1562, "separable_conv_1_normal_left2_12": 35376, "normal_add_3_9": 0, "reduction_add_1_stem_2": 0, "activation_15": 0, "activation_115": 0, "separable_conv_1_bn_normal_left2_1": 176, "separable_conv_1_reduction_left4_reduce_4": 8536, "reduction_left3_reduce_8": 0, "activation_145": 0, "activation_141": 0, "separable_conv_1_reduction_right2_stem_2": 1562, "separable_conv_2_bn_normal_right1_8": 352, "separable_conv_1_bn_reduction_right2_stem_1": 44, "separable_conv_1_normal_left5_9": 32560, "activation_46": 0, "adjust_conv_1_stem_2": 352, "reduction_add4_reduce_8": 0, "concatenate_3": 0, "activation_9": 0, "separable_conv_1_reduction_right1_reduce_4": 12056, "separable_conv_2_bn_normal_right2_9": 704, "separable_conv_2_normal_left1_6": 9944, "separable_conv_1_reduction_left1_stem_1": 396, "activation_8": 0, "separable_conv_2_reduction_right3_stem_2": 1034, "separable_conv_2_normal_right1_0": 2332, "separable_conv_1_bn_normal_right1_6": 352, "activation_128": 0, "normal_right4_8": 0, "activation_80": 0, "activation_88": 0, "separable_conv_2_bn_normal_left1_0": 176, "adjust_conv_2_0": 968, "separable_conv_2_bn_normal_right1_12": 704, "activation_187": 0, "normal_conv_1_8": 46464, "separable_conv_1_bn_normal_left5_5": 352, "activation_64": 0, "adjust_conv_1_0": 968, "separable_conv_2_bn_normal_left2_3": 176, "separable_conv_2_reduction_right3_stem_1": 396, "separable_conv_2_bn_normal_right2_12": 704, "separable_conv_1_normal_right1_1": 2332, "separable_conv_2_normal_left1_12": 35376, "activation_129": 0, "separable_conv_1_bn_normal_left2_0": 176, "reduction_add3_reduce_4": 0, "activation_159": 0, "predictions": 1057000, "separable_conv_2_normal_left5_5": 8536, "normal_concat_5": 0, "zero_padding2d_4": 0, "separable_conv_2_bn_normal_left5_2": 176}, "backend": "tensorflow", "config": {"name": "NASNet", "output_layers": [["predictions", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "name": "input_1", "sparse": false, "dtype": "float32"}}, {"name": "stem_conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "trainable": true, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "activity_regularizer": null, "use_bias": false, "strides": [2, 2], "name": "stem_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "bias_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last"}}, {"name": "stem_bn1", "inbound_nodes": [[["stem_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "stem_bn1", "center": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9997, "axis": -1, "scale": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "activation_1", "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"name": "reduction_conv_1_stem_1", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "trainable": true, "filters": 11, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "activity_regularizer": null, "use_bias": false, "strides": [1, 1], "name": "reduction_conv_1_stem_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "padding": "same", "bias_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last"}}, {"name": "reduction_bn_1_stem_1", "inbound_nodes": [[["reduction_conv_1_stem_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "reduction_bn_1_stem_1", "center": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9997, "axis": -1, "scale": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "activation_2", "inbound_nodes": [[["reduction_bn_1_stem_1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"name": "activation_4", "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"name": "separable_conv_1_reduction_left1_stem_1", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"bias_regularizer": null, "trainable": true, "filters": 11, "pointwise_regularizer": null, "strides": [2, 2], "activity_regularizer": null, "use_bias": false, "padding": "same", "depth_multiplier": 1, "kernel_size": [5, 5], "pointwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "separable_conv_1_reduction_left1_stem_1", "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "activation": "linear", "depthwise_constraint": null, "data_format": "channels_last"}}, {"name": "separable_conv_1_reduction_right1_stem_1", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"bias_regularizer": null, "trainable": true, "filters": 11, "pointwise_regularizer": null, "strides": [2, 2], "activity_regularizer": null, "use_bias": false, "padding": "same", "depth_multiplier": 1, "kernel_size": [7, 7], "pointwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "separable_conv_1_reduction_right1_stem_1", "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "activation": "linear", "depthwise_constraint": null, "data_format": "channels_last"}}, {"name": "separable_conv_1_bn_reduction_left1_stem_1", "inbound_nodes": [[["separable_conv_1_reduction_left1_stem_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "separable_conv_1_bn_reduction_left1_stem_1", "center": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9997, "axis": -1, "scale": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "separable_conv_1_bn_reduction_right1_stem_1", "inbound_nodes": [[["separable_conv_1_reduction_right1_stem_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "separable_conv_1_bn_reduction_right1_stem_1", "center": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9997, "axis": -1, "scale": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "activation_3", "inbound_nodes": [[["separable_conv_1_bn_reduction_left1_stem_1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"name": "activation_5", "inbound_nodes": [[["separable_conv_1_bn_reduction_right1_stem_1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"name": "separable_conv_2_reduction_left1_stem_1", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"bias_regularizer": null, "trainable": true, "filters": 11, "pointwise_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "use_bias": false, "padding": "same", "depth_multiplier": 1, "kernel_size": [5, 5], "pointwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "separable_conv_2_reduction_left1_stem_1", "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "activation": "linear", "depthwise_constraint": null, "data_format": "channels_last"}}, {"name": "separable_conv_2_reduction_right1_stem_1", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"bias_regularizer": null, "trainable": true, "filters": 11, "pointwise_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "use_bias": false, "padding": "same", "depth_multiplier": 1, "kernel_size": [7, 7], "pointwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "separable_conv_2_reduction_right1_stem_1", "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "activation": "linear", "depthwise_constraint": null, "data_format": "channels_last"}}, {"name": "separable_conv_2_bn_reduction_left1_stem_1", "inbound_nodes": [[["separable_conv_2_reduction_left1_stem_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "separable_conv_2_bn_reduction_left1_stem_1", "center": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9997, "axis": -1, "scale": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "separable_conv_2_bn_reduction_right1_stem_1", "inbound_nodes": [[["separable_conv_2_reduction_right1_stem_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "separable_conv_2_bn_reduction_right1_stem_1", "center": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9997, "axis": -1, "scale": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "activation_6", "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"name": "reduction_add_1_stem_1", "inbound_nodes": [[["separable_conv_2_bn_reduction_left1_stem_1", 0, 0, {}], ["separable_conv_2_bn_reduction_right1_stem_1", 0, 0, {}]]], "class_name": "Add", "config": {"name": "reduction_add_1_stem_1", "trainable": true}}, {"name": "separable_conv_1_reduction_right2_stem_1", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"bias_regularizer": null, "trainable": true, "filters": 11, "pointwise_regularizer": null, "strides": [2, 2], "activity_regularizer": null, "use_bias": false, "padding": "same", "depth_multiplier": 1, "kernel_size": [7, 7], "pointwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "separable_conv_1_reduction_right2_stem_1", "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "activation": "linear", "depthwise_constraint": null, "data_format": "channels_last"}}, {"name": "activation_8", "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}}, {"name": "activation_10", "inbound_nodes": [[["reduction_add_1_stem_1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "activation": "relu"}}, {"name": "separable_conv_1_bn_reduction_right2_stem_1", "inbound_nodes": [[["separable_conv_1_reduction_right2_stem_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "separable_conv_1_bn_reduction_right2_stem_1", "center": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9997, "axis": -1, "scale": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "separable_conv_1_reduction_right3_stem_1", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"bias_regularizer": null, "trainable": true, "filters": 11, "pointwise_regularizer": null, "strides": [2, 2], "activity_regularizer": null, "use_bias": false, "padding": "same", "depth_multiplier": 1, "kernel_size": [5, 5], "pointwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "separable_conv_1_reduction_right3_stem_1", "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "activation": "linear", "depthwise_constraint": null, "data_format": "channels_last"}}, {"name": "separable_conv_1_reduction_left4_stem_1", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"bias_regularizer": null, "trainable": true, "filters": 11, "pointwise_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "use_bias": false, "padding": "same", "depth_multiplier": 1, "kernel_size": [3, 3], "pointwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "separable_conv_1_reduction_left4_stem_1", "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "activation": "linear", "depthwise_constraint": null, "data_format": "channels_last"}}, {"name": "activation_7", "inbound_nodes": [[["separable_conv_1_bn_reduction_right2_stem_1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}}, {"name": "separable_conv_1_bn_reduction_right3_stem_1", "inbound_nodes": [[["separable_conv_1_reduction_right3_stem_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "separable_conv_1_bn_reduction_right3_stem_1", "center": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9997, "axis": -1, "scale": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "separable_conv_1_bn_reduction_left4_stem_1", "inbound_nodes": [[["separable_conv_1_reduction_left4_stem_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "separable_conv_1_bn_reduction_left4_stem_1", "center": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9997, "axis": -1, "scale": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "separable_conv_2_reduction_right2_stem_1", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"bias_regularizer": null, "trainable": true, "filters": 11, "pointwise_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "use_bias": false, "padding": "same", "depth_multiplier": 1, "kernel_size": [7, 7], "pointwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "separable_conv_2_reduction_right2_stem_1", "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "activation": "linear", "depthwise_constraint": null, "data_format": "channels_last"}}, {"name": "activation_9", "inbound_nodes": [[["separable_conv_1_bn_reduction_right3_stem_1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}}, {"name": "activation_11", "inbound_nodes": [[["separable_conv_1_bn_reduction_left4_stem_1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_11", "trainable": true, "activation": "relu"}}, {"name": "reduction_left2_stem_1", "inbound_nodes": [[["reduction_bn_1_stem_1", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "reduction_left2_stem_1", "trainable": true, "padding": "same", "strides": [2, 2], "data_format": "channels_last", "pool_size": [3, 3]}}, {"name": "separable_conv_2_bn_reduction_right2_stem_1", "inbound_nodes": [[["separable_conv_2_reduction_right2_stem_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "separable_conv_2_bn_reduction_right2_stem_1", "center": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9997, "axis": -1, "scale": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "separable_conv_2_reduction_right3_stem_1", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"bias_regularizer": null, "trainable": true, "filters": 11, "pointwise_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "use_bias": false, "padding": "same", "depth_multiplier": 1, "kernel_size": [5, 5], "pointwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "separable_conv_2_reduction_right3_stem_1", "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "activation": "linear", "depthwise_constraint": null, "data_format": "channels_last"}}, {"name": "separable_conv_2_reduction_left4_stem_1", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"bias_regularizer": null, "trainable": true, "filters": 11, "pointwise_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "use_bias": false, "padding": "same", "depth_multiplier": 1, "kernel_size": [3, 3], "pointwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "separable_conv_2_reduction_left4_stem_1", "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "activation": "linear", "depthwise_constraint": null, "data_format": "channels_last"}}, {"name": "adjust_relu_1_stem_2", "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "adjust_relu_1_stem_2", "trainable": true, "activation": "relu"}}, {"name": "reduction_add_2_stem_1", "inbound_nodes": [[["reduction_left2_stem_1", 0, 0, {}], ["separable_conv_2_bn_reduction_right2_stem_1", 0, 0, {}]]], "class_name": "Add", "config": {"name": "reduction_add_2_stem_1", "trainable": true}}, {"name": "reduction_left3_stem_1", "inbound_nodes": [[["reduction_bn_1_stem_1", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"name": "reduction_left3_stem_1", "trainable": true, "padding": "same", "strides": [2, 2], "data_format": "channels_last", "pool_size": [3, 3]}}, {"name": "separable_conv_2_bn_reduction_right3_stem_1", "inbound_nodes": [[["separable_conv_2_reduction_right3_stem_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "separable_conv_2_bn_reduction_right3_stem_1", "center": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9997, "axis": -1, "scale": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "reduction_left4_stem_1", "inbound_nodes": [[["reduction_add_1_stem_1", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"name": "reduction_left4_stem_1", "trainable": true, "padding": "same", "strides": [1, 1], "data_format": "channels_last", "pool_size": [3, 3]}}, {"name": "separable_conv_2_bn_reduction_left4_stem_1", "inbound_nodes": [[["separable_conv_2_reduction_left4_stem_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "separable_conv_2_bn_reduction_left4_stem_1", "center": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.9997, "axis": -1, "scale": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "reduction_right5_stem_1", "inbound_nodes": [[["reduction_bn_1_stem_1", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "reduction_right5_stem_1", "trainable": true, "padding": "same", "strides": [2, 2], "data_format": "channels_last", "pool_size": [3, 3]}}, {"name": "zero_padding2d_1", "inbound_nodes": [[["adjust_relu_1_stem_2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_1", "trainable": true, "data_format": "channels_last", "padding": [[0, 1], [0, 1]]}}, {"name": "reduction_add3_stem_1", "inbound_nodes": [[["reduction_left3_stem_1", 0, 0, {}], ["separable_conv_2_bn_reduction_right3_stem_1", 0, 0, {}]]], "class_name": "Add", "config": {"name": "reduction_add3_stem_1", "trainable": true}}, {"name": "add_1", "inbound_nodes": [[["reduction_add_2_stem_1", 0, 0, {}], ["reduction_left4_stem_1", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_1", "trainable": true}}, {"name": "reduction_add4_stem_1", "inbound_nodes": [[["separable_conv_2_bn_reduction_left4_stem_1", 0, 0, {}], ["reduction_right5_stem_1", 0, 0, {}]]], "class_name": "Add", "config": {"name": "reduction_add4_stem_1", "trainable": true}}, {"name": "cropping2d_1", "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]], "class_name": "Cropping2D", "config": {"name": "cropping2d_1", "trainable": true, "data_format": "channels_last", "cropping": [[1, 0], [1, 0]]}}, {"name": "reduction_concat_stem_1", "inbound_nodes": [[["reduction_add_2_stem_1", 0, 0, {}], ["reduction_add3_stem_1", 0, 0, {}], ["add_1", 0, 0, {}], ["reduction_add4_stem_1", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "reduction_concat_stem_1", "trainable": true, "axis": -1}}, {"name": "adjust_avg_pool_1_stem_2", "inbound_nodes": [[["adjust_relu_1_stem_2", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"name": "adjust_avg_pool_1_stem_2", "trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [1, 1]}}, {"name": "adjust_avg_pool_2_stem_2", "inbound_nodes": [[["cropping2d_1", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"name": "adjust_avg_pool_2_stem_2", "trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [1, 1]}}, {"name": "activation_12", "inbound_nodes": [[["reduction_concat_stem_1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_12", "trainable": true, "activation": "relu"}}, {"name": "adjust_conv_1_stem_2", "inbound_nodes": [[["adjust_avg_pool_1_stem_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "trainable": true, "filters": 11, 