{"class_name": "Model", "config": {"output_layers": [["fc1000", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 224, 224, 3], "sparse": false}}, {"name": "conv1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [7, 7], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv1", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "strides": [2, 2], "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"name": "bn_conv1", "class_name": "BatchNormalization", "inbound_nodes": [[["conv1", 0, 0, {}]]], "config": {"axis": 3, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "bn_conv1", "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true}}, {"name": "activation_1", "class_name": "Activation", "inbound_nodes": [[["bn_conv1", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"data_format": "channels_last", "padding": "valid", "pool_size": [3, 3], "trainable": true, "strides": [2, 2], "name": "max_pooling2d_1"}}, {"name": "res2a_branch2a", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [1, 1], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "res2a_branch2a", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "strides": [1, 1], "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"name": "bn2a_branch2a", "class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]], "config": {"axis": 3, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "bn2a_branch2a", "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true}}, {"name": "activation_2", "class_name": "Activation", "inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"name": "res2a_branch2b", "class_name": "Conv2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [3, 3], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "res2a_branch2b", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "strides": [1, 1], "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"name": "bn2a_branch2b", "class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]], "config": {"axis": 3, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "bn2a_branch2b", "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true}}, {"name": "activation_3", "class_name": "Activation", "inbound_nodes": [[["bn2a_branch2b", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"name": "res2a_branch2c", "class_name": "Conv2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [1, 1], "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "res2a_branch2c", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "strides": [1, 1], "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"name": "res2a_branch1", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [1, 1], "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "res2a_branch1", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "strides": [1, 1], "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"name": "bn2a_branch2c", "class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]], "config": {"axis": 3, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "bn2a_branch2c", "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true}}, {"name": "bn2a_branch1", "class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch1", 0, 0, {}]]], "config": {"axis": 3, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "bn2a_branch1", "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true}}, {"name": "add_1", "class_name": "Add", "inbound_nodes": [[["bn2a_branch2c", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]], "config": {"trainable": true, "name": "add_1"}}, {"name": "activation_4", "class_name": "Activation", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"name": "res2b_branch2a", "class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [1, 1], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "res2b_branch2a", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "strides": [1, 1], "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"name": "bn2b_branch2a", "class_name": "BatchNormalization", "inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]], "config": {"axis": 3, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "bn2b_branch2a", "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true}}, {"name": "activation_5", "class_name": "Activation", "inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_5"}}, {"name": "res2b_branch2b", "class_name": "Conv2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [3, 3], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "res2b_branch2b", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "strides": [1, 1], "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"name": "bn2b_branch2b", "class_name": "BatchNormalization", "inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]], "config": {"axis": 3, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "bn2b_branch2b", "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true}}, {"name": "activation_6", "class_name": "Activation", "inbound_nodes": [[["bn2b_branch2b", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_6"}}, {"name": "res2b_branch2c", "class_name": "Conv2D", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [1, 1], "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "res2b_branch2c", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "strides": [1, 1], "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"name": "bn2b_branch2c", "class_name": "BatchNormalization", "inbound_nodes": [[["res2b_branch2c", 0, 0, {}]]], "config": {"axis": 3, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "bn2b_branch2c", "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true}}, {"name": "add_2", "class_name": "Add", "inbound_nodes": [[["bn2b_branch2c", 0, 0, {}], ["activation_4", 0, 0, {}]]], "config": {"trainable": true, "name": "add_2"}}, {"name": "activation_7", "class_name": "Activation", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_7"}}, {"name": "res2c_branch2a", "class_name": "Conv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [1, 1], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "res2c_branch2a", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "strides": [1, 1], "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"name": "bn2c_branch2a", "class_name": "BatchNormalization", "inbound_nodes": [[["res2c_branch2a", 0, 0, {}]]], "config": {"axis": 3, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "bn2c_branch2a", "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true}}, {"name": "activation_8", "class_name": "Activation", "inbound_nodes": [[["bn2c_branch2a", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_8"}}, {"name": "res2c_branch2b", "class_name": "Conv2D", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [3, 3], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "res2c_branch2b", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "strides": [1, 1], "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"name": "bn2c_branch2b", "class_name": "BatchNormalization", "inbound_nodes": [[["res2c_branch2b", 0, 0, {}]]], "config": {"axis": 3, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "bn2c_branch2b", "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true}}, {"name": "activation_9", "class_name": "Activation", "inbound_nodes": [[["bn2c_branch2b", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_9"}}, {"name": "res2c_branch2c", "class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [1, 1], "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "res2c_branch2c", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "strides": [1, 1], "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"name": "bn2c_branch2c", "class_name": "BatchNormalization", "inbound_nodes": [[["res2c_branch2c", 0, 0, {}]]], "config": {"axis": 3, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "bn2c_branch2c", "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true}}, {"name": "add_3", "class_name": "Add", "inbound_nodes": [[["bn2c_branch2c", 0, 0, {}], ["activation_7", 0, 0, {}]]], "config": {"trainable": true, "name": "add_3"}}, {"name": "activation_10", "class_name": "Activation", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_10"}}, {"name": "res30_branch2a", "class_name": "Conv2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [1, 1], "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "res30_branch2a", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "strides": [2, 2], "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"name": "bn30_branch2a", "class_name": "BatchNormalization", "inbound_nodes": [[["res30_branch2a", 0, 0, {}]]], "config": {"axis": 3, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "bn30_branch2a", "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true}}, {"name": "activation_11", "class_name": "Activation", "inbound_nodes": [[["bn30_branch2a", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_11"}}, {"name": "res30_branch2b", "class_name": "Conv2D", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [3, 3], "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "res30_branch2b", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "strides": [1, 1], "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"name": "bn30_branch2b", "class_name": "BatchNormalization", "inbound_nodes": [[["res30_branch2b", 0, 0, {}]]], "config": {"axis": 3, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "bn30_branch2b", "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true}}, {"name": "activation_12", "class_name": "Activation", "inbound_nodes": [[["bn30_branch2b", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_12"}}, {"name": "res30_branch2c", "class_name": "Conv2D", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [1, 1], "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "res30_branch2c", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "strides": [1, 1], "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"name": "res30_branch1", "class_name": "Conv2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [1, 1], "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "res30_branch1", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "strides": [2, 2], "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"name": "bn30_branch2c", "class_name": "BatchNormalization", "inbound_nodes": [[["res30_branch2c", 0, 0, {}]]], "config": {"axis": 3, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "bn30_branch2c", "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true}}, {"name": "bn30_branch1", "class_name": "BatchNormalization", "inbound_nodes": [[["res30_branch1", 0, 0, {}]]], "config": {"axis": 3, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "bn30_branch1", "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true}}, {"name": "add_4", "class_name": "Add", "inbound_nodes": [[["bn30_branch2c", 0, 0, {}], ["bn30_branch1", 0, 0, {}]]], "config": {"trainable": true, "name": "add_4"}}, {"name": "activation_13", "class_name": "Activation", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_13"}}, {"name": "res31_branch2a", "class_name": "Conv2D", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [1, 1], "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "res31_branch2a", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "strides": [1, 1], "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"name": "bn31_branch2a", "class_name": "BatchNormalization", "inbound_nodes": [[["res31_branch2a", 0, 0, {}]]], "config": {"axis": 3, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "bn31_branch2a", "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true}}, {"name": "activation_14", "class_name": "Activation", "inbound_nodes": [[["bn31_branch2a", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_14"}}, {"name": "res31_branch2b", "class_name": "Conv2D", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [3, 3], "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "res31_branch2b", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "strides": [1, 1], "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"name": "bn31_branch2b", "class_name": "BatchNormalization", "inbound_nodes": [[["res31_branch2b", 0, 0, {}]]], "config": {"axis": 3, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "bn31_branch2b", "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true}}, {"name": "activation_15", "class_name": "Activation", "inbound_nodes": [[["bn31_branch2b", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_15"}}, {"name": "res31_branch2c", "class_name": "Conv2D", "inbound_nodes": [[["activation_15", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [1, 1], "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "res31_branch2c", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "strides": [1, 1], "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"name": "bn31_branch2c", "class_name": "BatchNormalization", "inbound_nodes": [[["res31_branch2c", 0, 0, {}]]], "config": {"axis": 3, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "bn31_branch2c", "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true}}, {"name": "add_5", "class_name": "Add", "inbound_nodes": [[["bn31_branch2c", 0, 0, {}], ["activation_13", 0, 0, {}]]], "config": {"trainable": true, "name": "add_5"}}, {"name": "activation_16", "class_name": "Activation", "inbound_nodes": [[["add_5", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_16"}}, {"name": "res32_branch2a", "class_name": "Conv2D", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [1, 1], "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "res32_branch2a", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "strides": [1, 1], "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"name": "bn32_branch2a", "class_name": "BatchNormalization", "inbound_nodes": [[["res32_branch2a", 0, 0, {}]]], "config": {"axis": 3, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "bn32_branch2a", "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true}}, {"name": "activation_17", "class_name": "Activation", "inbound_nodes": [[["bn32_branch2a", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_17"}}, {"name": "res32_branch2b", "class_name": "Conv2D", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [3, 3], "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "res32_branch2b", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "strides": [1, 1], "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"name": "bn32_branch2b", "class_name": "BatchNormalization", "inbound_nodes": [[["res32_branch2b", 0, 0, {}]]], "config": {"axis": 3, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "bn32_branch2b", "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true}}, {"name": "activation_18", "class_name": "Activation", "inbound_nodes": [[["bn32_branch2b", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_18"}}, {"name": "res32_branch2c", "class_name": "Conv2D", "inbound_nodes": [[["activation_18", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [1, 1], "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "res32_branch2c", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "strides": [1, 1], "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"name": "bn32_branch2c", "class_name": "BatchNormalization", "inbound_nodes": [[["res32_branch2c", 0, 0, {}]]], "config": {"axis": 3, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "bn32_branch2c", "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true}}, {"name": "add_6", "class_name": "Add", "inbound_nodes": [[["bn32_branch2c", 0, 0, {}], ["activation_16", 0, 0, {}]]], "config": {"trainable": true, "name": "add_6"}}, {"name": "activation_19", "class_name": "Activation", "inbound_nodes": [[["add_6", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_19"}}, {"name": "res33_branch2a", "class_name": "Conv2D", "inbound_nodes": [[["activation_19", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [1, 1], "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "res33_branch2a", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "strides": [1, 1], "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"name": "bn33_branch2a", "class_name": "BatchNormalization", "inbound_nodes": [[["res33_branch2a", 0, 0, {}]]], "config": {"axis": 3, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "bn33_branch2a", "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true}}, {"name": "activation_20", "class_name": "Activation", "inbound_nodes": [[["bn33_branch2a", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_20"}}, {"name": "res33_branch2b", "class_name": "Conv2D", "inbound_nodes": [[["activation_20", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [3, 3], "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "res33_branch2b", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "strides": [1, 1], "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"name": "bn33_branch2b", "class_name": "BatchNormalization", "inbound_nodes": [[["res33_branch2b", 0, 0, {}]]], "config": {"axis": 3, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "bn33_branch2b", "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true}}, {"name": "activation_21", "class_name": "Activation", "inbound_nodes": [[["bn33_branch2b", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_21"}}, {"name": "res33_branch2c", "class_name": "Conv2D", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [1, 1], "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "res33_branch2c", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "strides": [1, 1], "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"name": "bn33_branch2c", "class_name": "BatchNormalization", "inbound_nodes": [[["res33_branch2c", 0, 0, {}]]], "config": {"axis": 3, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "bn33_branch2c", "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true}}, {"name": "add_7", "class_name": "Add", "inbound_nodes": [[["bn33_branch2c", 0, 0, {}], ["activation_19", 0, 0, {}]]], "config": {"trainable": true, "name": "add_7"}}, {"name": "activation_22", "class_name": "Activation", "inbound_nodes": [[["add_7", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_22"}}, {"name": "res34_branch2a", "class_name": "Conv2D", "inbound_nodes": [[["activation_22", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [1, 1], "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "res34_branch2a", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "strides": [1, 1], "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"name": "bn34_branch2a", "class_name": "BatchNormalization", "inbound_nodes": [[["res34_branch2a", 0, 0, {}]]], "config": {"axis": 3, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "bn34_branch2a", "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true}}, {"name": "activation_23", "class_name": "Activation", "inbound_nodes": [[["bn34_branch2a", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_23"}}, {"name": "res34_branch2b", "class_name": "Conv2D", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [3, 3], "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "res34_branch2b", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "strides": [1, 1], "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"name": "bn34_branch2b", "class_name": "BatchNormalization", "inbound_nodes": [[["res34_branch2b", 0, 0, {}]]], "config": {"axis": 3, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "bn34_branch2b", "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true}}, {"name": "activation_24", "class_name": "Activation", "inbound_nodes": [[["bn34_branch2b", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_24"}}, {"name": "res34_branch2c", "class_name": "Conv2D", "inbound_nodes": [[["activation_24", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [1, 1], "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "res34_branch2c", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "strides": [1, 1], "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"name": "bn34_branch2c", "class_name": "BatchNormalization", "inbound_nodes": [[["res34_branch2c", 0, 0, {}]]], "config": {"axis": 3, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "bn34_branch2c", "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true}}, {"name": "add_8", "class_name": "Add", "inbound_nodes": [[["bn34_branch2c", 0, 0, {}], ["activation_22", 0, 0, {}]]], "config": {"trainable": true, "name": "add_8"}}, {"name": "activation_25", "class_name": "Activation", "inbound_nodes": [[["add_8", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_25"}}, {"name": "res35_branch2a", "class_name": "Conv2D", "inbound_nodes": [[["activation_25", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [1, 1], "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "res35_branch2a", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "strides": [1, 1], "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"name": "bn35_branch2a", "class_name": "BatchNormalization", "inbound_nodes": [[["res35_branch2a", 0, 0, {}]]], "config": {"axis": 3, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "bn35_branch2a", "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true}}, {"name": "activation_26", "class_name": "Activation", "inbound_nodes": [[["bn35_branch2a", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_26"}}, {"name": "res35_branch2b", "class_name": "Conv2D", "inbound_nodes": [[["activation_26", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [3, 3], "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "res35_branch2b", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "strides": [1, 1], "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"name": "bn35_branch2b", "class_name": "BatchNormalization", "inbound_nodes": [[["res35_branch2b", 0, 0, {}]]], "config": {"axis": 3, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "bn35_branch2b", "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true}}, {"name": "activation_27", "class_name": "Activation", "inbound_nodes": [[["bn35_branch2b", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_27"}}, {"name": "res35_branch2c", "class_name": "Conv2D", "inbound_nodes": [[["activation_27", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [1, 1], "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "res35_branch2c", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "strides": [1, 1], "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"name": "bn35_branch2c", "class_name": "BatchNormalization", "inbound_nodes": [[["res35_branch2c", 0, 0, {}]]], "config": {"axis": 3, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "bn35_branch2c", "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true}}, {"name": "add_9", "class_name": "Add", "inbound_nodes": [[["bn35_branch2c", 0, 0, {}], ["activation_25", 0, 0, {}]]], "config": {"trainable": true, "name": "add_9"}}, {"name": "activation_28", "class_name": "Activation", "inbound_nodes": [[["add_9", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_28"}}, {"name": "res36_branch2a", "class_name": "Conv2D", "inbound_nodes": [[["activation_28", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [1, 1], "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "res36_branch2a", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "strides": [1, 1], "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"name": "bn36_branch2a", "class_name": "BatchNormalization", "inbound_nodes": [[["res36_branch2a", 0, 0, {}]]], "config": {"axis": 3, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "bn36_branch2a", "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true}}, {"name": "activation_29", "class_name": "Activation", "inbound_nodes": [[["bn36_branch2a", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_29"}}, {"name": "res36_branch2b", "class_name": "Conv2D", "inbound_nodes": [[["activation_29", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [3, 3], "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "res36_branch2b", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "strides": [1, 1], "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"name": "bn36_branch2b", "class_name": "BatchNormalization", "inbound_nodes": [[["res36_branch2b", 0, 0, {}]]], "config": {"axis": 3, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "bn36_branch2b", "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true}}, {"name": "activation_30", "class_name": "Activation", "inbound_nodes": [[["bn36_branch2b", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_30"}}, {"name": "res36_branch2c", "class_name": "Conv2D", "inbound_nodes": [[["activation_30", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [1, 1], "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "res36_branch2c", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "strides": [1, 1], "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"name": "bn36_branch2c", "class_name": "BatchNormalization", "inbound_nodes": [[["res36_branch2c", 0, 0, {}]]], "config": {"axis": 3, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "bn36_branch2c", "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true}}, {"name": "add_10", "class_name": "Add", "inbound_nodes": [[["bn36_branch2c", 0, 0, {}], ["activation_28", 0, 0, {}]]], "config": {"trainable": true, "name": "add_10"}}, {"name": "activation_31", "class_name": "Activation", "inbound_nodes": [[["add_10", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_31"}}, {"name": "res37_branch2a", "class_name": "Conv2D", "inbound_nodes": [[["activation_31", 0, 0, {}]]], 