{"class_name": "Model", "keras_version": "2.1.2", "params": {"batch_normalization_6": 64, "conv2d_31": 36928, "conv2d_32": 36928, "add_6": 0, "conv2d_2": 2320, "batch_normalization_25": 256, "add_12": 0, "batch_normalization_29": 256, "activation_11": 0, "conv2d_29": 36928, "activation_6": 0, "conv2d_13": 9248, "activation_29": 0, "conv2d_33": 36928, "activation_1": 0, "flatten_1": 0, "add_4": 0, "conv2d_4": 2320, "activation_26": 0, "conv2d_18": 9248, "activation_3": 0, "activation_13": 0, "batch_normalization_26": 256, "activation_8": 0, "activation_17": 0, "add_8": 0, "add_10": 0, "activation_19": 0, "conv2d_11": 2320, "activation_10": 0, "add_7": 0, "activation_16": 0, "batch_normalization_31": 256, "activation_9": 0, "batch_normalization_23": 256, "activation_25": 0, "conv2d_5": 2320, "activation_12": 0, "batch_normalization_2": 64, "activation_15": 0, "batch_normalization_18": 128, "conv2d_19": 9248, "batch_normalization_17": 128, "conv2d_22": 9248, "batch_normalization_28": 256, "conv2d_21": 9248, "batch_normalization_8": 64, "batch_normalization_14": 128, "activation_24": 0, "batch_normalization_27": 256, "batch_normalization_9": 64, "activation_28": 0, "batch_normalization_5": 64, "batch_normalization_7": 64, "average_pooling2d_1": 0, "add_14": 0, "batch_normalization_19": 128, "conv2d_26": 36928, "activation_22": 0, "dense_1": 650, "conv2d_25": 2112, "add_5": 0, "batch_normalization_1": 64, "activation_30": 0, "conv2d_3": 2320, "batch_normalization_16": 128, "conv2d_28": 36928, "batch_normalization_21": 128, "conv2d_1": 448, "batch_normalization_11": 64, "add_15": 0, "input_1": 0, "add_1": 0, "activation_31": 0, "conv2d_30": 36928, "batch_normalization_12": 128, "activation_4": 0, "add_2": 0, "activation_2": 0, "activation_23": 0, "add_3": 0, "conv2d_9": 2320, "batch_normalization_20": 128, "conv2d_10": 2320, "conv2d_24": 36928, "activation_18": 0, "conv2d_6": 2320, "batch_normalization_15": 128, "batch_normalization_24": 256, "conv2d_16": 9248, "conv2d_17": 9248, "add_13": 0, "activation_27": 0, "add_11": 0, "activation_14": 0, "activation_21": 0, "conv2d_23": 18496, "batch_normalization_13": 128, "batch_normalization_10": 64, "batch_normalization_4": 64, "conv2d_15": 9248, "batch_normalization_22": 256, "batch_normalization_3": 64, "activation_20": 0, "conv2d_8": 2320, "conv2d_7": 2320, "add_9": 0, "conv2d_14": 544, "batch_normalization_30": 256, "activation_5": 0, "conv2d_20": 9248, "activation_7": 0, "conv2d_12": 4640, "conv2d_27": 36928}, "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 32, 32, 3], "sparse": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "config": {"padding": "same", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "conv2d_1", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "filters": 16}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_1", "config": {"axis": -1, "epsilon": 0.001, "trainable": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "gamma_regularizer": null, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "activation_1", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv2d_2", "config": {"padding": "same", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "conv2d_2", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "filters": 16}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_2", "config": {"axis": -1, "epsilon": 0.001, "trainable": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "gamma_regularizer": null, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "activation_2", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "conv2d_3", "config": {"padding": "same", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "conv2d_3", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "filters": 16}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_3", "config": {"axis": -1, "epsilon": 0.001, "trainable": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "gamma_regularizer": null, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Add", "inbound_nodes": [[["activation_1", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]], "name": "add_1", "config": {"name": "add_1", "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "activation_3", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "conv2d_4", "config": {"padding": "same", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "conv2d_4", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "filters": 16}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "batch_normalization_4", "config": {"axis": -1, "epsilon": 0.001, "trainable": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "gamma_regularizer": null, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "activation_4", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "conv2d_5", "config": {"padding": "same", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "conv2d_5", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "filters": 16}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "batch_normalization_5", "config": {"axis": -1, "epsilon": 0.001, "trainable": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "gamma_regularizer": null, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Add", "inbound_nodes": [[["activation_3", 0, 0, {}], ["batch_normalization_5", 0, 0, {}]]], "name": "add_2", "config": {"name": "add_2", "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "activation_5", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "conv2d_6", "config": {"padding": "same", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "conv2d_6", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "filters": 16}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "batch_normalization_6", "config": {"axis": -1, "epsilon": 0.001, "trainable": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "gamma_regularizer": null, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "name": "activation_6", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "conv2d_7", "config": {"padding": "same", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "conv2d_7", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "filters": 16}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "batch_normalization_7", "config": {"axis": -1, "epsilon": 0.001, "trainable": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "gamma_regularizer": null, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Add", "inbound_nodes": [[["activation_5", 0, 0, {}], ["batch_normalization_7", 0, 0, {}]]], "name": "add_3", "config": {"name": "add_3", "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "activation_7", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "conv2d_8", "config": {"padding": "same", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "conv2d_8", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "filters": 16}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "batch_normalization_8", "config": {"axis": -1, "epsilon": 0.001, "trainable": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8", "gamma_regularizer": null, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "name": "activation_8", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "name": "conv2d_9", "config": {"padding": "same", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "conv2d_9", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "filters": 16}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "batch_normalization_9", "config": {"axis": -1, "epsilon": 0.001, "trainable": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_9", "gamma_regularizer": null, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Add", "inbound_nodes": [[["activation_7", 0, 0, {}], ["batch_normalization_9", 0, 0, {}]]], "name": "add_4", "config": {"name": "add_4", "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "activation_9", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "conv2d_10", "config": {"padding": "same", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "conv2d_10", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "filters": 16}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "batch_normalization_10", "config": {"axis": -1, "epsilon": 0.001, "trainable": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_10", "gamma_regularizer": null, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "name": "activation_10", "config": {"name": "activation_10", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "conv2d_11", "config": {"padding": "same", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "conv2d_11", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "filters": 16}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "batch_normalization_11", "config": {"axis": -1, "epsilon": 0.001, "trainable": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_11", "gamma_regularizer": null, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Add", "inbound_nodes": [[["activation_9", 0, 0, {}], ["batch_normalization_11", 0, 0, {}]]], "name": "add_5", "config": {"name": "add_5", "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "activation_11", "config": {"name": "activation_11", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "name": "conv2d_12", "config": {"padding": "same", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "conv2d_12", "kernel_constraint": null, "activity_regularizer": null, "strides": [2, 2], "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "filters": 32}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "batch_normalization_12", "config": {"axis": -1, "epsilon": 0.001, "trainable": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_12", "gamma_regularizer": null, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "name": "activation_12", "config": {"name": "activation_12", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "name": "conv2d_13", "config": {"padding": "same", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "conv2d_13", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "filters": 32}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "name": "conv2d_14", "config": {"padding": "same", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "conv2d_14", "kernel_constraint": null, "activity_regularizer": null, "strides": [2, 2], "kernel_size": [1, 1], "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "filters": 32}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "batch_normalization_13", "config": {"axis": -1, "epsilon": 0.001, "trainable": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_13", "gamma_regularizer": null, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Add", "inbound_nodes": [[["conv2d_14", 0, 0, {}], ["batch_normalization_13", 0, 0, {}]]], "name": "add_6", "config": {"name": "add_6", "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["add_6", 0, 0, {}]]], "name": "activation_13", "config": {"name": "activation_13", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "name": "conv2d_15", "config": {"padding": "same", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "conv2d_15", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "filters": 32}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "batch_normalization_14", "config": {"axis": -1, "epsilon": 0.001, "trainable": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_14", "gamma_regularizer": null, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "name": "activation_14", "config": {"name": "activation_14", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "name": "conv2d_16", "config": {"padding": "same", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "conv2d_16", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "filters": 32}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "batch_normalization_15", "config": {"axis": -1, "epsilon": 0.001, "trainable": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_15", "gamma_regularizer": null, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Add", "inbound_nodes": [[["activation_13", 0, 0, {}], ["batch_normalization_15", 0, 0, {}]]], "name": "add_7", "config": {"name": "add_7", "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["add_7", 0, 0, {}]]], "name": "activation_15", "config": {"name": "activation_15", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_15", 0, 0, {}]]], "name": "conv2d_17", "config": {"padding": "same", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "conv2d_17", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "filters": 32}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "name": "batch_normalization_16", "config": {"axis": -1, "epsilon": 0.001, "trainable": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_16", "gamma_regularizer": null, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "name": "activation_16", "config": {"name": "activation_16", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "name": "conv2d_18", "config": {"padding": "same", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "conv2d_18", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "filters": 32}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "name": "batch_normalization_17", "config": {"axis": -1, "epsilon": 0.001, "trainable": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_17", "gamma_regularizer": null, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Add", "inbound_nodes": [[["activation_15", 0, 0, {}], ["batch_normalization_17", 0, 0, {}]]], "name": "add_8", "config": {"name": "add_8", "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["add_8", 0, 0, {}]]], "name": "activation_17", "config": {"name": "activation_17", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "name": "conv2d_19", "config": {"padding": "same", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "conv2d_19", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "filters": 32}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "name": "batch_normalization_18", "config": {"axis": -1, "epsilon": 0.001, "trainable": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_18", "gamma_regularizer": null, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "name": "activation_18", "config": {"name": "activation_18", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_18", 0, 0, {}]]], "name": "conv2d_20", "config": {"padding": "same", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "conv2d_20", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "filters": 32}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "name": "batch_normalization_19", "config": {"axis": -1, "epsilon": 0.001, "trainable": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_19", "gamma_regularizer": null, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Add", "inbound_nodes": [[["activation_17", 0, 0, {}], ["batch_normalization_19", 0, 0, {}]]], "name": "add_9", "config": {"name": "add_9", "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["add_9", 0, 0, {}]]], "name": "activation_19", "config": {"name": "activation_19", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_19", 0, 0, {}]]], "name": "conv2d_21", "config": {"padding": "same", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "conv2d_21", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "filters": 32}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "name": "batch_normalization_20", "config": {"axis": -1, "epsilon": 0.001, "trainable": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_20", "gamma_regularizer": null, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "name": "activation_20", "config": {"name": "activation_20", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_20", 0, 0, {}]]], "name": "conv2d_22", "config": {"padding": "same", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "conv2d_22", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "filters": 32}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "name": "batch_normalization_21", "config": {"axis": -1, "epsilon": 0.001, "trainable": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_21", "gamma_regularizer": null, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Add", "inbound_nodes": [[["activation_19", 0, 0, {}], ["batch_normalization_21", 0, 0, {}]]], "name": "add_10", "config": {"name": "add_10", "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["add_10", 0, 0, {}]]], "name": "activation_21", "config": {"name": "activation_21", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "name": "conv2d_23", "config": {"padding": "same", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "conv2d_23", "kernel_constraint": null, "activity_regularizer": null, "strides": [2, 2], "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "filters": 64}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "name": "batch_normalization_22", "config": {"axis": -1, "epsilon": 0.001, "trainable": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_22", "gamma_regularizer": null, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "name": "activation_22", "config": {"name": "activation_22", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_22", 0, 0, {}]]], "name": "conv2d_24", "config": {"padding": "same", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "conv2d_24", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "filters": 64}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "name": "conv2d_25", "config": {"padding": "same", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "conv2d_25", "kernel_constraint": null, "activity_regularizer": null, "strides": [2, 2], "kernel_size": [1, 1], "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "filters": 64}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "name": "batch_normalization_23", "config": {"axis": -1, "epsilon": 0.001, "trainable": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_23", "gamma_regularizer": null, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Add", "inbound_nodes": [[["conv2d_25", 0, 0, {}], ["batch_normalization_23", 0, 0, {}]]], "name": "add_11", "config": {"name": "add_11", "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["add_11", 0, 0, {}]]], "name": "activation_23", "config": {"name": "activation_23", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "name": "conv2d_26", "config": {"padding": "same", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "conv2d_26", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "filters": 64}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "name": "batch_normalization_24", "config": {"axis": -1, "epsilon": 0.001, "trainable": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_24", "gamma_regularizer": null, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "name": "activation_24", "config": {"name": "activation_24", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_24", 0, 0, {}]]], "name": "conv2d_27", "config": {"padding": "same", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "conv2d_27", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "filters": 64}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "name": "batch_normalization_25", "config": {"axis": -1, "epsilon": 0.001, "trainable": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_25", "gamma_regularizer": null, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Add", "inbound_nodes": [[["activation_23", 0, 0, {}], ["batch_normalization_25", 0, 0, {}]]], "name": "add_12", "config": {"name": "add_12", "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["add_12", 0, 0, {}]]], "name": "activation_25", "config": {"name": "activation_25", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_25", 0, 0, {}]]], "name": "conv2d_28", "config": {"padding": "same", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "conv2d_28", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "filters": 64}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "name": "batch_normalization_26", "config": {"axis": -1, "epsilon": 0.001, "trainable": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_26", "gamma_regularizer": null, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "name": "activation_26", "config": {"name": "activation_26", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_26", 0, 0, {}]]], "name": "conv2d_29", "config": {"padding": "same", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "conv2d_29", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "filters": 64}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "name": "batch_normalization_27", "config": {"axis": -1, "epsilon": 0.001, "trainable": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_27", "gamma_regularizer": null, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Add", "inbound_nodes": [[["activation_25", 0, 0, {}], ["batch_normalization_27", 0, 0, {}]]], "name": "add_13", "config": {"name": "add_13", "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["add_13", 0, 0, {}]]], "name": "activation_27", "config": {"name": "activation_27", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_27", 0, 0, {}]]], "name": "conv2d_30", "config": {"padding": "same", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "conv2d_30", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "filters": 64}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "name": "batch_normalization_28", "config": {"axis": -1, "epsilon": 0.001, "trainable": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_28", "gamma_regularizer": null, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "name": "activation_28", "config": {"name": "activation_28", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_28", 0, 0, {}]]], "name": "conv2d_31", "config": {"padding": "same", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "name": "conv2d_31", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", 