{"config": {"layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 224, 224, 3], "name": "input_1"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv1", "class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [7, 7], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [2, 2], "name": "conv1", "activity_regularizer": null, "padding": "same", "filters": 64}}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "name": "bn_conv1", "class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null, "axis": 3, "center": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn_conv1", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn_conv1", 0, 0, {}]]], "name": "activation_1", "class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [3, 3], "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_1", "padding": "valid"}}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "res2a_branch2a", "class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "name": "res2a_branch2a", "activity_regularizer": null, "padding": "valid", "filters": 64}}, {"inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]], "name": "bn2a_branch2a", "class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null, "axis": 3, "center": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2a_branch2a", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]], "name": "activation_2", "class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "res2a_branch2b", "class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "name": "res2a_branch2b", "activity_regularizer": null, "padding": "same", "filters": 64}}, {"inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]], "name": "bn2a_branch2b", "class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null, "axis": 3, "center": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2a_branch2b", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn2a_branch2b", 0, 0, {}]]], "name": "activation_3", "class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "res2a_branch2c", "class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "name": "res2a_branch2c", "activity_regularizer": null, "padding": "valid", "filters": 256}}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "res2a_branch1", "class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "name": "res2a_branch1", "activity_regularizer": null, "padding": "valid", "filters": 256}}, {"inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]], "name": "bn2a_branch2c", "class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null, "axis": 3, "center": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2a_branch2c", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["res2a_branch1", 0, 0, {}]]], "name": "bn2a_branch1", "class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null, "axis": 3, "center": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2a_branch1", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn2a_branch2c", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]], "name": "add_1", "class_name": "Add", "config": {"trainable": true, "name": "add_1"}}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "activation_4", "class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "res2b_branch2a", "class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "name": "res2b_branch2a", "activity_regularizer": null, "padding": "valid", "filters": 64}}, {"inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]], "name": "bn2b_branch2a", "class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null, "axis": 3, "center": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2b_branch2a", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]], "name": "activation_5", "class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "res2b_branch2b", "class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "name": "res2b_branch2b", "activity_regularizer": null, "padding": "same", "filters": 64}}, {"inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]], "name": "bn2b_branch2b", "class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null, "axis": 3, "center": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2b_branch2b", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn2b_branch2b", 0, 0, {}]]], "name": "activation_6", "class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "res2b_branch2c", "class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "name": "res2b_branch2c", "activity_regularizer": null, "padding": "valid", "filters": 256}}, {"inbound_nodes": [[["res2b_branch2c", 0, 0, {}]]], "name": "bn2b_branch2c", "class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null, "axis": 3, "center": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2b_branch2c", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn2b_branch2c", 0, 0, {}], ["activation_4", 0, 0, {}]]], "name": "add_2", "class_name": "Add", "config": {"trainable": true, "name": "add_2"}}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "activation_7", "class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "res2c_branch2a", "class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "name": "res2c_branch2a", "activity_regularizer": null, "padding": "valid", "filters": 64}}, {"inbound_nodes": [[["res2c_branch2a", 0, 0, {}]]], "name": "bn2c_branch2a", "class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null, "axis": 3, "center": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2c_branch2a", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn2c_branch2a", 0, 0, {}]]], "name": "activation_8", "class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"inbound_nodes": [[["activation_8", 0, 0, {}]]], "name": "res2c_branch2b", "class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "name": "res2c_branch2b", "activity_regularizer": null, "padding": "same", "filters": 64}}, {"inbound_nodes": [[["res2c_branch2b", 0, 0, {}]]], "name": "bn2c_branch2b", "class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null, "axis": 3, "center": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2c_branch2b", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn2c_branch2b", 0, 0, {}]]], "name": "activation_9", "class_name": "Activation", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}}, {"inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "res2c_branch2c", "class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "name": "res2c_branch2c", "activity_regularizer": null, "padding": "valid", "filters": 256}}, {"inbound_nodes": [[["res2c_branch2c", 0, 0, {}]]], "name": "bn2c_branch2c", "class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null, "axis": 3, "center": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2c_branch2c", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn2c_branch2c", 0, 0, {}], ["activation_7", 0, 0, {}]]], "name": "add_3", "class_name": "Add", "config": {"trainable": true, "name": "add_3"}}, {"inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "activation_10", "class_name": "Activation", "config": {"trainable": true, "name": "activation_10", "activation": "relu"}}, {"inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "res3a_branch2a", "class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [2, 2], "name": "res3a_branch2a", "activity_regularizer": null, "padding": "valid", "filters": 128}}, {"inbound_nodes": [[["res3a_branch2a", 0, 0, {}]]], "name": "bn3a_branch2a", "class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null, "axis": 3, "center": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3a_branch2a", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]], "name": "activation_11", "class_name": "Activation", "config": {"trainable": true, "name": "activation_11", "activation": "relu"}}, {"inbound_nodes": [[["activation_11", 0, 0, {}]]], "name": "res3a_branch2b", "class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "name": "res3a_branch2b", "activity_regularizer": null, "padding": "same", "filters": 128}}, {"inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]], "name": "bn3a_branch2b", "class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null, "axis": 3, "center": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3a_branch2b", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn3a_branch2b", 0, 0, {}]]], "name": "activation_12", "class_name": "Activation", "config": {"trainable": true, "name": "activation_12", "activation": "relu"}}, {"inbound_nodes": [[["activation_12", 0, 0, {}]]], "name": "res3a_branch2c", "class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "name": "res3a_branch2c", "activity_regularizer": null, "padding": "valid", "filters": 512}}, {"inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "res3a_branch1", "class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [2, 2], "name": "res3a_branch1", "activity_regularizer": null, "padding": "valid", "filters": 512}}, {"inbound_nodes": [[["res3a_branch2c", 0, 0, {}]]], "name": "bn3a_branch2c", "class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null, "axis": 3, "center": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3a_branch2c", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["res3a_branch1", 0, 0, {}]]], "name": "bn3a_branch1", "class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null, "axis": 3, "center": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3a_branch1", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn3a_branch2c", 0, 0, {}], ["bn3a_branch1", 0, 0, {}]]], "name": "add_4", "class_name": "Add", "config": {"trainable": true, "name": "add_4"}}, {"inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "activation_13", "class_name": "Activation", "config": {"trainable": true, "name": "activation_13", "activation": "relu"}}, {"inbound_nodes": [[["activation_13", 0, 0, {}]]], "name": "res3b_branch2a", "class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "name": "res3b_branch2a", "activity_regularizer": null, "padding": "valid", "filters": 128}}, {"inbound_nodes": [[["res3b_branch2a", 0, 0, {}]]], "name": "bn3b_branch2a", "class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null, "axis": 3, "center": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3b_branch2a", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn3b_branch2a", 0, 0, {}]]], "name": "activation_14", "class_name": "Activation", "config": {"trainable": true, "name": "activation_14", "activation": "relu"}}, {"inbound_nodes": [[["activation_14", 0, 0, {}]]], "name": "res3b_branch2b", "class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "name": "res3b_branch2b", "activity_regularizer": null, "padding": "same", "filters": 128}}, {"inbound_nodes": [[["res3b_branch2b", 0, 0, {}]]], "name": "bn3b_branch2b", "class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null, "axis": 3, "center": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3b_branch2b", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn3b_branch2b", 0, 0, {}]]], "name": "activation_15", "class_name": "Activation", "config": {"trainable": true, "name": "activation_15", "activation": "relu"}}, {"inbound_nodes": [[["activation_15", 0, 0, {}]]], "name": "res3b_branch2c", "class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "name": "res3b_branch2c", "activity_regularizer": null, "padding": "valid", "filters": 512}}, {"inbound_nodes": [[["res3b_branch2c", 0, 0, {}]]], "name": "bn3b_branch2c", "class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null, "axis": 3, "center": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3b_branch2c", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn3b_branch2c", 0, 0, {}], ["activation_13", 0, 0, {}]]], "name": "add_5", "class_name": "Add", "config": {"trainable": true, "name": "add_5"}}, {"inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "activation_16", "class_name": "Activation", "config": {"trainable": true, "name": "activation_16", "activation": "relu"}}, {"inbound_nodes": [[["activation_16", 0, 0, {}]]], "name": "res3c_branch2a", "class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "name": "res3c_branch2a", "activity_regularizer": null, "padding": "valid", "filters": 128}}, {"inbound_nodes": [[["res3c_branch2a", 0, 0, {}]]], "name": "bn3c_branch2a", "class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null, "axis": 3, "center": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3c_branch2a", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn3c_branch2a", 0, 0, {}]]], "name": "activation_17", "class_name": "Activation", "config": {"trainable": true, "name": "activation_17", "activation": "relu"}}, {"inbound_nodes": [[["activation_17", 0, 0, {}]]], "name": "res3c_branch2b", "class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "name": "res3c_branch2b", "activity_regularizer": null, "padding": "same", "filters": 128}}, {"inbound_nodes": [[["res3c_branch2b", 0, 0, {}]]], "name": "bn3c_branch2b", "class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null, "axis": 3, "center": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3c_branch2b", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn3c_branch2b", 0, 0, {}]]], "name": "activation_18", "class_name": "Activation", "config": {"trainable": true, "name": "activation_18", "activation": "relu"}}, {"inbound_nodes": [[["activation_18", 0, 0, {}]]], "name": "res3c_branch2c", "class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "name": "res3c_branch2c", "activity_regularizer": null, "padding": "valid", "filters": 512}}, {"inbound_nodes": [[["res3c_branch2c", 0, 0, {}]]], "name": "bn3c_branch2c", "class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null, "axis": 3, "center": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3c_branch2c", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn3c_branch2c", 0, 0, {}], ["activation_16", 0, 0, {}]]], "name": "add_6", "class_name": "Add", "config": {"trainable": true, "name": "add_6"}}, {"inbound_nodes": [[["add_6", 0, 0, {}]]], "name": "activation_19", "class_name": "Activation", "config": {"trainable": true, "name": "activation_19", "activation": "relu"}}, {"inbound_nodes": [[["activation_19", 0, 0, {}]]], "name": "res3d_branch2a", "class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "name": "res3d_branch2a", "activity_regularizer": null, "padding": "valid", "filters": 128}}, {"inbound_nodes": [[["res3d_branch2a", 0, 0, {}]]], "name": "bn3d_branch2a", "class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null, "axis": 3, "center": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3d_branch2a", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn3d_branch2a", 0, 0, {}]]], "name": "activation_20", "class_name": "Activation", "config": {"trainable": true, "name": "activation_20", "activation": "relu"}}, {"inbound_nodes": [[["activation_20", 0, 0, {}]]], "name": "res3d_branch2b", "class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "name": "res3d_branch2b", "activity_regularizer": null, "padding": "same", "filters": 128}}, {"inbound_nodes": [[["res3d_branch2b", 0, 0, {}]]], "name": "bn3d_branch2b", "class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null, "axis": 3, "center": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3d_branch2b", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn3d_branch2b", 0, 0, {}]]], "name": "activation_21", "class_name": "Activation", "config": {"trainable": true, "name": "activation_21", "activation": "relu"}}, {"inbound_nodes": [[["activation_21", 0, 0, {}]]], "name": "res3d_branch2c", "class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "name": "res3d_branch2c", "activity_regularizer": null, "padding": "valid", "filters": 512}}, {"inbound_nodes": [[["res3d_branch2c", 0, 0, {}]]], "name": "bn3d_branch2c", "class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null, "axis": 3, "center": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3d_branch2c", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn3d_branch2c", 0, 0, {}], ["activation_19", 0, 0, {}]]], "name": "add_7", "class_name": "Add", "config": {"trainable": true, "name": "add_7"}}, {"inbound_nodes": [[["add_7", 0, 0, {}]]], "name": "activation_22", "class_name": "Activation", "config": {"trainable": true, "name": "activation_22", "activation": "relu"}}, {"inbound_nodes": [[["activation_22", 0, 0, {}]]], "name": "res4a_branch2a", "class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [2, 2], "name": "res4a_branch2a", "activity_regularizer": null, "padding": "valid", "filters": 256}}, {"inbound_nodes": [[["res4a_branch2a", 0, 0, {}]]], "name": "bn4a_branch2a", "class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null, "axis": 3, "center": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4a_branch2a", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn4a_branch2a", 0, 0, {}]]], "name": "activation_23", "class_name": "Activation", "config": {"trainable": true, "name": "activation_23", "activation": "relu"}}, {"inbound_nodes": [[["activation_23", 0, 0, {}]]], "name": "res4a_branch2b", "class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "name": "res4a_branch2b", "activity_regularizer": null, "padding": "same", "filters": 256}}, {"inbound_nodes": [[["res4a_branch2b", 0, 0, {}]]], "name": "bn4a_branch2b", "class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null, "axis": 3, "center": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4a_branch2b", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn4a_branch2b", 0, 0, {}]]], "name": "activation_24", "class_name": "Activation", "config": {"trainable": true, "name": "activation_24", "activation": "relu"}}, {"inbound_nodes": [[["activation_24", 0, 0, {}]]], "name": "res4a_branch2c", "class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "name": "res4a_branch2c", "activity_regularizer": null, "padding": "valid", "filters": 1024}}, {"inbound_nodes": [[["activation_22", 0, 0, {}]]], "name": "res4a_branch1", "class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [2, 2], "name": "res4a_branch1", "activity_regularizer": null, "padding": "valid", "filters": 1024}}, {"inbound_nodes": [[["res4a_branch2c", 0, 0, {}]]], "name": "bn4a_branch2c", "class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null, "axis": 3, "center": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4a_branch2c", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["res4a_branch1", 0, 0, {}]]], "name": "bn4a_branch1", "class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null, "axis": 3, "center": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4a_branch1", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn4a_branch2c", 0, 0, {}], ["bn4a_branch1", 0, 0, {}]]], "name": "add_8", "class_name": "Add", "config": {"trainable": true, "name": "add_8"}}, {"inbound_nodes": [[["add_8", 0, 0, {}]]], "name": "activation_25", "class_name": "Activation", "config": {"trainable": true, "name": "activation_25", "activation": "relu"}}, {"inbound_nodes": [[["activation_25", 0, 0, {}]]], "name": "res4b_branch2a", "class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "name": "res4b_branch2a", "activity_regularizer": null, "padding": "valid", "filters": 256}}, {"inbound_nodes": [[["res4b_branch2a", 0, 0, {}]]], "name": "bn4b_branch2a", "class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null, "axis": 3, "center": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4b_branch2a", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn4b_branch2a", 0, 0, {}]]], "name": "activation_26", "class_name": "Activation", "config": {"trainable": true, "name": "activation_26", "activation": "relu"}}, {"inbound_nodes": [[["activation_26", 0, 0, {}]]], "name": "res4b_branch2b", "class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "name": "res4b_branch2b", "activity_regularizer": null, "padding": "same", "filters": 256}}, {"inbound_nodes": [[["res4b_branch2b", 0, 0, {}]]], "name": "bn4b_branch2b", "class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null, "axis": 3, "center": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4b_branch2b", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn4b_branch2b", 0, 0, {}]]], "name": "activation_27", "class_name": "Activation", "config": {"trainable": true, "name": "activation_27", "activation": "relu"}}, {"inbound_nodes": [[["activation_27", 0, 0, {}]]], "name": "res4b_branch2c", "class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "name": "res4b_branch2c", "activity_regularizer": null, "padding": "valid", "filters": 1024}}, {"inbound_nodes": [[["res4b_branch2c", 0, 0, {}]]], "name": "bn4b_branch2c", "class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null, "axis": 3, "center": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4b_branch2c", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn4b_branch2c", 0, 0, {}], ["activation_25", 0, 0, {}]]], "name": "add_9", "class_name": "Add", "config": {"trainable": true, "name": "add_9"}}, {"inbound_nodes": [[["add_9", 0, 0, {}]]], "name": "activation_28", "class_name": "Activation", "config": {"trainable": true, "name": "activation_28", "activation": "relu"}}, {"inbound_nodes": [[["activation_28", 0, 0, {}]]], "name": "res4c_branch2a", "class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "name": "res4c_branch2a", "activity_regularizer": null, "padding": "valid", "filters": 256}}, {"inbound_nodes": [[["res4c_branch2a", 0, 0, {}]]], "name": "bn4c_branch2a", "class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null, "axis": 3, "center": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4c_branch2a", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn4c_branch2a", 0, 0, {}]]], "name": "activation_29", "class_name": "Activation", "config": {"trainable": true, "name": "activation_29", "activation": "relu"}}, {"inbound_nodes": [[["activation_29", 0, 0, {}]]], "name": "res4c_branch2b", "class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "name": "res4c_branch2b", "activity_regularizer": null, "padding": "same", "filters": 256}}, {"inbound_nodes": [[["res4c_branch2b", 0, 0, {}]]], "name": "bn4c_branch2b", "class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "beta_constraint": null, "axis": 3, "center": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4c_branch2b", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["bn4c_branch2b", 0, 0, {}]]], "name": "activation_30", "class_name": "Activation", "config": {"trainable": true, "name": "activation_30", "activation": "relu"}}, {"inbound_nodes": [[["activation_30", 0, 0, {}]]], "name": "res4c_branch2c", "class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, 