{"backend": "tensorflow", "class_name": "Model", "params": {"fire3/squeeze1x1": 2064, "fire4/squeeze1x1": 4128, "fire3/relu_expand3x3": 0, "fire2/concat": 0, "pool1": 0, "fire5/relu_expand1x1": 0, "fire4/relu_expand1x1": 0, "fire7/squeeze1x1": 18480, "fire8/squeeze1x1": 24640, "fire7/relu_expand3x3": 0, "fire9/expand3x3": 147712, "fire6/expand1x1": 9408, "fire4/expand1x1": 4224, "fire9/squeeze1x1": 32832, "fire7/expand3x3": 83136, "pool5": 0, "conv1": 1792, "fire5/expand3x3": 36992, "fire7/concat": 0, "fire9/relu_expand3x3": 0, "fire7/expand1x1": 9408, "fire8/expand1x1": 16640, "input_1": 0, "relu_conv1": 0, "fire2/squeeze1x1": 1040, "fire9/relu_expand1x1": 0, "fire9/expand1x1": 16640, "fire3/expand1x1": 1088, "fire9/relu_squeeze1x1": 0, "fire4/relu_squeeze1x1": 0, "fire4/relu_expand3x3": 0, "fire6/expand3x3": 83136, "fire5/relu_squeeze1x1": 0, "fire6/squeeze1x1": 12336, "fire5/expand1x1": 4224, "fire2/relu_expand1x1": 0, "fire2/relu_expand3x3": 0, "drop9": 0, "conv10": 513000, "fire3/relu_squeeze1x1": 0, "fire5/concat": 0, "fire5/relu_expand3x3": 0, "fire8/concat": 0, "relu_conv10": 0, "pool3": 0, "fire9/concat": 0, "fire3/relu_expand1x1": 0, "loss": 0, "fire6/relu_expand1x1": 0, "fire3/expand3x3": 9280, "fire4/concat": 0, "fire7/relu_squeeze1x1": 0, "fire6/relu_squeeze1x1": 0, "fire7/relu_expand1x1": 0, "fire3/concat": 0, "fire8/expand3x3": 147712, "global_average_pooling2d_1": 0, "fire4/expand3x3": 36992, "fire6/relu_expand3x3": 0, "fire8/relu_expand1x1": 0, "fire6/concat": 0, "fire8/relu_squeeze1x1": 0, "fire2/expand1x1": 1088, "fire2/expand3x3": 9280, "fire2/relu_squeeze1x1": 0, "fire5/squeeze1x1": 8224, "fire8/relu_expand3x3": 0}, "keras_version": "2.1.2", "config": {"name": "squeezenet", "output_layers": [["loss", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 227, 227, 3]}}, {"name": "conv1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activation": "linear", "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "use_bias": true, "filters": 64, "trainable": true, "name": "conv1", "bias_constraint": null, "kernel_constraint": null, "strides": [2, 2], "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1]}}, {"name": "relu_conv1", "class_name": "Activation", "inbound_nodes": [[["conv1", 0, 0, {}]]], "config": {"activation": "relu", "name": "relu_conv1", "trainable": true}}, {"name": "pool1", "class_name": "MaxPooling2D", "inbound_nodes": [[["relu_conv1", 0, 0, {}]]], "config": {"name": "pool1", "strides": [2, 2], "pool_size": [3, 3], "padding": "valid", "trainable": true, "data_format": "channels_last"}}, {"name": "fire2/squeeze1x1", "class_name": "Conv2D", "inbound_nodes": [[["pool1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activation": "linear", "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "use_bias": true, "filters": 16, "trainable": true, "name": "fire2/squeeze1x1", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1]}}, {"name": "fire2/relu_squeeze1x1", "class_name": "Activation", "inbound_nodes": [[["fire2/squeeze1x1", 0, 0, {}]]], "config": {"activation": "relu", "name": "fire2/relu_squeeze1x1", "trainable": true}}, {"name": "fire2/expand1x1", "class_name": "Conv2D", "inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activation": "linear", "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "use_bias": true, "filters": 64, "trainable": true, "name": "fire2/expand1x1", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1]}}, {"name": "fire2/expand3x3", "class_name": "Conv2D", "inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activation": "linear", "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "use_bias": true, "filters": 64, "trainable": true, "name": "fire2/expand3x3", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1]}}, {"name": "fire2/relu_expand1x1", "class_name": "Activation", "inbound_nodes": [[["fire2/expand1x1", 0, 0, {}]]], "config": {"activation": "relu", "name": "fire2/relu_expand1x1", "trainable": true}}, {"name": "fire2/relu_expand3x3", "class_name": "Activation", "inbound_nodes": [[["fire2/expand3x3", 0, 0, {}]]], "config": {"activation": "relu", "name": "fire2/relu_expand3x3", "trainable": true}}, {"name": "fire2/concat", "class_name": "Concatenate", "inbound_nodes": [[["fire2/relu_expand1x1", 0, 0, {}], ["fire2/relu_expand3x3", 0, 0, {}]]], "config": {"name": "fire2/concat", "trainable": true, "axis": 3}}, {"name": "fire3/squeeze1x1", "class_name": "Conv2D", "inbound_nodes": [[["fire2/concat", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activation": "linear", "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "use_bias": true, "filters": 16, "trainable": true, "name": "fire3/squeeze1x1", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1]}}, {"name": "fire3/relu_squeeze1x1", "class_name": "Activation", "inbound_nodes": [[["fire3/squeeze1x1", 0, 0, {}]]], "config": {"activation": "relu", "name": "fire3/relu_squeeze1x1", "trainable": true}}, {"name": "fire3/expand1x1", "class_name": "Conv2D", "inbound_nodes": [[["fire3/relu_squeeze1x1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activation": "linear", "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "use_bias": true, "filters": 64, "trainable": true, "name": "fire3/expand1x1", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1]}}, {"name": "fire3/expand3x3", "class_name": "Conv2D", "inbound_nodes": [[["fire3/relu_squeeze1x1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activation": "linear", "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "use_bias": true, "filters": 64, "trainable": true, "name": "fire3/expand3x3", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1]}}, {"name": "fire3/relu_expand1x1", "class_name": "Activation", "inbound_nodes": [[["fire3/expand1x1", 0, 0, {}]]], "config": {"activation": "relu", "name": "fire3/relu_expand1x1", "trainable": true}}, {"name": "fire3/relu_expand3x3", "class_name": "Activation", "inbound_nodes": [[["fire3/expand3x3", 0, 0, {}]]], "config": {"activation": "relu", "name": "fire3/relu_expand3x3", "trainable": true}}, {"name": "fire3/concat", "class_name": "Concatenate", "inbound_nodes": [[["fire3/relu_expand1x1", 0, 0, {}], ["fire3/relu_expand3x3", 0, 0, {}]]], "config": {"name": "fire3/concat", "trainable": true, "axis": 3}}, {"name": "pool3", "class_name": "MaxPooling2D", "inbound_nodes": [[["fire3/concat", 0, 0, {}]]], "config": {"name": "pool3", "strides": [2, 2], "pool_size": [3, 3], "padding": "valid", "trainable": true, "data_format": "channels_last"}}, {"name": "fire4/squeeze1x1", "class_name": "Conv2D", "inbound_nodes": [[["pool3", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activation": "linear", "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "use_bias": true, "filters": 32, "trainable": true, "name": "fire4/squeeze1x1", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1]}}, {"name": "fire4/relu_squeeze1x1", "class_name": "Activation", "inbound_nodes": [[["fire4/squeeze1x1", 0, 0, {}]]], "config": {"activation": "relu", "name": "fire4/relu_squeeze1x1", "trainable": true}}, {"name": "fire4/expand1x1", "class_name": "Conv2D", "inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activation": "linear", "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "use_bias": true, "filters": 128, "trainable": true, "name": "fire4/expand1x1", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1]}}, {"name": "fire4/expand3x3", "class_name": "Conv2D", "inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activation": "linear", "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "use_bias": true, "filters": 128, "trainable": true, "name": "fire4/expand3x3", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1]}}, {"name": "fire4/relu_expand1x1", "class_name": "Activation", "inbound_nodes": [[["fire4/expand1x1", 0, 0, {}]]], "config": {"activation": "relu", "name": "fire4/relu_expand1x1", "trainable": true}}, {"name": "fire4/relu_expand3x3", "class_name": "Activation", "inbound_nodes": [[["fire4/expand3x3", 0, 0, {}]]], "config": {"activation": "relu", "name": "fire4/relu_expand3x3", "trainable": true}}, {"name": "fire4/concat", "class_name": "Concatenate", "inbound_nodes": [[["fire4/relu_expand1x1", 0, 0, {}], ["fire4/relu_expand3x3", 0, 0, {}]]], "config": {"name": "fire4/concat", "trainable": true, "axis": 3}}, {"name": "fire5/squeeze1x1", "class_name": "Conv2D", "inbound_nodes": [[["fire4/concat", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activation": "linear", "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "use_bias": true, "filters": 32, "trainable": true, "name": "fire5/squeeze1x1", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1]}}, {"name": "fire5/relu_squeeze1x1", "class_name": "Activation", "inbound_nodes": [[["fire5/squeeze1x1", 0, 0, {}]]], "config": {"activation": "relu", "name": "fire5/relu_squeeze1x1", "trainable": true}}, {"name": "fire5/expand1x1", "class_name": "Conv2D", "inbound_nodes": [[["fire5/relu_squeeze1x1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activation": "linear", "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "use_bias": true, "filters": 128, "trainable": true, "name": "fire5/expand1x1", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1]}}, {"name": "fire5/expand3x3", "class_name": "Conv2D", "inbound_nodes": [[["fire5/relu_squeeze1x1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activation": "linear", "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "use_bias": true, "filters": 128, "trainable": true, "name": "fire5/expand3x3", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1]}}, {"name": "fire5/relu_expand1x1", "class_name": "Activation", "inbound_nodes": [[["fire5/expand1x1", 0, 0, {}]]], "config": {"activation": "relu", "name": "fire5/relu_expand1x1", "trainable": true}}, {"name": "fire5/relu_expand3x3", "class_name": "Activation", "inbound_nodes": [[["fire5/expand3x3", 0, 0, {}]]], "config": {"activation": "relu", "name": "fire5/relu_expand3x3", "trainable": true}}, {"name": "fire5/concat", "class_name": "Concatenate", "inbound_nodes": [[["fire5/relu_expand1x1", 0, 0, {}], ["fire5/relu_expand3x3", 0, 0, {}]]], "config": {"name": "fire5/concat", "trainable": true, "axis": 3}}, {"name": "pool5", "class_name": "MaxPooling2D", "inbound_nodes": [[["fire5/concat", 0, 0, {}]]], "config": {"name": "pool5", "strides": [2, 2], "pool_size": [3, 3], "padding": "valid", "trainable": true, "data_format": "channels_last"}}, {"name": "fire6/squeeze1x1", "class_name": "Conv2D", "inbound_nodes": [[["pool5", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activation": "linear", "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "use_bias": true, "filters": 48, "trainable": true, "name": "fire6/squeeze1x1", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1]}}, {"name": "fire6/relu_squeeze1x1", "class_name": "Activation", "inbound_nodes": [[["fire6/squeeze1x1", 0, 0, {}]]], "config": {"activation": "relu", "name": "fire6/relu_squeeze1x1", "trainable": true}}, {"name": "fire6/expand1x1", "class_name": "Conv2D", "inbound_nodes": [[["fire6/relu_squeeze1x1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activation": "linear", "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "use_bias": true, "filters": 192, "trainable": true, "name": "fire6/expand1x1", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1]}}, {"name": "fire6/expand3x3", "class_name": "Conv2D", "inbound_nodes": [[["fire6/relu_squeeze1x1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activation": "linear", "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "use_bias": true, "filters": 192, "trainable": true, "name": "fire6/expand3x3", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1]}}, {"name": "fire6/relu_expand1x1", "class_name": "Activation", "inbound_nodes": [[["fire6/expand1x1", 0, 0, {}]]], "config": {"activation": "relu", "name": "fire6/relu_expand1x1", "trainable": true}}, {"name": "fire6/relu_expand3x3", "class_name": "Activation", "inbound_nodes": [[["fire6/expand3x3", 0, 0, {}]]], "config": {"activation": "relu", "name": "fire6/relu_expand3x3", "trainable": true}}, {"name": "fire6/concat", "class_name": "Concatenate", "inbound_nodes": [[["fire6/relu_expand1x1", 0, 0, {}], ["fire6/relu_expand3x3", 0, 0, {}]]], "config": {"name": "fire6/concat", "trainable": true, "axis": 3}}, {"name": "fire7/squeeze1x1", "class_name": "Conv2D", "inbound_nodes": [[["fire6/concat", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activation": "linear", "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "use_bias": true, "filters": 48, "trainable": true, "name": "fire7/squeeze1x1", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1]}}, {"name": "fire7/relu_squeeze1x1", "class_name": "Activation", "inbound_nodes": [[["fire7/squeeze1x1", 0, 0, {}]]], "config": {"activation": "relu", "name": "fire7/relu_squeeze1x1", "trainable": true}}, {"name": "fire7/expand1x1", "class_name": "Conv2D", "inbound_nodes": [[["fire7/relu_squeeze1x1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activation": "linear", "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "use_bias": true, "filters": 192, "trainable": true, "name": "fire7/expand1x1", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1]}}, {"name": "fire7/expand3x3", "class_name": "Conv2D", "inbound_nodes": [[["fire7/relu_squeeze1x1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activation": "linear", "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "use_bias": true, "filters": 192, "trainable": true, "name": "fire7/expand3x3", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1]}}, {"name": "fire7/relu_expand1x1", "class_name": "Activation", "inbound_nodes": [[["fire7/expand1x1", 0, 0, {}]]], "config": {"activation": "relu", "name": "fire7/relu_expand1x1", "trainable": true}}, {"name": "fire7/relu_expand3x3", "class_name": "Activation", "inbound_nodes": [[["fire7/expand3x3", 0, 0, {}]]], "config": {"activation": "relu", "name": "fire7/relu_expand3x3", "trainable": true}}, {"name": "fire7/concat", "class_name": "Concatenate", "inbound_nodes": [[["fire7/relu_expand1x1", 0, 0, {}], ["fire7/relu_expand3x3", 0, 0, {}]]], "config": {"name": "fire7/concat", "trainable": true, "axis": 3}}, {"name": "fire8/squeeze1x1", "class_name": "Conv2D", "inbound_nodes": [[["fire7/concat", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activation": "linear", "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "use_bias": true, "filters": 64, "trainable": true, "name": "fire8/squeeze1x1", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1]}}, {"name": "fire8/relu_squeeze1x1", "class_name": "Activation", "inbound_nodes": [[["fire8/squeeze1x1", 0, 0, {}]]], "config": {"activation": "relu", "name": "fire8/relu_squeeze1x1", "trainable": true}}, {"name": "fire8/expand1x1", "class_name": "Conv2D", "inbound_nodes": [[["fire8/relu_squeeze1x1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activation": "linear", "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "use_bias": true, "filters": 256, "trainable": true, "name": "fire8/expand1x1", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1]}}, {"name": "fire8/expand3x3", "class_name": "Conv2D", "inbound_nodes": [[["fire8/relu_squeeze1x1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activation": "linear", "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "use_bias": true, "filters": 256, "trainable": true, "name": "fire8/expand3x3", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1]}}, {"name": "fire8/relu_expand1x1", "class_name": "Activation", "inbound_nodes": [[["fire8/expand1x1", 0, 0, {}]]], "config": {"activation": "relu", "name": "fire8/relu_expand1x1", "trainable": true}}, {"name": "fire8/relu_expand3x3", "class_name": "Activation", "inbound_nodes": [[["fire8/expand3x3", 0, 0, {}]]], "config": {"activation": "relu", "name": "fire8/relu_expand3x3", "trainable": true}}, {"name": "fire8/concat", "class_name": "Concatenate", "inbound_nodes": [[["fire8/relu_expand1x1", 0, 0, {}], ["fire8/relu_expand3x3", 0, 0, {}]]], "config": {"name": "fire8/concat", "trainable": true, "axis": 3}}, {"name": "fire9/squeeze1x1", "class_name": "Conv2D", "inbound_nodes": [[["fire8/concat", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activation": "linear", "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "use_bias": true, "filters": 64, "trainable": true, "name": "fire9/squeeze1x1", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1]}}, {"name": "fire9/relu_squeeze1x1", "class_name": "Activation", "inbound_nodes": [[["fire9/squeeze1x1", 0, 0, {}]]], "config": {"activation": "relu", "name": "fire9/relu_squeeze1x1", "trainable": true}}, {"name": "fire9/expand1x1", "class_name": "Conv2D", "inbound_nodes": [[["fire9/relu_squeeze1x1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activation": "linear", "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "use_bias": true, "filters": 256, "trainable": true, "name": "fire9/expand1x1", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1]}}, {"name": "fire9/expand3x3", "class_name": "Conv2D", "inbound_nodes": [[["fire9/relu_squeeze1x1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activation": "linear", "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "use_bias": true, "filters": 256, "trainable": true, "name": "fire9/expand3x3", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1]}}, {"name": "fire9/relu_expand1x1", "class_name": "Activation", "inbound_nodes": [[["fire9/expand1x1", 0, 0, {}]]], "config": {"activation": "relu", "name": "fire9/relu_expand1x1", "trainable": true}}, {"name": "fire9/relu_expand3x3", "class_name": "Activation", "inbound_nodes": [[["fire9/expand3x3", 0, 0, {}]]], "config": {"activation": "relu", "name": "fire9/relu_expand3x3", "trainable": true}}, {"name": "fire9/concat", "class_name": "Concatenate", "inbound_nodes": [[["fire9/relu_expand1x1", 0, 0, {}], ["fire9/relu_expand3x3", 0, 0, {}]]], "config": {"name": "fire9/concat", "trainable": true, "axis": 3}}, {"name": "drop9", "class_name": "Dropout", "inbound_nodes": [[["fire9/concat", 0, 0, {}]]], "config": {"rate": 0.5, "name": "drop9", "trainable": true, "noise_shape": null, "seed": null}}, {"name": "conv10", "class_name": "Conv2D", "inbound_nodes": [[["drop9", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activation": "linear", "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "use_bias": true, "filters": 1000, "trainable": true, "name": "conv10", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1]}}, {"name": "relu_conv10", "class_name": "Activation", "inbound_nodes": [[["conv10", 0, 0, {}]]], "config": {"activation": "relu", "name": "relu_conv10", "trainable": true}}, {"name": "global_average_pooling2d_1", "class_name": "GlobalAveragePooling2D", "inbound_nodes": [[["relu_conv10", 0, 0, {}]]], "config": {"name": "global_average_pooling2d_1", "trainable": true, "data_format": "channels_last"}}, {"name": "loss", "class_name": "Activation", "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "config": {"activation": "softmax", "name": "loss", "trainable": true}}]}}