{"class_name": "Model", "params": {"dense_1": 163840, "add_6": 0, "batch_normalization_3": 256, "conv2d_7": 73728, "dropout_1": 0, "batch_normalization_10": 1024, "conv2d_9": 8192, "dropout_3": 0, "activation_5": 0, "batch_normalization_1": 64, "add_2": 0, "dropout_5": 0, "batch_normalization_12": 1024, "conv2d_13": 589824, "dropout_2": 0, "activation_2": 0, "conv2d_8": 147456, "batch_normalization_9": 512, "conv2d_3": 36864, "conv2d_16": 589824, "activation_12": 0, "add_5": 0, "average_pooling2d_1": 0, "batch_normalization_5": 256, "activation_7": 0, "activation_6": 0, "flatten_1": 0, "add_3": 0, "conv2d_6": 36864, "activation_3": 0, "conv2d_15": 589824, "batch_normalization_11": 1024, "activation_11": 0, "batch_normalization_7": 512, "conv2d_5": 36864, "activation_13": 0, "dropout_4": 0, "conv2d_1": 432, "add_4": 0, "conv2d_10": 147456, "activation_8": 0, "dropout_6": 0, "conv2d_4": 1024, "conv2d_2": 9216, "input_1": 0, "batch_normalization_8": 512, "activation_1": 0, "conv2d_14": 32768, "batch_normalization_2": 256, "batch_normalization_13": 1024, "batch_normalization_4": 256, "activation_10": 0, "batch_normalization_6": 512, "activation_4": 0, "conv2d_11": 147456, "conv2d_12": 294912, "activation_9": 0, "add_1": 0}, "keras_version": "2.2.2", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "sparse": false, "dtype": "float32", "name": "input_1"}}, {"name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "data_format": "channels_last", "kernel_constraint": null, "name": "conv2d_1", "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": false, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "filters": 16, "bias_constraint": null, "dilation_rate": [1, 1]}}, {"name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "scale": true, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_1", "center": true, "trainable": true, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "data_format": "channels_last", "kernel_constraint": null, "name": "conv2d_2", "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": false, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "filters": 64, "bias_constraint": null, "dilation_rate": [1, 1]}}, {"name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "scale": true, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_2", "center": true, "trainable": true, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"name": "dropout_1", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "seed": null, "trainable": true, "rate": 0.3}}, {"name": "conv2d_3", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "data_format": "channels_last", "kernel_constraint": null, "name": "conv2d_3", "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": false, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "filters": 64, "bias_constraint": null, "dilation_rate": [1, 1]}}, {"name": "conv2d_4", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "data_format": "channels_last", "kernel_constraint": null, "name": "conv2d_4", "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": false, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "filters": 64, "bias_constraint": null, "dilation_rate": [1, 1]}}, {"name": "add_1", "inbound_nodes": [[["conv2d_3", 0, 0, {}], ["conv2d_4", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_1", "trainable": true}}, {"name": "batch_normalization_3", "inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "scale": true, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_3", "center": true, "trainable": true, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"name": "conv2d_5", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "data_format": "channels_last", "kernel_constraint": null, "name": "conv2d_5", "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": false, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "filters": 64, "bias_constraint": null, "dilation_rate": [1, 1]}}, {"name": "batch_normalization_4", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "scale": true, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_4", "center": true, "trainable": true, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"name": "dropout_2", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_2", "seed": null, "trainable": true, "rate": 0.3}}, {"name": "conv2d_6", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "data_format": "channels_last", "kernel_constraint": null, "name": "conv2d_6", "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": false, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "filters": 64, "bias_constraint": null, "dilation_rate": [1, 1]}}, {"name": "add_2", "inbound_nodes": [[["conv2d_6", 0, 0, {}], ["add_1", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_2", "trainable": true}}, {"name": "batch_normalization_5", "inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "scale": true, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_5", "center": true, "trainable": true, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"name": "conv2d_7", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "Conv2D", "config": {"strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "data_format": "channels_last", "kernel_constraint": null, "name": "conv2d_7", "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": false, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "filters": 128, "bias_constraint": null, "dilation_rate": [1, 1]}}, {"name": "batch_normalization_6", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "scale": true, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_6", "center": true, "trainable": true, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"name": "dropout_3", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_3", "seed": null, "trainable": true, "rate": 0.3}}, {"name": "conv2d_8", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "data_format": "channels_last", "kernel_constraint": null, "name": "conv2d_8", "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": false, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "filters": 128, "bias_constraint": null, "dilation_rate": [1, 1]}}, {"name": "conv2d_9", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "Conv2D", "config": {"strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "data_format": "channels_last", "kernel_constraint": null, "name": "conv2d_9", "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": false, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "filters": 128, "bias_constraint": null, "dilation_rate": [1, 1]}}, {"name": "add_3", "inbound_nodes": [[["conv2d_8", 0, 0, {}], ["conv2d_9", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_3", "trainable": true}}, {"name": "batch_normalization_7", "inbound_nodes": [[["add_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "scale": true, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_7", "center": true, "trainable": true, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}}, {"name": "conv2d_10", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "data_format": "channels_last", "kernel_constraint": null, "name": "conv2d_10", "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": false, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "filters": 128, "bias_constraint": null, "dilation_rate": [1, 1]}}, {"name": "batch_normalization_8", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "scale": true, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_8", "center": true, "trainable": true, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}}, {"name": "dropout_4", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_4", "seed": null, "trainable": true, "rate": 0.3}}, {"name": "conv2d_11", "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "data_format": "channels_last", "kernel_constraint": null, "name": "conv2d_11", "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": false, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "filters": 128, "bias_constraint": null, "dilation_rate": [1, 1]}}, {"name": "add_4", "inbound_nodes": [[["conv2d_11", 0, 0, {}], ["add_3", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_4", "trainable": true}}, {"name": "batch_normalization_9", "inbound_nodes": [[["add_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "scale": true, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_9", "center": true, "trainable": true, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}}, {"name": "conv2d_12", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "class_name": "Conv2D", "config": {"strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "data_format": "channels_last", "kernel_constraint": null, "name": "conv2d_12", "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": false, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "filters": 256, "bias_constraint": null, "dilation_rate": [1, 1]}}, {"name": "batch_normalization_10", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "scale": true, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_10", "center": true, "trainable": true, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "activation": "relu"}}, {"name": "dropout_5", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_5", "seed": null, "trainable": true, "rate": 0.3}}, {"name": "conv2d_13", "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "data_format": "channels_last", "kernel_constraint": null, "name": "conv2d_13", "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": false, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "filters": 256, "bias_constraint": null, "dilation_rate": [1, 1]}}, {"name": "conv2d_14", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "class_name": "Conv2D", "config": {"strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "data_format": "channels_last", "kernel_constraint": null, "name": "conv2d_14", "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": false, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "filters": 256, "bias_constraint": null, "dilation_rate": [1, 1]}}, {"name": "add_5", "inbound_nodes": [[["conv2d_13", 0, 0, {}], ["conv2d_14", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_5", "trainable": true}}, {"name": "batch_normalization_11", "inbound_nodes": [[["add_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "scale": true, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_11", "center": true, "trainable": true, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_11", "trainable": true, "activation": "relu"}}, {"name": "conv2d_15", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "data_format": "channels_last", "kernel_constraint": null, "name": "conv2d_15", "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": false, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "filters": 256, "bias_constraint": null, "dilation_rate": [1, 1]}}, {"name": "batch_normalization_12", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "scale": true, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_12", "center": true, "trainable": true, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_12", "trainable": true, "activation": "relu"}}, {"name": "dropout_6", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_6", "seed": null, "trainable": true, "rate": 0.3}}, {"name": "conv2d_16", "inbound_nodes": [[["dropout_6", 0, 0, {}]]], "class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "data_format": "channels_last", "kernel_constraint": null, "name": "conv2d_16", "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": false, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "filters": 256, "bias_constraint": null, "dilation_rate": [1, 1]}}, {"name": "add_6", "inbound_nodes": [[["conv2d_16", 0, 0, {}], ["add_5", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_6", "trainable": true}}, {"name": "batch_normalization_13", "inbound_nodes": [[["add_6", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "scale": true, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_13", "center": true, "trainable": true, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_13", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_13", "trainable": true, "activation": "relu"}}, {"name": "average_pooling2d_1", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"pool_size": [8, 8], "name": "average_pooling2d_1", "data_format": "channels_last", "padding": "same", "strides": [1, 1], "trainable": true}}, {"name": "flatten_1", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "kernel_constraint": null, "name": "dense_1", "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": false, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "bias_constraint": null}}], "output_layers": [["dense_1", 0, 0]]}, "backend": "tensorflow"}