{
    "class_name": "Model",
    "config": {
        "name": "densenet",
        "layers": [
            {
                "name": "input_1",
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        32,
                        32,
                        3
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "name": "input_1"
                },
                "inbound_nodes": []
            },
            {
                "name": "conv2d_1",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_1",
                    "trainable": true,
                    "filters": 24,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 9.999999747378752e-05
                        }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "input_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_1",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_1",
                    "trainable": true,
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 1.1e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_1",
                "class_name": "Activation",
                "config": {
                    "name": "activation_1",
                    "trainable": true,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_2",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_2",
                    "trainable": true,
                    "filters": 12,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "concatenate_1",
                "class_name": "Concatenate",
                "config": {
                    "name": "concatenate_1",
                    "trainable": true,
                    "axis": -1
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_1",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv2d_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_2",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_2",
                    "trainable": true,
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 1.1e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_2",
                "class_name": "Activation",
                "config": {
                    "name": "activation_2",
                    "trainable": true,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_3",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_3",
                    "trainable": true,
                    "filters": 12,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "concatenate_2",
                "class_name": "Concatenate",
                "config": {
                    "name": "concatenate_2",
                    "trainable": true,
                    "axis": -1
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_1",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv2d_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_3",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_3",
                    "trainable": true,
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 1.1e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_3",
                "class_name": "Activation",
                "config": {
                    "name": "activation_3",
                    "trainable": true,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_4",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_4",
                    "trainable": true,
                    "filters": 12,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "concatenate_3",
                "class_name": "Concatenate",
                "config": {
                    "name": "concatenate_3",
                    "trainable": true,
                    "axis": -1
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_2",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv2d_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_4",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_4",
                    "trainable": true,
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 1.1e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_4",
                "class_name": "Activation",
                "config": {
                    "name": "activation_4",
                    "trainable": true,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_5",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_5",
                    "trainable": true,
                    "filters": 12,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "concatenate_4",
                "class_name": "Concatenate",
                "config": {
                    "name": "concatenate_4",
                    "trainable": true,
                    "axis": -1
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_3",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv2d_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_5",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_5",
                    "trainable": true,
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 1.1e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_5",
                "class_name": "Activation",
                "config": {
                    "name": "activation_5",
                    "trainable": true,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_6",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_6",
                    "trainable": true,
                    "filters": 12,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "concatenate_5",
                "class_name": "Concatenate",
                "config": {
                    "name": "concatenate_5",
                    "trainable": true,
                    "axis": -1
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_4",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv2d_6",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_6",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_6",
                    "trainable": true,
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 1.1e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_6",
                "class_name": "Activation",
                "config": {
                    "name": "activation_6",
                    "trainable": true,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_6",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_7",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_7",
                    "trainable": true,
                    "filters": 12,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_6",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "concatenate_6",
                "class_name": "Concatenate",
                "config": {
                    "name": "concatenate_6",
                    "trainable": true,
                    "axis": -1
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_5",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv2d_7",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_7",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_7",
                    "trainable": true,
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 1.1e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_6",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_7",
                "class_name": "Activation",
                "config": {
                    "name": "activation_7",
                    "trainable": true,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_7",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_8",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_8",
                    "trainable": true,
                    "filters": 12,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_7",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "concatenate_7",
                "class_name": "Concatenate",
                "config": {
                    "name": "concatenate_7",
                    "trainable": true,
                    "axis": -1
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_6",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv2d_8",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_8",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_8",
                    "trainable": true,
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 1.1e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_7",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_8",
                "class_name": "Activation",
                "config": {
                    "name": "activation_8",
                    "trainable": true,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_8",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_9",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_9",
                    "trainable": true,
                    "filters": 12,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_8",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "concatenate_8",
                "class_name": "Concatenate",
                "config": {
                    "name": "concatenate_8",
                    "trainable": true,
                    "axis": -1
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_7",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv2d_9",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_9",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_9",
                    "trainable": true,
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 1.1e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_8",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_9",
                "class_name": "Activation",
                "config": {
                    "name": "activation_9",
                    "trainable": true,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_9",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_10",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_10",
                    "trainable": true,
                    "filters": 12,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_9",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "concatenate_9",
                "class_name": "Concatenate",
                "config": {
                    "name": "concatenate_9",
                    "trainable": true,
                    "axis": -1
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_8",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv2d_10",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_10",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_10",
                    "trainable": true,
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 1.1e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_9",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_10",
                "class_name": "Activation",
                "config": {
                    "name": "activation_10",
                    "trainable": true,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_10",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_11",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_11",
                    "trainable": true,
                    "filters": 12,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_10",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "concatenate_10",
                "class_name": "Concatenate",
                "config": {
                    "name": "concatenate_10",
                    "trainable": true,
                    "axis": -1
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_9",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv2d_11",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_11",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_11",
                    "trainable": true,
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 1.1e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
